[{"title":"New in Rails: Resource Scaffold Generator","description":"<p>Oh boy! Rails 1.2 is all about resources. A product entry in your application is not just a rendered HTML page, but it &ldquo;is&rdquo; data. Rails 1.2 allows you to add a .xml extension to your url to retrieve the same product information in XML format!</p>\n<p>Now, this all sounds hard. Two ways of rendering the same action depending on an extension. Generating XML code for every model in your database. No way you want to spend time developing all that stuff.</p>\n<p>Well, Rails wouldn&rsquo;t be Rails if there weren&rsquo;t a generator for it!</p>","link":"https://www.devroom.io/2007/01/23/new-in-rails-resource-scaffold-generator/","owner":"Ariejan de Vroom"},{"title":"Rails: Nested resource scaffold","description":"<p>In my <a href=\"http://ariejan.net/2007/01/23/new-in-rails-resource-scaffold-generator/\">previous post</a> I told you about the resource scaffold. What you&rsquo;ll be doing a lot is nesting these resources. Ingredients in recipes, comments on posts, options for products. You name it, you nest it!</p>\n<p>Since Rails does not automatically nest resources for you, you should do this yourself. This is, with some minor tweaks, really easy to accomplish. In this example I&rsquo;ll create recipes that have multiple ingredients.</p>\n<p>I assume you have Rails 1.2.1 installed for this tutorial to work properly.</p>","link":"https://www.devroom.io/2007/01/23/rails-nested-resource-scaffold/","owner":"Ariejan de Vroom"},{"title":"Updates: Wordpress 2.1, Themes and Social","description":"<p>You can&rsquo;t really see it, but Ariejan.net has been upgraded to <a href=\"http://wordpress.org\">Wordpress 2.1</a>. I&rsquo;ve been running 2.1 beta&rsquo;s on a private server for some time now, so there weren&rsquo;t any surprises during the upgrade.</p>\n<p>I&rsquo;ve also updated the theme to something more stylish and sober. Google Ads are less annoying now and merge nicely with the content. I&rsquo;ve also re-enabled the social bookmark links so you can quickly bookmark articles on Del.icio.us or Digg.</p>\n<p>Hope you like the new style. Some minor tweaks will be applied the following days where needed. Please let me know your thoughts on ariejan.net!</p>","link":"https://www.devroom.io/2007/01/23/updates-wordpress-21-themes-and-social/","owner":"Ariejan de Vroom"}]