[{"title":"Find and Replace with a MySQL Query","description":"There are times when you have a lot of data in a database (let&rsquo;s say wp_posts for a Wordpress blog like Ariejan.net). When you need to find and replace certain strings, this can be a very tedious task. Find all posts containing the &ldquo;needle&rdquo; string and manually replace all these occurrences with &ldquo;chocolate&rdquo;. With about 200 posts, you can imagine how long this would take to do manually.\nBut, as I always say: &ldquo;You&rsquo;re a programmer!","link":"https://www.devroom.io/2007/06/10/find-and-replace-with-a-mysql-query/","owner":"Ariejan de Vroom"},{"title":"Send mail with a BASH Shell Script","description":"Like any good programmer, I try to automate the crap out of everything. If you have to do it more than once, I try to write a script for it.\nThis time I want to show you how you can easily send an e-mail from a BASH script. The idea is that you want the script to send out an email to notify a user that something has happened.\nWe&rsquo;re going to use the GNU Mail utility here.","link":"https://www.devroom.io/2007/06/10/send-mail-with-a-bash-shell-script/","owner":"Ariejan de Vroom"},{"title":"Ultimate List of Ruby Resources","description":"<p>This is the first post, named &ldquo;Ruby&rdquo;, in a series of &ldquo;Ultimate List of &hellip; Resources&rdquo;. I&rsquo;m going to compose several lists for different topics I encounter during my development work. To start, I begin with Ruby. Later, I will add &ldquo;Ultimate Lists&rdquo; about Ruby on Rails, Subversion, AJAX and some other topics.</p>\n<p>Feel free to <a href=\"https://www.devroom.io/contact\">let me know</a> if I missed an important resource. I&rsquo;m also open to suggestions about other &ldquo;Ultimate Lists&rdquo;.</p>\n<p>For now, you&rsquo;ll have to settle for the &ldquo;Ultimate List of Ruby Resources&rdquo;.</p>","link":"https://www.devroom.io/2007/06/10/ultimate-list-of-ruby-resources/","owner":"Ariejan de Vroom"}]