[{"title":"Label Breaks In Go","description":"Have you ever found yourself in this situation. You have a case statement inside of a for loop and you would like to break from both the case and for statements in a single call?\nvar err error\ntimeout := time.After(30 &#42; time.Second)\nsigChan := make(chan os.Signal, 1)\nsignal.Notify(sigChan, os.Interrupt)\ncomplete := make(chan error)\ngo launchProcessor(complete)\nfor {\n&nbsp; &nbsp; select {\n&nbsp; &nbsp; case &lt;-sigChan:\n&nbsp; &nbsp; &nbsp; &nbsp;atomic.StoreInt32(&amp;shutdownFlag, 1)","link":"https://www.ardanlabs.com/blog/2013/11/label-breaks-in-go.html","owner":"William Kennedy"},{"title":"Scaling Python/Django application with Apache and mod_wsgi","description":"\n<p><a href=\"http://www.hackerearth.com/\">HackerEarth</a> is primarily based on\nPython &amp; Django. And we use Apache with\nmod_wsgi for hosting the application. There is a general complaint that Apache\nsucks when it comes to hosting Python web applications. It’s said that it’s\nslow, bloated, uses lots of memory and doesn’t perform very well. It’s also\nsaid that it doesn’t handle a high number of concurrent requests.</p>\n\n<p>All that is true if you are not running the Python application in the right\nway. If configured properly, Apache works fantastically and is usually never\nthe reason of slowness. That is almost always due to the application\nbottlenecks and database latency.</p>\n\n<p>Now I am ashamed to admit that we have been running HackerEarth frontend\nservers for a long time under bad configuration of Apache and mod_wsgi. This came up when we\nstarted load testing our servers with thousands of concurrent connections.\nAlso, we previously used to see the memory usage going on a rocket","link":"http://engineering.hackerearth.com/2013/11/21/scaling-python-django-application-apache-mod_wsgi/","owner":"HackerEarth"},{"title":"Use Project-based Interviews Instead of “GitHub”","description":"First, some background: I highly recommend that you read the following two blog posts: by Ashe Dryden: The Ethics of Unpaid Labor and the OSS Community and by James Coglan: Why Github is not your CV. They make some fantastic points and communicate the issues surrounding “Using Github as your CV”. Both of these were […]","link":"https://johnresig.com/blog/project-based-interviews/?utm_source=rss&utm_medium=rss&utm_campaign=project-based-interviews","owner":"John Resig"}]