[{"title":"Contexts Added to XHP","description":"<p>I just added a new feature to XHP to allow you pass data automatically through the hierarchy of an XHP tree being rendered. That&rsquo;s kind of a mouthful, but what it means is that you can set context (which is just a map of key/value pairs) on some parent element, and that context will be available on all rendered elements and their children. Let&rsquo;s take a look at some examples to better understand where this would be useful.</p>\n<p><!-- more --></p>\n<p>Let&rsquo;s say you have a comment section on your blog. When you are on a permalink you want the comments to be expanded, but on the feed view you only want the counts exposed with an input field. You could create an attribute to pass your view into the component and it would work just fine. The problem lies in how you&rsquo;re going to get that attribute all the way into your comment component. Your comments might reside inside a feedback form (which also holds likes and shares), which itself resides in a blog post, which m","link":"https://codebeforethehorse.tumblr.com/post/82745109442","owner":"Stefan Parker"},{"title":"Testing $HOME with Cucumber and Aruba","description":"Cucumber and Aruba are awesome tools to write acceptance tests for your command line application. The allow you to do things like this:\nScenario:Exit with 0 when no examples are run Given a file named &#34;a_no_examples_spec.rb&#34; with: &#34;&#34;&#34;ruby &#34;&#34;&#34;When I run `rspec a_no_examples_spec.rb` Then the exit status should be 0And the output should contain &#34;0 examples&#34; This example was taken from rspec-core.\nAruba basically does three things for you:\n Create and inspect files and directories Run commands Inspect output and exit status  The problem Now, if you are writing a CLI that interacts with a configuration file in the user&rsquo;s home directory, you&rsquo;d write a cucumber like this:","link":"https://www.devroom.io/2014/04/15/testing-home-with-cucumber-and-aruba/","owner":"Ariejan de Vroom"}]