[{"title":"Building Your First Enhancement using the SDK","description":"<p>This post is part 4 in an engineering blog series about building on top of the <a href=\"/blog/introducing-mixmax-sdk\">Mixmax SDK</a>. See <a href=\"/blog/introducing-mixmax-sdk\" target-\"_blank\">part 1</a>, <a href=\"/blog/giphy-slash-command\" target-\"_blank\">part 2</a>, and <a href=\"/blog/giphy-link-resolver\" target-\"_blank\">part 3</a>.</p>\n\n<p>Mixmax is a powerful email platform that brings the power of the web to your email authoring experience. Our Enhancements bring complex workflows - scheduling a meeting, creating a survey, formatting a code sample - directly to the email without ever leaving your compose window.</p>\n\n<p>Today we're going to solve another excruciating painpoint around email workflow. One that we've all felt every day, and wasted countless hours working around... Embedding a hilarious GIF in your email. That's right, we're going to make a Mixmax Enhancement that makes it really easy to search for and embed an animated GIF in your email. Like the previous parts of","link":"https://mixmax.com/blog/giphy-enhancement-sdk","owner":"Mixmax"},{"title":"Make HTTP Requests In A NativeScript Mobile Application","description":"\n                    <p>As I mentioned in some of my other posts, I’ve been exploring <a href=\"https://www.nativescript.org/\">NativeScript</a> by Telerik. So far it has proven to be a nifty platform and my attention is still invested. Previously when writing about similar technologies such as React Native and Ionic Framework, I explained how to make HTTP requests to third party web services. I demonstrated how to <a href=\"https://www.thepolyglotdeveloper.com/2014/08/make-http-requests-android-ios-ionicframework/\">make HTTP requests in Ionic Framework</a> as well as how to <a href=\"https://www.thepolyglotdeveloper.com/2015/09/make-http-requests-in-ios-with-react-native/\">make HTTP requests in React Native</a>. This time I figured it was time to do the same demonstration with NativeScript.</p>\n<p>In this guide we’ll take a look at how to make requests against a RESTful API server in an Android and iOS app using <a href=\"http://www.telerik.com/\">Telerik</a> NativeScript.</p>\n             ","link":"https://www.thepolyglotdeveloper.com/2015/11/make-http-requests-in-a-nativescript-mobile-application/","owner":"Nic Raboy"},{"title":"Multiline strings in ES6 JavaScript","description":"<p>The new kid in town is called <em>Template Strings</em>. Template Strings are demarked by a backtick(&#96;) on either end and can contain other backticks if they are escaped by a backslash(ie. <code>let my_string = `some cool \\`escaped\\` thing`</code>). This new kind of primitive in JavaScript is different from</p>","link":"https://jack.ofspades.com/multiline-strings-in-es6-javascript/","owner":"Jacopo Tarantino"}]