[{"title":"2014: Year in Review","description":"<p>Since this is the first year that TrackMaven has our Engine Room blog, this will be our first year in review. But I am hoping that this is a trend that will continue as we grow! We want to highlight a lot of what we did during 2014, and show our incredible growth as a department. You can head over to see our company-wide <a href=\"http://trackmaven.com/2014/\">2014 in review</a> to get a better understanding how TrackMaven as a whole grew, but below you will find some interesting facts about the Engineering team.</p>\n<h3>So here are the numbers:</h3>\n<ul>\n<li>+4 Engineers. We started 2014 with four engineers and have doubled in size! There were definitely some growing pains, but check out Farhan's <a href=\"/blog/onboarding-at-trackmaven/\">onboarding post</a> to see how far we've come!</li>\n<li>+8,965 code commits. Even as fast as our team has been expanding, so has the code base for TrackMaven. We are constantly trying to provide the best platform for digital marketers, and committing","link":"http://engineroom.trackmaven.com/blog/2014-year-in-review/","owner":"TrackMaven"},{"title":"60fps on the mobile web","description":"<p class=\"deck\">\nFlipboard launched during the dawn of the smartphone and tablet as a mobile-first experience, allowing us to rethink content layout principles from the web for a more elegant user experience on a variety of touchscreen form factors.\n</p>\n\n<p>Now we’re coming full circle and bringing Flipboard to the web. Much of what we do at Flipboard has value independent of what device it’s consumed on: curating the best stories from all the topics, sources, and people that you care about most. Bringing our service to the web was always a logical extension.</p>\n\n<p>As we began to tackle the project, we knew we wanted to adapt our thinking from our mobile experience to try and elevate content layout and interaction on the web. We wanted to match the polish and performance of our native apps<!--break-->, but in a way that felt true to the browser.</p>\n\n<p>Early on, after testing numerous prototypes, we decided our web experience should scroll. Our mobile apps are known for their book-","link":"http://engineering.flipboard.com//2015/02/mobile-web","owner":"Flipboard"},{"title":"Feature Spotlight: Email Tracking","description":"<p>Email Tracking in Mixmax enables you to see if and when someone reads your email. This helps you connect to people more effectively by knowing the right time to reach back out.</p>\n\n<h3>Who uses email tracking?</h3>\n\n<p><strong>Sales</strong><br>\nTrying to close a deal? By knowing if and when your business partners have read your email, you&rsquo;ll follow up more effectively.</p>\n\n<p><strong>Recruiting</strong><br>\nRespond to candidates at the right time to nurture their interest and without appearing overzealous by replying too often.</p>\n\n<p><strong>Support</strong><br>\nIf the customer hasn&rsquo;t read your helpful message, you&rsquo;ll know it&rsquo;s time to follow up. Retain customers by ensuring your help has reached them.</p>\n\n<p class=\"poet-read-more\"><a href=\"/blog/feature-spotlight-email-tracking\" title=\"Read more of Feature Spotlight: Email Tracking\">Continue reading</a></p>","link":"https://mixmax.com/blog/feature-spotlight-email-tracking","owner":"Mixmax"},{"title":"Feature Spotlight: Instant Scheduling","description":"<img src=\"/images/feature_calendar.png\" alt=\"Schedule Meetings in Mixmax\">\n\n<p>Scheduling a meeting is painful. You email someone your availability, then you have to wait for them to email back with their own availability. You hope times won&rsquo;t overlap and cross your fingers that neither party&rsquo;s availability changes&mdash;all to avoid another round of emails.</p>\n\n<p>Mixmax Instant Scheduling is a quick and effective way to share your availability and schedule one-on-one meetings. It&rsquo;s 10x faster and cuts out the back and forth. Your recipient simply picks and confirms a time right in the email, and Mixmax does the rest. It also integrates seamlessly with your Google Calendar.</p>\n\n<p class=\"poet-read-more\"><a href=\"/blog/feature-spotlight-instant-scheduling\" title=\"Read more of Feature Spotlight: Instant Scheduling\">Continue reading</a></p>","link":"https://mixmax.com/blog/feature-spotlight-instant-scheduling","owner":"Mixmax"}]