[{"title":"Congratulations, you have a lot of code!\"Congratulations, you have a lot of code!\" Remedying Android’s method limit - Part 1","description":"At SoundCloud we have been building for the Android platform since 2010. Much has changed since then: the team has grown, the list of features has grown, and our audience has grown. Today, eight engineers are working full time on the official SoundCloud app, across various areas, with contributions pouring in from other parts of the organization. Due to the growing complexity and number of contributions, the app’s size has grown substantially. Currently the app consists of approximately 1200 Java source files, not counting tests, containing approximately 86000 lines of code. This doesn’t include native code, such as our playback or recording stacks. We’re not the first to run into Android’s limits in terms of build tools. An internal limitation of Dalvik’s byte code format (DEX), which I will explain in more detail, can leave you unable to build after your codebase reaches a certain size. If you fail to anticipate this, it might happen during the most inconvenient time, such as when yo","link":"https://developers.soundcloud.com/blog/congratulations-you-have-a-lot-of-code-remedying-androids-method-limit-part-1","owner":"Soundcloud"},{"title":"Faster RSpec Regression Testing","description":"<h2>Testing Approaches</h2>\n\n<ol>\n<li><em>Immediately</em> on the code that is being developed to help guide development. Generally using a <em>subset</em> of the test suite.</li>\n<li><em>Afterwards</em> on the complete codebase to ensure no regressions appear. This is always done using the <em>complete</em> test suite.</li>\n</ol>\n\n<p>In an ideal environment, the complete test suite is run after every meaningful code change. This approach works for a small project, but it can grow into a time consuming process. Developers may only run a subset of tests that exercise the modified source code. Faster test execution allows for tighter feedback loops between testing and developing.</p>\n\n<p>Eventually the active development stops as the feature is completed. A developer wants to have a high-level of confidence in the code that they wrote before committing the changes. By running the complete test suite, one can have a certain level of assurance that the code to be committed will not cause i","link":"https://techblog.thescore.com/2015/09/21/faster-rspec-regression-testing/","owner":"theScore"},{"title":"Using Navigator Routes In Your React Native Application","description":"\n                    <p>When creating a mobile application, chances are at some point in time you’re going to want to have more than one application view or screen. In many programming languages this is referred to as application routes.</p>\n<p>With <a href=\"https://facebook.github.io/react-native/\">React Native</a>, the navigator is used to switch between screens.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/09/using-navigator-routes-in-your-react-native-application/'>Using Navigator Routes In Your React Native Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/09/using-navigator-routes-in-your-react-native-application/","owner":"Nic Raboy"}]