[{"title":"Monitor Device Battery Status Using Ionic Framework","description":"\n                    <p>So you’re making a mobile app using <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> and you care about the experience your users receive?  Maybe you want to control the functionality of certain features based on how much battery the users device has left.</p>\n<p>An example of this is, maybe you have your application pulling remote data while the application is open. Maybe you’ve decided that if your users battery is less than 30% you want the user to have to pull-to-refresh in order to preserve battery life.</p>\n<p>This kind of battery monitoring can be performed through the <a href=\"https://github.com/apache/cordova-plugin-battery-status\">cordova-plugin-battery-status</a> plugin by <a href=\"https://cordova.apache.org/\">Apache Cordova</a>.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/07/monitor-device-battery-status-using-ionic-framework/'>Monitor Device Battery Statu","link":"https://www.thepolyglotdeveloper.com/2015/07/monitor-device-battery-status-using-ionic-framework/","owner":"Nic Raboy"},{"title":"Revised and much faster, run your own high-end cloud gaming service on EC2!","description":"<iframe width=\"630\" height=\"472\" src=\"https://www.youtube.com/embed/pNs_D8JxADA\" frameborder=\"0\" allowfullscreen=\"\"></iframe>\n<p><strong>Playing Witcher 3, a GPU-intensive game on a 2015 fanless Macbook</strong></p>\n\n<p>I’ve written about using EC2 as a gaming rig <a href=\"/2015/04/12/run-your-own-high-end-cloud-gaming-service-on-ec2.html\">in the past</a>. After spending some time and getting all sorts of feedback from many people, I’m re-writing the article from before, except with all the latest and greatest optimizations to really make things better. Now we’re using things like NvFBC for graphics card H.264 encoding, using the built-in SSD for better hard drive performance, plus getting rid of things like VNC. I’ve also made the OpenVPN instructions easier to follow.</p>\n\n<p>This is the perfect solution for you fanatics that love to play AAA games but are stuck with one of the new fan-less Macbooks (or similarly slow machines). This is a pretty awesome alternative to building out a ","link":"https://lg.io/2015/07/05/revised-and-much-faster-run-your-own-highend-cloud-gaming-service-on-ec2.html","owner":"Larry Land"}]