[{"title":"\nRedis Conference 2015\n","description":"I’m back home, after a non easy trip, since to travel from San Francisco to Sicily is kinda NP complete: there are no solutions involving less than three flights. However it was definitely worth it, because the Redis Conference 2015 was very good, SF was wonderful as usually and I was able to meet with many interesting people. Here I’ll limit myself to writing a short account of the conference, but the trip was also an incredible experience because I discovered old and new friends, that are not just smart programmers, but also people I could imagine being my friends here in Sicily. I never felt alone while I was 10k kilometers away from my home.\n","link":"\nhttp://antirez.com/news/87\n","owner":"Antirez"},{"title":"Create A Random Nonce String Using JavaScript","description":"\n                    <p>Have you ever needed to come up with a random string of characters say for a password?  Maybe you’re looking for a random string of characters for an oauth 1.0 nonce. Maybe you’re in a job interview and you’re asked to generate a random alpha numeric string.</p>\n<p>Whatever the case, we’re going to look at generating a random string of characters of any given length using JavaScript.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/03/create-a-random-nonce-string-using-javascript/'>Create A Random Nonce String Using JavaScript</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/03/create-a-random-nonce-string-using-javascript/","owner":"Nic Raboy"},{"title":"One ThreadPoolExecutor to rule them all","description":"<p><b><br/></b>The Wattpad Android app is extremely complicated with a lot of multi-threading in the background.<b><br/></b></p><p>A common problem that we ran into was the need for a ThreadPoolExecutor, which could execute tasks serially when desired and everything else in parallel. </p><p>For example, we have a lot of operations that mutate a story object in the database and cache. If we don’t execute these serially, we will catch ourselves in a state that we don’t want to be in. However, operations such as asynchronous network calls can be executed in parallel.</p><p>What we found was that existing executors can only execute tasks in parallel, or serially only. It is not possible to have one executor capable of handling serial and parallel tasks at the same time. That is until now&hellip;</p><p>We created a useful class called SerialAndParallelExecutor. Depending on the type of runnable you pass in, it will execute it in a serial or parallel fashion.</p><p>For example, to run someth","link":"https://engineering.wattpad.com/post/113261142897","owner":"Wattpad"}]