[{"title":"\nWhy we don’t have benchmarks comparing Redis with other DBs\n","description":"Redis speed could be one selling point for new users, so following the trend of comparative “advertising” it should be logical to have a few comparisons at Redis.io. However there are two problems with this. One is of goals: I don’t want to convince developers to adopt Redis, we just do our best in order to provide a suitable product, and we are happy if people can get work done with it, that’s where my marketing wishes end. There is more: it is almost always impossible to compare different systems in a fair way.\n","link":"\nhttp://antirez.com/news/85\n","owner":"Antirez"},{"title":"Monitor MySQL And Auto Recover From A Crash","description":"\n                    <p>Since starting this blog in July of 2014, I have had an unexpected amount of growth. So much, that a lot of strain has been placed on my virtual private server (VPS).</p>\n<p>A common issue that has plagued me and many other WordPress users is the awful MySQL crash due to exhausted resources. This is because the server has run out of resources due to traffic spikes or other anomalies. The worst part for me is that MySQL tends to crash while I’m sleeping, putting my blog out of commission for up to six hours at a time. This is not good when you’re trying to be a reliable source of information on the internet.</p>\n<p>Luckily, I’ve developed a script that will elegantly resolve these related problems.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/01/monitor-mysql-auto-recover-crash/'>Monitor MySQL And Auto Recover From A Crash</a> appeared first on <a rel='nofollow' href='https://www.th","link":"https://www.thepolyglotdeveloper.com/2015/01/monitor-mysql-auto-recover-crash/","owner":"Nic Raboy"},{"title":"Overcoming the Challenges of Performance Testing Single-page Apps","description":"To begin with, lets talk about two of the most important things are that come to mind when we talk about performance testing. The Metrics to…","link":"https://engineering.wingify.com//posts/performance-testing/","owner":"Wingify"}]