[{"title":"goa - Untangling Microservices","description":"<p><em>The following post was initially published to the\n<a href=\"https://blog.gopheracademy.com/advent-2015/goaUntanglingMicroservices/\">Gopher Academy December 2015 Series</a>.</em></p>\n\n<h2 id=\"the-raise-of-microservice-architectures-and-apis\">The Raise of Microservice Architectures and APIs</h2>\n\n<p>After suffering through a monolithic Rails application for a number of\nyears, we shifted our focus to\nmicroservice architectures. As many others, we have encountered some of\ntheir pitfalls as well. One of them is that building good APIs is\ndifficult. Changing APIs is even more difficult. And any APIs that get\nexposed to customers are almost impossible to ever change, it seems. For\nthis reason we have focused on tools that help us design, review, and\nimplement the APIs of our microservices. One of the results of this\nfocus is <a href=\"http://goa.design\">goa</a>, which we’re just starting to use as\nour HTTP microservice framework of choice. goa was inspired from a\nprevious result of the f","link":"http://eng.rightscale.com/2015/12/11/goa-untangling-microservices.html","owner":"Rightscale"},{"title":"Sorting by Relative Popularity","description":"<p>To drive up user engagement at theScore, we recently introduced an onboarding screen that&#39;s shown when you open the app for the first time. First, you get a list of sports teams that are popular in your area, and the option to subscribe to some of them:</p>\n\n<p><img src=\"/assets/follow_teams.png\" alt=\"\"></p>\n\n<p>Now based on the teams you choose, it would be nice to also recommend some players for you to follow. So how would one go about choosing which players to recommend out of all those teams?</p>\n\n<p>Looks like I&#39;m gonna have to sort user content again! <a href=\"https://noamswebsite.wordpress.com/2014/01/23/sorting-posts-by-user-engagement-level-with-elasticsearch-implementation/\">last time</a>, I sorted user posts by &quot;interestingness&quot;; this time around I&#39;ll be sorting players from a set of sports teams. Once again we&#39;ll look at why sorting things based on popularity alone is a bad idea, we&#39;ll get a primer on standard deviation, and finally a bit of","link":"https://techblog.thescore.com/2015/12/11/sorting-players/","owner":"theScore"}]