[{"title":"Feature Spotlight: Attachment Previews","description":"<p>Attachment previews enable you to show beautiful content directly in the body of your email, which saves you the hassle of opening up attachments in a separate application. It also gives you the peace of mind that you’re sending the right document since you’ll be able to see what’s being attached.</p>\n\n<p class=\"poet-read-more\"><a href=\"/blog/feature-spotlight-attachment-previews\" title=\"Read more of Feature Spotlight: Attachment Previews\">Continue reading</a></p>","link":"https://mixmax.com/blog/feature-spotlight-attachment-previews","owner":"Mixmax"},{"title":"Monthly Challenge: Mobile Development","description":"<p>TrackMaven's next <a href=\"www.meetup.com/TrackMaven-Monthly-Challenge/\">Monthly Challenge</a> meetup will cover <a href=\"http://www.meetup.com/TrackMaven-Monthly-Challenge/events/219945053/\">mobile development</a>. To help kickstart some projects, in this post I'll cover the basics of one way to get started creating a cross-platform mobile app.</p>\n<p>We'll be using <a href=\"http://ionicframework.com/\">Ionic</a>, a framework for making beautiful, responsive mobile apps using HTML5 and AngularJS. Ionic sits on top of <a href=\"http://cordova.apache.org/\">Cordova</a> and has a <a href=\"http://ionicframework.com/blog/what-is-cordova-phonegap/\">complicated relationship</a> with <a href=\"http://phonegap.com/\">PhoneGap</a>, both of which can also be used individually for writing cross-platform mobile applications. A few other possible options for getting started in mobile development:</p>\n<ul>\n<li><a href=\"http://jlongster.com/First-Impressions-using-React-Native\">React Native</a> is (as ","link":"http://engineroom.trackmaven.com/blog/monthly-challenge-mobile-development/","owner":"TrackMaven"},{"title":"Why I’ve Gone Hybrid Over Native For Mobile Apps","description":"\n                    <p>I started developing mobile Android applications in late 2011. It wasn’t until 2012 that I released my first application to the Android Marketplace, now known as the Google Play Store. Up until early 2014, I only made native Android applications using the official <a href=\"https://developer.android.com/sdk/index.html\">Android SDK</a>. As of now, I have only been using web technologies to create mobile hybrid applications for Android and iOS.</p>\n<p>The following will explain why I’ve chosen to develop using modern web technologies rather than native mobile languages.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/02/ive-gone-hybrid-native-mobile-apps/'>Why I’ve Gone Hybrid Over Native For Mobile Apps</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/02/ive-gone-hybrid-native-mobile-apps/","owner":"Nic Raboy"}]