[{"title":"Announcing Celery Once","description":"<p>At TrackMaven we are big users of <a href=\"http://www.celeryproject.org/\">Celery</a>, an asynchronous task queue written in Python. Today we're happy to release a useful package we have been using internally called <a href=\"https://pypi.python.org/pypi/celery_once/\">Celery Once!</a></p>\n<p>Celery Once allows you to specify and run unique tasks across your distributed Celery cluster. It can be used to prevent workers performing the same task when scheduled multiple times.</p>\n<h2>Example usage</h2>\n<p>Imagine the scenario of generating and send a PDF report to a user.\nOn our web app, a user could kick off this task by submitting a form to a web server, which then triggers our Celery task.</p>\n<p>If generating the report is slow and our user hits submit multiple times, we don't want to queue up additional repeated tasks that end up spamming the user's inbox.</p>\n<p>Here is how we could solve the scenario using Celery Once!\nAfter <a href=\"https://github.com/TrackMaven/celery-once#usage","link":"http://engineroom.trackmaven.com/blog/announcing-celery-once/","owner":"TrackMaven"},{"title":"Prompt User To Rate Ionic Framework Mobile App","description":"\n                    <p>So you’ve released a great mobile app and have had a decent amount of downloads, but no one is rating or reviewing it. Downloads can be increased significantly by having a greater number of ratings.</p>\n<p>So how do you encourage more downloads in your <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> Android or iOS mobile application?  Thanks to a library created by Alex Disler called <a href=\"https://github.com/AlexDisler/ng-special-offer\">ng-special-offer</a>, we can make use of Apache Cordova native dialogs to prompt users to rate or review based on application open count.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/02/prompt-user-rate-ionic-framework-mobile-app/'>Prompt User To Rate Ionic Framework Mobile App</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/02/prompt-user-rate-ionic-framework-mobile-app/","owner":"Nic Raboy"}]