[{"title":"Navigate Between Pages In An Ionic Android And iOS App","description":"\n                    <p>In most scenarios, when developing a mobile application, you’re going to want multiple pages or screens for displaying information. In Ionic Framework 1, you’d <a href=\"https://www.thepolyglotdeveloper.com/2014/11/using-ui-router-navigate-ionicframework/\">use the AngularJS UI-Router to navigate between pages</a>, but things are different when it comes to Angular and Ionic 2. The <a href=\"https://github.com/angular-ui/ui-router\">UI-Router</a> is not present in the latest version of Ionic Framework.</p>\n<p>We’re going to take a look at navigating around an Ionic 2 application and see how easy it is.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/12/navigate-between-pages-in-an-ionic-2-android-and-ios-app/'>Navigate Between Pages In An Ionic Android And iOS App</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n           ","link":"https://www.thepolyglotdeveloper.com/2015/12/navigate-between-pages-in-an-ionic-2-android-and-ios-app/","owner":"Nic Raboy"},{"title":"New in ActiveRecord: #in_batches","description":"Rails recently introduced a new method #in_batches similar to the existing #find_in_batches method, the difference being what class the yielded object belongs to. In the case of the latter the yielded collection is an Array whereas in the new method, the yielded collection is an ActiveRecord::Relation. The following post is a usecase that we found for this new method.\nIn one of our client projects, there is code that looks like:","link":"https://crypt.codemancers.com/posts/2015-12-23-new-in-batches-method-in-active-record/","owner":"Codemancers"},{"title":"The 32 Days Of Christmas!","description":"When you have thousands of photos, it can be hard to find the photo you’re looking for. Want to search for that Christmas cat you saw at last year’s party? And what if that party wasn’t on Christmas day, but … ","link":"https://code.flickr.net/2015/12/22/32-days-of-christmas/","owner":"Flickr"}]