[{"title":"NativeScript 101: A Quickstart to Building Mobile Apps","description":"\n                    <p>I am very pleased to announce my second quickstart course titled <strong>NativeScript 101: A Quickstart to Building Mobile Apps</strong> found on the learning service <a href=\"https://www.udemy.com/nativescript-101-a-quickstart-to-building-mobile-apps/?couponCode=DEALME5\">Udemy</a>. This course follows in the same direction as the previous course I released titled <a href=\"https://www.thepolyglotdeveloper.com/2015/10/ionic-framework-101-a-quickstart-to-building-mobile-apps/\">Ionic Framework 101</a>, but instead of Ionic Framework we’re covering <a href=\"https://www.nativescript.org/\">Telerik NativeScript</a>. If you’re unfamiliar with NativeScript, it is a hybrid technology similar to Apache Cordova, but instead of using web interfaces it uses native device user interfaces giving your apps a truly native look and feel.</p>\n<p>A little background on what I hoped to accomplish in this quickstart course.</p>\n                    \n                        <p>The post ","link":"https://www.thepolyglotdeveloper.com/2015/11/nativescript-101-a-quickstart-to-building-mobile-apps/","owner":"Nic Raboy"},{"title":"Scala Barcelona Meetup","description":"<p>On Thursday 29th October we had the pleasure to be speakers in the <a href=\"http://www.meetup.com/Scala-Developers-Barcelona/\">Scala Barcelona meetup</a>. The group is very active and tries to schedule an event every two weeks to talk, discuss and enjoy coding some Scala.</p>\n\n<p>Being one of the few companies in Barcelona that use Scala in production, we were asked to do a presentation about how are we using it internally. Last June we spoke about Akka Streams and published a blog post about how to <a href=\"/2015/06/wikidata-akka-streams/\">use Akka Streams to process larges amounts of data</a>. This time we wanted to give a high level overview of how we are using Scala to do things like Natural Language Processing.</p>\n\n<p>The presentation gave an overview of some of the problems we are solving at Intent HQ to provide the audience with some context. We ran through an example of how we could implement an algorithm that allows you to link a piece of text to a topic (aka Named Entity ","link":"http://engineering.intenthq.com/2015/11/scala-bcn-meetup/","owner":"Intent HQ"}]