[{"title":"Embed Video In Your iOS And Android Ionic Framework App","description":"\n                    <p>I’ve received a few requests from my subscribers for an article regarding embedding videos in their Ionic Framework application. This could be a challenging task for a few reasons. There are known issues with the HTML5 <code>&lt;video&gt;</code> tag for Android. One might also ask how to make the videos responsive for multiple screen resolutions.</p>\n<p>In this guide, I’m going to show how to do responsive embeds of YouTube videos into an Ionic Framework list of cards.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/01/embed-video-ios-android-ionicframework-app/'>Embed Video In Your iOS And Android Ionic Framework App</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/01/embed-video-ios-android-ionicframework-app/","owner":"Nic Raboy"},{"title":"Prometheus: Monitoring at SoundCloud","description":"In\nprevious\nblog\nposts,\nwe discussed how SoundCloud has been moving towards a microservice architecture.\nSoon we had hundreds of services, with many thousand instances running and\nchanging at the same time. With our existing monitoring set-up, mostly based on\nStatsD and Graphite, we ran into a number of serious limitations. What we\nreally needed was a system with the following features: A multi-dimensional data model, so that data can be sliced and diced\nat will, along dimensions like instance, service, endpoint, and method. Operational simplicity, so that you can spin up a monitoring server\nwhere and when you want, even on your local workstation, without\nsetting up a distributed storage backend or reconfiguring the world. Scalable data collection and decentralized architecture, so that you\ncan reliably monitor the many instances of your services, and\nindependent teams can set up independent monitoring servers. Finally, a powerful query language that leverages the data model for\nmeanin","link":"https://developers.soundcloud.com/blog/prometheus-monitoring-at-soundcloud","owner":"Soundcloud"}]