[{"title":"DareDev: Part e-sports event, part blind coding party","description":"<img src=\"/images/blog/daredev/daredev48.jpg\" alt=\"DareDev\"><p class=\"poet-read-more\"><a href=\"/blog/daredev-part-e-sports-event-part-blind-coding-party\" title=\"Read more of DareDev: Part e-sports event, part blind coding party\">Continue reading</a></p>","link":"https://mixmax.com/blog/daredev-part-e-sports-event-part-blind-coding-party","owner":"Mixmax"},{"title":"Hello World","description":"Databases are the beating heart of every business in the world, running the gamut from humble spreadsheets to thousands of servers linked into vast supercomputers. And they&#x2019;ve been evolving rapidly. Most of us at Cockroach Labs have spent our careers watching them progress, often actively struggling to overcome their limitations when the task at hand outstripped their capabilities.\nBut first, why &#x201C;Cockroach&#x201D;? If you can get past their grotesque outer aspect, you&#x2019;ve got to give them credit for sheer resilience.","link":"https://www.cockroachlabs.com/blog/hello-world/","owner":"CockroachDB"},{"title":"Presenting BottomSheet","description":"<p>We are happy to introduce <a href=\"http://github.com/flipboard/bottomsheet\">BottomSheet</a> a new Open Source Android UI Component!</p>\n\n<p>At Flipboard, we love building visually stunning and highly interactive UIs. When building these UIs, we tend to build them as fairly stand alone components. This makes it very easy for our developers to implement a similar interaction model and aesthetic across the whole product while working in parallel. BottomSheet is a UI component we developed to facilitate a new interaction model for saving an article to one of your magazines (otherwise known as “The Flip UI”).\n<!--break--></p>\n\n<p>The result of our efforts is a design you can now see in the current version of Flipboard.</p>\n\n<center>\n    <div class=\"row\">\n        <img src=\"/assets/bottomsheet/flipui.gif\" style=\"max-width:95%;\" />\n    </div>\n</center>\n\n<p>BottomSheet fits perfectly with Google’s Material Design aesthetic as well, matching their Bottom Sheet <a href=\"http://www.google.com/d","link":"http://engineering.flipboard.com//2015/06/bottomsheet","owner":"Flipboard"}]