[{"title":"Run A Node.js Application On A LAMP Stack Server","description":"\n                    <p>If you’ve been keeping up with some of my previous posts, you’ll know that I’ve been making an effort to move away from <a href=\"http://framework.zend.com/\">PHP ZendFramework</a> (or PHP in general) to <a href=\"http://nodejs.org/\">Node.js</a>. Up until mid December 2014, my personal profile website <a href=\"https://www.nraboy.com/\">www.nraboy.com</a> has been using PHP ZendFramework 2, and for whatever reason it would crash my Apache instance constantly.</p>\n<p>Since mid December 2014, I’ve made the switch to <a href=\"https://expressjs.com/\">Express.js</a> framework on top of Node.js. I did a <a href=\"https://www.thepolyglotdeveloper.com/2014/12/create-simple-web-application-expressjs/\">previous post</a> on the topic of Express.js and why I like it, but it is beyond the point for this particular article.</p>\n<p>I have a few sites still running PHP and I didn’t want to pay for a new server strictly for Node.js applications. Instead I chose to run LAMP (Linux, Apa","link":"https://www.thepolyglotdeveloper.com/2015/01/run-nodejs-application-lamp-stack-server/","owner":"Nic Raboy"},{"title":"Stack Traces In Go","description":"Introduction\nHaving some basic skills in debugging Go programs can save any programmer a good amount of time trying to identify problems. I believe in logging as much information as you can, but sometimes a panic occurs and what you logged is not enough. Understanding the information in a stack trace can sometimes mean the difference between finding the bug now or needing to add more logging and waiting for it to happen again.","link":"https://www.ardanlabs.com/blog/2015/01/stack-traces-in-go.html","owner":"William Kennedy"},{"title":"The Ubiquiti EdgeRouter: Configuring this extremely low-cost, enterprise-grade router for home use","description":"<p><sub><sup><strong>Updated Jan 17, 2015:</strong> Moved the dynamic DNS away from a scheduled task to the new custom- service method</sup></sub><br />\n<sub><sup><strong>Updated Apr 3, 2016:</strong> Added dynamic DNS instructions for iwantmyname</sup></sub><br />\n<sub><sup><strong>Updated Jul 24, 2016:</strong> Added NAT-PMP for UPnP, up-to-date dynamic DNS methods, IPv6 instructions, and EdgeRouter-X mention</sup></sub></p>\n\n<p>I’ve gotten a new, inexplicable, love for <a href=\"http://www.ubnt.com\">Ubiquiti</a>. They fit in my favorite category of companies: they make high quality products that cost nothing compared to the old-boys-club equivalents. Oh and these products look spectacular. I’m actually quite surprised how UBNT is able to do all the things they do… I couldn’t support them more.</p>\n\n<p>After finding out about them from <a href=\"https://twitter.com/monkeybrainsnet\">MonkeyBrains</a>, I looked through their product line to be quite surprised at the feature sets, yet stil","link":"https://lg.io/2015/01/11/the-ubiquiti-edgerouter-configuring-this-extremely-lowcost-enterprisegrade-router-for-home-use.html","owner":"Larry Land"}]