[{"title":"Bootstrap Android OpenGL 2.0","description":"","link":"https://medium.com/wolox/bootstrap-android-opengl-2-0-9ee1107aa4ab?source=rss-1e651835442c------2","owner":"Wolox"},{"title":"Hanami and Multi-Database Testing with Travis","description":"This is a re-post of my article over at Kabisa&rsquo;s The Guild.\nI&rsquo;ve been busy rewriting Firefly for a while now using Hanami. Hanami is a fascinatingly fresh ruby web framework with a strong opinion on Clean Architecture. Me like!\nWhy test against different databases Initially I developed Firefly to use Sqlite for database storage. However, Sqlite is not always the best option. Running Firefly on Heroku for instance would be impractical, since Heroku&rsquo;s architecture assumes you use a real database, like Postgres.","link":"https://www.devroom.io/2016/04/15/hanami-and-multi-database-testing-with-travis/","owner":"Ariejan de Vroom"},{"title":"Using Local Notifications In Your NativeScript Mobile App","description":"\n                    <p>When developing mobile apps, at some point in time you may find yourself needing to show a background notification to your users. There are two types of notifications, one being the push notification which is sent from a remote server and the other being local notifications that are triggered from within the application.</p>\n<p>We’re going to focus on local notifications here.</p>\n<p>So when might you need to use a local notification?  There are many scenarios. Let’s say you’re creating an app that communicates with iBeacons. When you’re within proximity maybe you want to trigger a notification to the user. There are many other scenarios that I won’t get into.</p>\n<p>We’re going to see a basic example on how to use local notifications in a <a href=\"https://www.nativescript.org/\">NativeScript</a> Android and iOS mobile application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/04/usi","link":"https://www.thepolyglotdeveloper.com/2016/04/using-local-notifications-nativescript-mobile-app/","owner":"Nic Raboy"}]