[{"title":"Amazon Echo vs Google Home, My First Impressions","description":"\n                    <p>I don’t typically write product reviews, but since I’m a huge advocate for the Internet of Things (IoT) and smart home technologies, I think it makes sense to share some opinions. I own an <a href=\"https://www.amazon.com/echo\">Amazon Echo</a> and a second generation Amazon Echo Dot. Today (November 4th), I received my <a href=\"https://www.google.com/home\">Google Home</a> that started shipping to everyone this week.</p>\n<p>The following is my opinion between the two brands, where each succeeds and where each falls short.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/11/amazon-echo-vs-google-home-first-impressions/'>Amazon Echo vs Google Home, My First Impressions</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/11/amazon-echo-vs-google-home-first-impressions/","owner":"Nic Raboy"},{"title":"TPDP Episode #11: Continuous Integration And Deployment For The Polyglot Developer","description":"\n                    <p>Continuous integration (CI) and continuous deployment (CD) are terms that I hear thrown around quite frequently. I’ve been a software developer for a long time, but it is only recently that I’ve welcomed these terms into my life. CI and CD is the automated process of running various tasks such as unit testing or building a version controlled project. In this episode of The Polyglot Developer Podcast, I have guest speaker <a href=\"https://twitter.com/inem\">Ivan Nemytchenko</a>, from <a href=\"https://www.gitlab.com/\">GitLab</a>, helping me explain what continuous integration is all about and why GitLab has gone ahead and made a completely free set of tools around it.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/11/tpdp-episode-11-continuous-integration-deployment-polyglot-developer/'>TPDP Episode #11: Continuous Integration And Deployment For The Polyglot Developer</a> appeared first","link":"https://www.thepolyglotdeveloper.com/2016/11/tpdp-episode-11-continuous-integration-deployment-polyglot-developer/","owner":"Nic Raboy"}]