[{"title":"[Video 458] Kara Erickson and Victor Savkin: Angular 2 updates","description":null,"link":"https://dailytechvideo.com/video-458-kara-erickson-victor-savkin-angular-2-updates/","owner":"Daily Tech Video"},{"title":"Design for Testability","description":"When designing a new software project, one is often faced with a glut of choices about how to structure it. What should the core abstractions be? How should they interact with each other?\nIn this post, I want to argue for a design heuristic that I&rsquo;ve found to be a useful guide to answering or influencing many of these questions:\n Optimize your code for testability\n Specifically, this means that when you write new code, as you design it and design its relationships with the rest of the system, ask yourself this question: &ldquo;How will I test this code?","link":"https://blog.nelhage.com/2016/03/design-for-testability/","owner":"Nelson Elhage"},{"title":"Nic Raboy’s Code Blog Is Now The Polyglot Developer","description":"\n                    <p>A few days ago I announced via my <a href=\"https://newsletter.thepolyglotdeveloper.com\">email newsletter</a> that my blog, <strong>Nic Raboy’s Code Blog</strong>, found at blog.nraboy.com was going to be rebranded to <strong>The Polyglot Developer</strong>, found at <a href=\"http://www.thepolyglotdeveloper.com\">www.thepolyglotdeveloper.com</a>.</p>\n<p>I am pleased to announce that this transition has already taken place and this blog is now known as The Polyglot Developer. If you typically land on my blog via a Google Search result, don’t worry as I have appropriate redirects in place to ensure you end up where you need to be.</p>\n<p>So why did I decide to make this transition?</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/03/nic-raboys-code-blog-now-polyglot-developer/'>Nic Raboy’s Code Blog Is Now The Polyglot Developer</a> appeared first on <a rel='nofollow' href='https://www.the","link":"https://www.thepolyglotdeveloper.com/2016/03/nic-raboys-code-blog-now-polyglot-developer/","owner":"Nic Raboy"}]