[{"title":"Could CockroachDB Ever Replace Redis? A Flex Fridays Experiment","description":"The goal of CockroachDB is to &#x201C;make data easy,&#x201D; and while it seems like a stretch now, we eventually want CockroachDB to be able to act as the entire state layer for web applications. We are currently addressing the SQL layer, and a full-text search like ElasticSearch is somewhere ahead on the product horizon. Since Cockroach Labs has a Flex Fridays policy for&#xA0;work on experimental projects, I decided to use mine to experiment with implementing the Redis protocol on top of CockroachDB, attempting to answer&#xA0;the question:&#xA0;Could CockroachDB ever replace Redis?","link":"https://www.cockroachlabs.com/blog/could-cockroachdb-ever-replace-redis-a-free-fridays-experiment/","owner":"CockroachDB"},{"title":"Thanks, Amit","description":"Amit Singhal just announced that he’s retiring toward the end of the month. Amit has been a formative part of Google’s search team, but he’s also a good friend. Last year, after he marked 15 years with Google, I wrote this about Amit’s contributions: Amit Singhal, one of the unsung heroes of Google, just celebrated […]","link":"https://www.mattcutts.com/blog/thanks-amit-singhal/","owner":"Matt Cutts"},{"title":"Upload Files To Node.js Using Angular","description":"\n                    <p>When I build web applications, my least favorite part is always in the realm of file uploads. They are often complicated to do and take a lot of time. Pretty much every web application lately, regardless of what it is, requires file uploads, even if it is just to upload a profile picture.</p>\n<p>Since I’m all about <a href=\"https://angular.io/\">Angular</a> lately, I figured it would be great to show how to upload images (or any file) to a back-end. In this particular example I’m using Node.js.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/02/upload-files-to-node-js-using-angular-2/'>Upload Files To Node.js Using Angular</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/02/upload-files-to-node-js-using-angular-2/","owner":"Nic Raboy"},{"title":"Welcome rkt 1.0!","description":"About 14 months ago, CoreOS announced their intention to build a new container runtime based on the App Container Specification , introduced at the same time. Over these past 14 months, the rkt team has worked to make rkt viable for production use and get to a point where we could offer certain stability guarantees. With today’s release of rkt 1.0 , the rkt team believes we have reached that point.","link":"/blog/2016/02/welcome-rkt-1.0/","owner":"Kinvolk"}]