[{"title":"\nDisque 1.0 RC1 is out!\n","description":"Today I’m happy to announce that the first release candidate for Disque 1.0 is available.\n","link":"\nhttp://antirez.com/news/100\n","owner":"Antirez"},{"title":"FOSDEM 2016 Wrap-up: Bowling with Containers","description":"Another year, another trip to FOSDEM , arguably the best free &amp; open source software event in the world, but definitely the best in Europe. FOSDEM offers an amazingly broad range of talks which is only surpassed by the richness of its hallway track&hellip; and maybe the legendary beer event . ;)\nThis year our focus was to talk to folks about rkt , the container runtime we work on with CoreOS , and meet more people from the container development community, along with the usual catching up with old friends.","link":"/blog/2016/01/fosdem-2016-wrap-up-bowling-with-containers/","owner":"Kinvolk"},{"title":"Using An Oauth 2.0 Service Within An Ionic Mobile App","description":"\n                    <p>Previously I demonstrated <a href=\"https://www.thepolyglotdeveloper.com/2014/07/using-oauth-2-0-service-ionicframework/\">how to use Oauth in an Ionic Framework 1</a> Android and iOS mobile application, but with Ionic 2 becoming all the rage, I figured my old guide needed a refresher.</p>\n<p>Modern applications are always making use of APIs and data from third party services. The problem is, these remote services require a special kind of authentication to happen in order to work with the data they manage. The most common form of authentication for web services is Oauth.</p>\n<p>In my Ionic Framework 1 tutorial I demonstrated Google Oauth, but this time we’re going to see how to use Facebook Oauth in an Ionic 2 application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/01/using-an-oauth-2-0-service-within-an-ionic-2-mobile-app/'>Using An Oauth 2.0 Service Within An Ionic Mobile App</a","link":"https://www.thepolyglotdeveloper.com/2016/01/using-an-oauth-2-0-service-within-an-ionic-2-mobile-app/","owner":"Nic Raboy"}]