[{"title":"6 tips to succeed in our coding interviews","description":"<p>Here at Intent HQ we deal with code on a daily basis (is there any software engineering team who doesn’t?). So, when we are about to hire somebody, her ability to write code is probably the skill we will take into account the most. That’s why we do have a coding interview in our process.</p>\n\n<p>We know that sometimes candidates feel insecure and nervous when they are facing a code interview. We understand those feelings (we’ve been doing code interviews all our lives too), so we try to make you as comfortable as possible with rules like:</p>\n\n<ul>\n  <li>\n    <p>You can code in your preferred language</p>\n  </li>\n  <li>\n    <p>You can code in your preferred editor/IDE</p>\n  </li>\n  <li>\n    <p>You can google anything you want (as if you were working!)</p>\n  </li>\n</ul>\n\n<p>And, most of all, we understand that being watched by three guys while you’re coding is not the ideal coding environment, so we adjust our expectations.</p>\n\n<p>In the past years we’ve seen some average candidates","link":"http://engineering.intenthq.com/2016/01/6-tips-succeed-coding-interviews/","owner":"Intent HQ"},{"title":"Solving a Verizon issue (Nexus 5X)","description":"I solved a problem today and figured that I’d document it for the rest of the world. Every time someone left me a voicemail on Verizon, I would get a cryptic text from Verizon at 900080006202 that looked like “//VZWVVM:SYNC:ev=NM;id=1;c=1;t=v;s=1XXXXXXXXXX;dt=18/01/2016 13:40-0900;l=13;dev_t=5” or “//VZWVVM:SYNC:ev=MBU;dev_t=5”. Here’s what happened. It turns out that Verizon has three kinds of […]","link":"https://www.mattcutts.com/blog/verizon-visual-voicemail-texts/","owner":"Matt Cutts"},{"title":"Use The Android Palette Class With NativeScript","description":"\n                    <p>I’m a big fan of Material Design, the ripple (ink) effect and the use of color are my favorites. According to the Material Design spec in regards to color:</p>\n<blockquote>\n<p>Color in material design is inspired by bold hues juxtaposed with muted environments, deep shadows, and bright highlights. Material takes cues from contemporary architecture, road signs, pavement marking tape, and athletic courts. Color should be unexpected and vibrant.</p>\n</blockquote>\n<p>The other day I wanted to change the action bar color to style with a user’s profile picture. Since there is no way to guess what color the picture is going to be, <a href=\"http://developer.android.com/intl/zh-tw/reference/android/support/v7/graphics/Palette.html\">the Palette class and its methods</a> to extract colors from the image were exactly what I needed.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/01/use-android-pa","link":"https://www.thepolyglotdeveloper.com/2016/01/use-android-palette-class-nativescript/","owner":"Nic Raboy"}]