[{"title":"Component Kits for React Native","description":"<p>You won’t find as many styling solutions for React Native as you will for React JS. This stems from two simple realities:</p>\n\n<ol>\n  <li>React Native is a much smaller target for component libraries than traditional CSS frameworks. In other words, Bootstrap CSS can be used with any web framework, whereas component libraries for React Native only work with…you guessed it…React Native.</li>\n  <li>Customizing React Native styling isn’t the easiest thing in the world. Many apps demand custom styling, which makes component kits not too useful. In addition, it is challenging to customize each and every component, as the flexibility that you gain with traditional CSS on the web doesn’t carry over easily to component libraries.</li>\n</ol>\n\n<p>With that said, here are a few options.</p>\n\n<!--more-->\n\n<p>You won’t find as many styling solutions for React Native as you will for React JS. This stems from two simple realities:</p>\n\n<ol>\n  <li>React Native is a much smaller target for component ","link":"https://reactjsnews.com/component-kits-for-react-native","owner":"ReactJS News"},{"title":"Introducing Similarity Search at Flickr","description":"At Flickr, we understand that the value in our image corpus is only unlocked when our members can find photos and photographers that inspire them, so we strive to enable the discovery and appreciation of new photos. To further that … ","link":"https://code.flickr.net/2017/03/07/introducing-similarity-search-at-flickr/","owner":"Flickr"},{"title":"It's Okay to Break Things: Reflections on Khan Academy's Healthy Hackathon","description":"","link":"http://engineering.khanacademy.org/posts/its-okay-to-break-things.htm","owner":"Khan Academy"},{"title":"Leveraging ReactJS in HackerEarth Assessment Environment","description":"\n<p><a href=\"https://facebook.github.io/react/\">ReactJS</a>, as the name suggests, helps create reactive (read interactive) UIs. If we have a UI with many interactive elements and on each interaction a bunch of elements change, ReactJS efficiently updates and renders the required elements. At HackerEarth, one such UI is the programming assessment environment.</p>\n\n<p>Programming assessment environment is one of the most critical products of HackerEarth. The mockup below is a broad idea of what it is composed of.</p>\n\n<p><img src=\"/images/test_env_v2.jpg\" alt=\"HackerEarth Test Interface Mockup\" /></p>\n\n<h3 id=\"the-system-in-place\">The system in place</h3>\n\n<p>Let’s briefly understand the components in the mockup above. There are three major components:</p>\n\n<ol>\n  <li>The left pane\n    <ul>\n      <li>This is the primary navigational part of the interface. This controls which question is visible in the right pane.</li>\n      <li>It enables candidates to switch between questions as per th","link":"http://engineering.hackerearth.com/2017/03/07/leveraging-reactjs-in-hackerearth-assessment-environment/","owner":"HackerEarth"},{"title":"Research, Reuse, Recycle","description":"table { border-collapse: collapse; width: 100%; }\nth { font-family: 'AvenirLTStd-Heavy', serif !important; font-size: 18px !important; font-weight: normal !important; } td, th { border: 1px solid #dddddd !important; text-align: left !important; padding: 8px !important; background-color: #ffffff !important; }\nI recently came across an old piece on The Atlantic on design research. Author and educator Jon Freach wrote, &#x201C;Design can exist without &#x2018;the research.&#x2019; But if we don&apos;t study the world, we don&apos;t always know how or what to create.","link":"https://www.cockroachlabs.com/blog/research-reuse-recycle/","owner":"CockroachDB"}]