[{"title":"All Star Code @ GIPHY","description":"GIPHY is hosting an All Star Code site visit for their 2017 summer initiative. All Star Code is an organization dedicated to empowering young men with the skills, networks, and mindset they need to create new futures through technology - focusing primarily on Black and Latino high school males. GIPHY will be opening their office doors to All Star Code and inviting  them to learn more about GIPHY, interact with the team and gain insight first-hand into the tech industry.","link":"https://engineering.giphy.com/all-star-code-giphy-hq/","owner":"GIPHY"},{"title":"How to Earn an “A” for Android Accessibility","description":"Having spent the last ten years or so as an avid Apple accessibility user (I’m legally blind) and iOS developer, I’m pretty happy with the current state of assistive technology when it relates to my platform of choice. Every year, more progress is made across Apple’s various universal access tools and in addition, they do […]","link":"/dev/2017/05/android-accessibility/","owner":"Raizlabs"},{"title":"How to get started with Android Instant Apps","description":null,"link":"https://clevertap.com/blog/how-to-get-started-with-android-instant-apps/","owner":"CleverTap"},{"title":"Migrating to a Mobile Monorepo for React Native","description":"","link":"http://engineering.khanacademy.org/posts/react-native-monorepo.htm","owner":"Khan Academy"},{"title":"Mongo Aggregations in 5 Minutes","description":"","link":"https://engineering.universe.com/mongo-aggregations-in-5-minutes-b8e1d9c274bb?source=rss----a1cd8e0d60b2---4","owner":"Universe"},{"title":"Self-Documenting Makefiles","description":"Makefiles are making a come-back due to wide use in the golang community. The only problem is... what do they do? Reading a makefile can be hard -- it&#39;s often ugly and many of targets are for internal use only. And unlike a good CLI program, there is no equivalent of --help.\nWouldn&#39;t it be great if you could mark-up the makefile and have make help automatically produce a usage description?","link":"https://www.client9.com/self-documenting-makefiles/","owner":"Nick Galbreath"},{"title":"VAST Video Ad Service","description":"<p>Videos are more ubiquitous than ever before: there are virtually no boundaries on how, when and where people can interact with video content. Flipboard as a curation platform brings multi-format content to peoples around their personal interests and passions. There has been tremendous opportunity for video ads to perform efficiently on our platform. At Flipboard, we have been building video inventory <!--break--> since 2013 in the form of transcoding, storing, and serving proprietary format video ads on an in-house platform. As we see high-quality beautiful video ads satisfy advertisers, we also face the challenge of scaling the platform to meet the increasing demands of our video ad inventory. To bring Flipboard’s video ad inventory to a larger group of advertisers, we need a programmatic selling channel that supports standard video ad formats, provides easy performance measurement and flexible video behavior control. This is where VAST can help.</p>\n\n<div class=\"row\" style=\"text-a","link":"http://engineering.flipboard.com//2017/05/vast-video-ad","owner":"Flipboard"}]