[{"title":"Apache Cordova And Ionic Framework Apps Are Not Native Mobile Apps","description":"\n                    <p>If you’ve been keeping up with my content since the birth of <a href=\"https://www.thepolyglotdeveloper.com/\">The Polyglot Developer</a>, you’ll know that I was once a huge advocate of Apache Cordova development using frameworks like Ionic Framework. Having been a web developer and coming from native Android development with Java, cross-platform development using hybrid technologies seemed like a logical next step. Fast-forward to now, I’m no longer using Apache Cordova with Ionic Framework and have gone back to native development.</p>\n<p>I recently came across an article by Ionic’s CEO, Max Lynch, titled, <a href=\"https://medium.com/@maxlynch/cordova-ionic-apps-are-native-apps-64f9e1a995d9\">Cordova/Ionic Apps are Native Apps</a>, trying to explain that Ionic applications are native mobile applications. There are some valid points made in this article, but as someone who spent several years using the technology as well as using applications built with the technol","link":"https://www.thepolyglotdeveloper.com/2017/07/cordova-ionic-framework-not-native-mobile-apps/","owner":"Nic Raboy"},{"title":"Friday Q&A 2017-07-14: Swift.Codable\n","description":"One of the interesting additions to Swift 4 is the <code>Codable</code> protocol and the machinery around it. This is a subject near and dear to my heart, and I want to discuss what it is and how it works today.<br><a href=\"http://www.mikeash.com/pyblog/friday-qa-2017-07-14-swiftcodable.html\">(Read More)</a>","link":"http://www.mikeash.com/pyblog/friday-qa-2017-07-14-swiftcodable.html","owner":"Mike Ash"},{"title":"Keep your global NPM modules up-to-date","description":"npm can be used to install npm modules to packages (package.json), furthermore npm can be used to install npm modules globally with the command line flag \"-g\" for system wide usage. Usually this is the way to install „grunt“, „eslint“ or „npm“ itself. These globally installed npm modules cannot be monitored. They are not updated … ","link":"https://blog.versioneye.com/2017/07/14/keep-your-global-npm-modules-up-to-date/","owner":"VersionEye"},{"title":"Positive Outcomes from Zero Days","description":"In March 2017 the RAND Corporation released a report “Zero Days, Thousands of Nights: The Life and Times of Zero-Day Vulnerabilities and Their Exploits”. The goal was to assess the public policy of governments stockpiling or releasing so-called 0-day exploits. While that remains an open question, the report and underlying data set of real-world exploits provides valuable insights into software engineering for security and resilience. This talk will provide an overview of the report and what it means for builders and defenders.","link":"https://www.client9.com/positive-outcomes-from-zero-days/","owner":"Nick Galbreath"}]