[{"title":"Breaking the WiredTiger Logjam: The Wait-Free Solution (2/2)","description":"Part one of this pair explored the original algorithm the WiredTiger \r\nwrite-ahead log used to consolidate writes in order to minimize IO. It used \r\natomic compare-and-swap operations in two phases to accomplish this without \r\ntime-consuming locking. This algorithm worked extremely well as long as \r\nthere were no more than a few threads running per core. But its reliance on \r\nbusy-waiting to avoid locking caused a logjam when the number of threads \r\nincreased beyond that limit -- a serious problem given that many MongoDB \r\nworkloads would have a large number of threads per core. This issue was \r\nblocking MongoDB’s goal of making WiredTiger the default storage engine in \r\nv3.2.\r\n\r\nThis story has a happy ending thanks to my colleague, Senior Technical \r\nService Engineer Bruce Lucas. Bruce had initially uncovered the logjam and \r\nreported it to me; together, we overcame it without compromising any other \r\nworkloads. Because Bruce’s mindset was not colored by the legacy of the \r\noriginal a","link":"https://engineering.mongodb.com/post/breaking-the-wiredtiger-logjam-the-wait-free-solution-2-2","owner":"MongoDB"},{"title":"Memcached-Backed Content Infrastructure","description":"","link":"http://engineering.khanacademy.org/posts/memcached-fms.htm","owner":"Khan Academy"},{"title":"Poor man's batch processing in JPA","description":"\n<p>Working with a lot of data using plain JPA or hibernate or spring-data is possible, it does work and\nusually, it doesn&rsquo;t require a lot of extra coding. Starting small is the fastest way of getting\nthings done but you must be aware of few things that might shoot you in the foot.</p>\n<p><a href=\"https://blog.pchudzik.com/201705/batch-processing/\">Read more</a></p>","link":"https://blog.pchudzik.com/201705/batch-processing/","owner":"Paweł Chudzik"},{"title":"Why ORM shouldn’t be your best bet","description":"","link":"https://crowdfire.engineering/why-orm-shouldnt-be-your-best-bet-887e3e4ded2a?source=rss----212c5945ed6c---4","owner":"Crowdfire"}]