[{"title":"Beyond Tellerrand 2017","description":"The four of us (Charisse, Jan, Paulo & Timur) arrived early for coffee. Right before ... ","link":"https://tech.small-improvements.com/beyond-tellerrand-2017/","owner":"Small Improvements"},{"title":"Elixir Remote Debugging","description":"In Elixir, it&rsquo;s possible to connect nodes together to form a cluster in which all the nodes are visible to each other. This feature can be used to inspect and debug production apps running on remote nodes. Let&rsquo;s see how we can connect to an Elixir node running inside a docker container remotely from a local iex shell and use Erlang&rsquo;s debugger tool to set breakpoints and debug the code running in the remote node.","link":"https://crypt.codemancers.com/posts/2017-11-22-elixir-remote-debugging/","owner":"Codemancers"},{"title":"Pass Data Between Routes In A Vue.js Web Application","description":"\n                    <p>A few weeks ago I had written about <a href=\"https://www.thepolyglotdeveloper.com/2017/11/router-navigate-pages-vuejs-application/\">creating routes and navigating a Vue.js web application</a>. It was a basic example of getting around in an application.</p>\n<p>Often, when building navigation into your application, you&rsquo;ll find that you need to pass data from one screen to another. For example, maybe you&rsquo;re following the master-detail pattern where you have a list of data and you get more information about a particular item in the list by drilling deeper.</p>\n<p>We&rsquo;re going to see how to pass data between routes in a <a href=\"https://vuejs.org\">Vue.js</a> web application using a router and URL parameters as well as query parameters.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/11/pass-data-between-routes-vuejs-web-application/'>Pass Data Between Routes In A Vue.js We","link":"https://www.thepolyglotdeveloper.com/2017/11/pass-data-between-routes-vuejs-web-application/","owner":"Nic Raboy"},{"title":"Sampling for NPS surveys","description":"","link":"https://envoy.engineering/sampling-for-nps-surveys-1def21ba5e6b?source=rss----d8aa51f79fb---4","owner":"Envoy"}]