[{"title":"CSS System Font Stack Sans Serif v2","description":"This is an update to the original native font stack article. It attempts to use the sans serif font used by operating system for user interfaces. This is best for buttons and other UI elements on the page, but it also works for body text.\nWhat&#39;s Changed? The W3C CSS Fonts 4 draft now includes a built-in font system-ui. It should render using the native sans-serif font. It&#39;s implemented in:","link":"https://www.client9.com/css-system-font-stack-sans-serif-v2/","owner":"Nick Galbreath"},{"title":"Repair: Rotel RB-970BX","description":"Another lucky find: Rotel RB-970BX Power Amplifier with one defective channel. Let&rsquo;s fix this!","link":"https://www.devroom.io/projects/repair-rotel-rb-970bx/","owner":"Ariejan de Vroom"},{"title":"The Cliffs of Insanity: Dramatic Shifts in Technologies on Stack Overflow","description":null,"link":"https://stackoverflow.blog/2017/11/13/cliffs-insanity-dramatic-shifts-technologies-stack-overflow/","owner":"Stack Overflow"},{"title":"Using A Mapbox In A NativeScript Angular Application","description":"\n                    <p>Including map functionality in your mobile application is often a very important necessity, depending on the scenario. Maybe your application needs to do navigation, or simply just show locations on a map.</p>\n<p>There are many different map providers, the most popular being Google Maps. However, <a href=\"https://www.mapbox.com/\">Mapbox</a> is picking up steam because of how easy it is to use and its pricing model.</p>\n<p>We&rsquo;re going to see how to include Mapbox in our <a href=\"https://www.nativescript.org\">NativeScript</a> Android and iOS mobile application using Angular and TypeScript.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/11/mapbox-nativescript-angular-application/'>Using A Mapbox In A NativeScript Angular Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n             ","link":"https://www.thepolyglotdeveloper.com/2017/11/mapbox-nativescript-angular-application/","owner":"Nic Raboy"}]