[{"title":"Consume Remote API Data From Within A Node.js Application","description":"\n                    <p>Not too long I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2017/07/consume-restful-api-endpoints-golang-application/\">consuming remote API data using Golang</a>. However, as you know, I&rsquo;m also a heavy Node.js developer as well. So how do we issue HTTP requests from within a Node.js application and why might you want to. The simple answer is that you might want to consume someone else&rsquo;s data within your web application and you can&rsquo;t just do that like you would in a browser-based application using Ajax or similar.</p>\n<p>We&rsquo;re going to see how to make HTTP requests possible within Node.js.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/10/consume-remote-api-data-nodejs-application/'>Consume Remote API Data From Within A Node.js Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>","link":"https://www.thepolyglotdeveloper.com/2017/10/consume-remote-api-data-nodejs-application/","owner":"Nic Raboy"},{"title":"Habitat Operator - Running Habitat Services with Kubernetes","description":"For the last few months, we’ve been working with the Habitat team at Chef to make Habitat-packaged applications run well in Kubernetes . The result of this collaboration is the Habitat Operator , a Kubernetes controller used to deploy, configure and manage applications packaged with Habitat inside of Kubernetes. This article will give an overview of that work — particularly the issues to address, solutions to those issues, and future work.","link":"/blog/2017/10/habitat-operator-running-habitat-services-with-kubernetes/","owner":"Kinvolk"},{"title":"Mock verifications in spock","description":"\n<div class=\"paragraph\">\n<p>I do like to write tests in <a href=\"http://spockframework.org/\">Spock</a>. I&#8217;m not sure if I know every feature\navailable but until lately I felt comfortable with my knowledge. Obviously, I should not. There is\nalways something that can catch you off guard. The question is how long will it take to figure out\nwhat&#8217;s happen.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201710/mock-verifications-in-spock/\">Read more</a></p>","link":"https://blog.pchudzik.com/201710/mock-verifications-in-spock/","owner":"Paweł Chudzik"}]