[{"title":"Clustering Similar Stories Using LDA","description":"<p>There is more to a story than meets the eye, and some stories deserve to be presented from more than just one perspective. With Flipboard 4.0, we have released story roundups, a new feature that adds coverage from multiple sources to a story and provides you with a fuller picture of an event. <!--break--></p>\n\n<p>Here’s how it looks:</p>\n\n<div class=\"row\" style=\"text-align: center\">\n    <img src=\"/assets/storyclustering/storycluster.gif\" style=\"max-width:50%;\" />\n</div>\n\n<p>With our scale of millions of articles and constant stream of documents, it’s impossible to generate these roundups manually. So, we have developed a clustering algorithm that’s both fast and scalable, and in this blog post, I will explain how we create these roundups on Flipboard.</p>\n\n<h2 id=\"why-is-this-difficult\">Why is this difficult?</h2>\n\n<p>Although there are many sophisticated automatic clustering algorithms, such as <a href=\"https://en.wikipedia.org/wiki/K-means_clustering\">K-means</a> or <a href=\"https","link":"http://engineering.flipboard.com//2017/02/storyclustering","owner":"Flipboard"},{"title":"Diagnostics to Ease Installation and Troubleshooting of ElasticKube","description":null,"link":"https://www.ctl.io/developers/blog/post/installation-troubleshooting-elastickube","owner":"CenturyLink"},{"title":"Why is NuGet search in Rider so fast?","description":"<p>I&rsquo;m the guy who develops the NuGet manager in <a href=\"https://www.jetbrains.com/rider/\">Rider</a>.\nIt&rsquo;s not ready yet, there are some bugs here and there, but it already works pretty well.\nThe feature which I am most proud of is smart and fast search:</p>\n<div class=\"mx-auto\">\n<img class=\"mx-auto d-block\" width=\"400\" src=\"https://aakinshin.net/img/posts/dotnet/rider-nuget-search/front.gif\" />\n</div>\n<p>Today I want to share with you some technical details about how it was implemented.</p>","link":"https://aakinshin.net/posts/rider-nuget-search/","owner":"Andrey Akinshin"}]