[{"title":"Speaking at FlatMap Oslo about Property Based Testing","description":"In the beginning of May I’m heading to FlatMap in Oslo to give a 90 minute workshop about Better testing with less code.  I will go through the basics of property based testing with ScalaCheck. About half the time will be hands on exercises to get a feel for the framework a get comfortable enough […]","link":"http://engineering.speedledger.com/speaking-at-flatmap-oslo-about-property-based-testing/","owner":"Speedledger"},{"title":"Using A SQLite Database For Local Data In A Golang Application","description":"\n                    <p>When developing an application with the Go programming language, you might find yourself needing to save data locally. If you’ve been keeping up you’ll remember that I’ve written about storing data remotely with <a href=\"https://www.thepolyglotdeveloper.com/2016/08/using-couchbase-server-golang-web-application/\">Golang in a Couchbase NoSQL database</a>, but never anything locally. Probably the easiest way to store data locally is with a SQLite database as it is a solid technology that has been around for a while.</p>\n<p>We’re going to see how to use a SQLite database in our Golang application to read and write local data.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/04/using-sqlite-database-golang-application/'>Using A SQLite Database For Local Data In A Golang Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>","link":"https://www.thepolyglotdeveloper.com/2017/04/using-sqlite-database-golang-application/","owner":"Nic Raboy"},{"title":"Yarn-ifying Mixmax","description":"<p>Last week, we finished transitioning all of our services and <a href=\"https://www.npmjs.com/org/mixmaxhq\">shared modules</a> to <a href=\"https://yarnpkg.com/en/\">Yarn</a>, Facebook’s replacement for <code>npm</code>. Here’s how we decided to make the move, how we did it, and what we learned along the way.</p>\n<p class=\"poet-read-more\"><a href=\"/blog/yarn-ifying-mixmax\" title=\"Read more of Yarn-ifying Mixmax\">Continue reading</a></p>","link":"https://mixmax.com/blog/yarn-ifying-mixmax","owner":"Mixmax"}]