[{"title":"Authenticate With JWT In A NativeScript Angular Mobile Application","description":"\n                    <p>Any mobile application that accesses remote data will need authentication at some point in time. There are many different authentication strategies out there, one of which is with Json Web Tokens (JWT) that we explored in <a href=\"https://www.thepolyglotdeveloper.com/2017/03/jwt-authentication-in-a-node-js-powered-api/\">one of my previous Node.js articles</a>. With JWT, users can authenticate via username and password, receive a signed token back, and use that token for any future API request rather than continuing to distribute the username and password.</p>\n<p>In this tutorial we’re going to explore how to build an Android and iOS mobile application using <a href=\"https://www.nativescript.org/\">NativeScript</a> and <a href=\"https://angular.io/\">Angular</a> that authenticates with an API and then uses a Json Web Token for future requests to that same API.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglo","link":"https://www.thepolyglotdeveloper.com/2017/03/authenticate-jwt-nativescript-angular-mobile-application/","owner":"Nic Raboy"},{"title":"Debugging iOS Simulator network calls (for free)","description":"","link":"https://up.smartrecruiters.com/debugging-ios-simulator-network-calls-for-free-b8e02a0c9bed?source=rss----daef777a2064---4","owner":"SmartRecruiters"},{"title":"Epoll is fundamentally broken 2/2","description":"","link":"https://idea.popcount.org/2017-03-20-epoll-is-fundamentally-broken-22","owner":"Marek Majkowski"},{"title":"Even more ways to enhance your communication with Droplr","description":"<p>Enhancing communication is at the core of our Mixmax DNA. We’re always looking for ways to bring communication out of the stone age, and help professionals communicate better. And we couldn’t be happier to announce our newest integration with one of the best tools in the game - <a href=\"https://droplr.com/\">Droplr.</a><p class=\"poet-read-more\"><a href=\"/blog/even-more-ways-to-enhance-your-communication-with-droplr\" title=\"Read more of Even more ways to enhance your communication with Droplr\">Continue reading</a></p>","link":"https://mixmax.com/blog/even-more-ways-to-enhance-your-communication-with-droplr","owner":"Mixmax"},{"title":"Image Zoom with plain JavaScript and CSS","description":"Note: I&rsquo;ve moved away from the solution outlined in this post. Mainly because I did not want to write an entire gallery from scratch. I&rsquo;ve since opted to use lightgallery.js which is a pure JS image gallery solution with some nice goodies.\nThe premise is simple. A post may contain images. These images are restricted in rendered size to keep the flow of the page in tact. Clicking an image allows you to zoom in.","link":"https://www.devroom.io/2017/03/20/image-zoom-with-plain-javascript-and-css/","owner":"Ariejan de Vroom"},{"title":"Trivial meta-programming with cinaps","description":"<p>From now and then, I found myself having to write some mechanical and repetitive\ncode. The usual solution for this is to write a code generator; for instance in\nthe form of a ppx rewriter in the case of OCaml code. This however comes with a\ncost: code generators are harder to review than plain code and it is a new\nsyntax to learn for other developers. So when the repetitive pattern is local to\na specific library or not widely used, it is often not worth the effort.\nEspecially if the code in question is meant to be reviewed and maintained by\nseveral people.</p>\n\n","link":"https://blog.janestreet.com/trivial-meta-programming-with-cinaps/","owner":"Jane Street"}]