[{"title":"Android Things: first look","description":"<h2 id=\"what-is-android-things\">What is Android Things?</h2>\n\n<p>Android Things is an alternative Android version, announced at Google I/O 2015,\nand released as a first developer preview in December 2016. Its purpose is to\ndevelop embedded IoT devices, with a known and widely documented Android\necosystem basis.</p>\n\n<p>It&rsquo;s currently running on three different boards: the Intel Edison, the NXP Pico\ni.MX6UL, and the Raspberry Pi 3. Some higher-end boards are coming soon.</p>\n\n<p>On the SDK side, Android Things comes with a specific support library to ease\nlow-level hardware usage. It consists in two parts: the Peripheral I/O API,\nwhich supports GPIO, PWM, I2C, SPI and UART, and the User Driver API, which\nallows a developer to write a hardware-specific, high-level driver, to ease\nhardware reusability by injecting events into the Android framework. Other\napplications can in turn use those events without having to interact with the\nhardware directly.</p>\n\n<p>There&rsquo;s a down side","link":"https://enoent.fr/posts/android-things-first-look/","owner":"Marc Plano-Lesay"},{"title":"Display System Information On The Onion Omega2 OLED Expansion","description":"\n                    <p>So I was a recent <a href=\"https://www.kickstarter.com/projects/onion/omega2-5-iot-computer-with-wi-fi-powered-by-linux\">Kickstarter</a> backer for the <a href=\"https://onion.io/\">Onion Omega2</a> Internet of Things (IoT) device. My package finally came and I wanted to see what I can do with it. My package included the Omega2, expansion dock, and OLED display so I figured it would be cool to write an application that displayed to the screen.</p>\n<p>A problem I always had with the Raspberry Pi, my other favorite IoT device, is that I never knew the IP address or system information because I was always using it as a headless unit. With that in mind, I decided to write an application that displayed this information to the Onion Omega2 OLED screen at boot.</p>\n<p>We’re going to see how to write a basic script to show system information using Python and the OLED extension library.</p>\n                    \n                        <p>The post <a rel='nofollow' href='ht","link":"https://www.thepolyglotdeveloper.com/2017/01/display-system-information-on-the-onion-omega2-oled-expansion/","owner":"Nic Raboy"},{"title":"Select is fundamentally broken","description":"","link":"https://idea.popcount.org/2017-01-06-select-is-fundamentally-broken","owner":"Marek Majkowski"}]