[{"title":"apd: An Arbitrary-Precision Decimal Package for Go","description":"With the release of CockroachDB beta-20170223, we&#x2019;d like to announce a new arbitrary-precision decimal package for Go: apd. This package replaces the underlying implementation of the DECIMAL type in CockroachDB and is available for anyone to fork and use. Here we will describe why we made apd, some of its features, and how it improved CockroachDB.\nBackground on Decimals The two standard numeric types in computing are integers and floats, which handle the two main problems in number representation: the need for exact integral numbers within a fixed, relatively small range (ints) and the need for numbers, within an arbitrarily large range, that can be approximate (floats).","link":"https://www.cockroachlabs.com/blog/apd-arbitrary-precision-decimal-package/","owner":"CockroachDB"},{"title":"One more talk, two more videos","description":"<p>I’m happy to announce our next <a href=\"https://events.janestreet.com/home/tech-talks/\">public tech\ntalk</a>, called <strong>Seven\nImplementations of Incremental</strong>, on Wednesday, April 5th, presented by yours\ntruly. You can register\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdtly4y-jYcLUVH8BJS-uKoiaKrQlRXSIWZeczw3tgwTx_6HA/viewform?c=0&amp;w=1\">here</a>.</p>\n\n","link":"https://blog.janestreet.com/one-more-talk-two-more-videos/","owner":"Jane Street"},{"title":"Use NGINX As A Reverse Proxy To Your Containerized Docker Applications","description":"\n                    <p>You might have noticed that I’m doing quite a bit of <a href=\"https://www.docker.com/\">Docker</a> related articles lately. This is because I’ve been exploring it as an option for the future of my personal web applications. As of right now I’m serving several web applications on <a href=\"https://www.digitalocean.com/?refcode=ee4903914bb4\">Digital Ocean</a> under a single Apache instance. As requests come into my server, Apache routes them to the appropriate application via virtual hosts. Each application is a different directory on the virtual private server (VPS). If I were to containerize each application, things would behave a bit differently. I would need to set up a reverse proxy to route each request to a different container on the host.</p>\n<p>While Apache can work as a reverse proxy, there are other options that work way better. For example NGINX is known for being an awesome reverse proxy solution. We’re going to see how to create several web application","link":"https://www.thepolyglotdeveloper.com/2017/03/nginx-reverse-proxy-containerized-docker-applications/","owner":"Nic Raboy"},{"title":"When to pair program","description":"<p><em>This post is another one brought to you by the good people at InRhythm. If you're an engineer that likes writing and building strong, happy culture focused on learning and growth you should apply! I like working with smart, passionate people :).</em></p>\n\n<p>Lots of companies embrace pair programming as a way</p>","link":"https://jack.ofspades.com/when-to-pair-program/","owner":"Jacopo Tarantino"},{"title":"Why I coach","description":"<p><a href=\"http://www.makersacademy.com\">Makers Academy</a> is a programming bootcamp.  I’ve coached there for the last nine months.  I love it.</p>\n\n<p>In this essay, I’ll describe some of my favourite parts of coaching.  For each part, I’ll explain how my work supports a learning goal at Makers.  And I’ll explain how the environment at Makers supports this learning goal.</p>\n\n<p>Note: we refer to our students as developers.</p>\n\n<h3 id=\"giving-as-little-help-as-possible\">Giving as little help as possible</h3>\n\n<p>At Makers, developers lead their own learning.  This lets them follow their curiosity.  It lets them learn in their own style.  It lets them learn at their own pace.</p>\n\n<p>I support the developers with their self-led learning.  Sometimes, a developer may ask me for help.  Every problem is a chance for them to learn.  I want to avoid robbing them of that chance.  I want them to wring the maximum amount of learning from the problem. I try to identify the tiniest nudge that ","link":"https://maryrosecook.com/blog/post/why-i-coach","owner":"Mary Rose Cook"}]