[{"title":"Exercise Based Interviewing at Cockroach Labs","description":"When I first started at Cockroach Labs, the founders and I had a candid conversation about diversity. Studies have shown that diverse companies have a greater likelihood of success through higher employee performance and financial returns [2015 McKinsey report]. We agreed that it was important for us to attract a diverse workforce and concluded that the best way to do so was through creating an inclusive environment. In addition to internal initiatives, we set out on a mission to remove bias from our interview process or more realistically, challenge the bias that our interviewers face when assessing candidates.","link":"https://www.cockroachlabs.com/blog/exercise-based-interviewing/","owner":"CockroachDB"},{"title":"Getting Familiar with Gulp for Workflow Automation","description":"\n                    <p>I&rsquo;ve been developing web applications for as long as I can remember and there are certain repetitive tasks that I do between the development and deployment of each final product. For example, current web standards demand that web resources like CSS, and JavaScript be minified or images be compressed. We could easily do this by hand or with helper applications, but why would you want to?</p>\n<p>Instead, repetitive tasks can, and should, be transformed into an automated workflow, something that is particularly useful when it comes to continuous integration and continuous deployment.</p>\n<p>We&rsquo;re going to see how to create a an automated workflow using the <a href=\"https://gulpjs.com/\">Gulp</a> toolkit to do simple tasks like cleaning, minification, copying, altering, and even deploying projects.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/09/getting-familiar-with-gulp-fo","link":"https://www.thepolyglotdeveloper.com/2017/09/getting-familiar-with-gulp-for-workflow-automation/","owner":"Nic Raboy"},{"title":"GIPHY @ PennApps","description":"Founded in the fall of 2009, PennApps was the nation's first student-run college hackathon and GIPHY is a proud sponsor this year! Over a thousand students from the U.S. and other countries like Switzerland, Canada, England, and Singapore will be in Philadelphia for a weekend of creation and discovery. GIPHY is excited to be part of the fun.","link":"https://engineering.giphy.com/giphy-pennapps/","owner":"GIPHY"},{"title":"Ok Google, Talk to Vogue","description":"A partnership with Google Home introduced welcome constraints, allowing us to tightly scope, build and ship Condé Nast’s first voice application in just a few weeks.","link":"https://technology.condenast.com/story/vogue-on-google-home","owner":"Condé Nast"},{"title":"Playing with kernel TLS in Linux 4.13 and Go","description":"kg-card-begin: markdown","link":"https://blog.filippo.io/playing-with-kernel-tls-in-linux-4-13-and-go/","owner":"Filippo Valsorda"}]