[{"title":"I'm Glad I Failed In Front of Millions on Shark Tank","description":"<p><span class='marginnote'><img class='fullwidth' src='/assets/img/posts/meonst.jpg'/><br>That&#39;s me on Shark Tank. It&#39;s episode 12 or 13 of season 1.</span></p>\n\n<p>When I was 19 years old, I appeared on the American reality television show <a href=\"https://en.wikipedia.org/wiki/Shark_Tank\">Shark Tank</a>. The premise is simple: entrepreneurs pitch a hard-boiled set of investors to give them money for a piece of their business. It&#39;s based on a Japanese television show called <a href=\"https://en.wikipedia.org/wiki/Dragons%27_Den\">Dragon&#39;s Den</a>.</p>\n\n<p>I appeared on Shark Tank in 2009. I wasn&#39;t shy about it - it&#39;s been a part of my &quot;bio&quot; for years. What I have been afraid to say to others, though, is that I didn&#39;t have a very good time during or after my appearance. The Sharks didn&#39;t invest in my company, and I endured something of a dressing-down on live television.</p>\n\n<p>The experience deeply affected my psyche in ways I didn&#39;t reali","link":"https://www.nateberkopec.com/blog/2017/10/04/failing-on-shark-tank-changed-my-life.html","owner":"Nate Berkopec"},{"title":"Introducing GIPHY Developers","description":"We’re excited to announce the launch of GIPHY Developers: a one-stop shop and interactive resource for developers interested in getting started with GIPHY’s API offerings! By visiting our new portal, aspiring GIPHY developers can read top-level guides as well as detailed technical documentation regarding the GIPHY API’s many endpoints. It’s easier than ever to get […]","link":"https://engineering.giphy.com/introducing-giphy-developers/","owner":"GIPHY"},{"title":"Migrating towards Yarn and Webpack","description":"For the past couple of years, we have been using require.js for module loading and Grunt for automating tasks on front-end, for one out of…","link":"https://engineering.wingify.com//posts/migrating-towards-yarn-webpack/","owner":"Wingify"},{"title":"SoundCloud's Data Science Process","description":"Here at SoundCloud, we’ve been working on helping our Data Scientists be more effective, happy, and productive. We revamped our organizational structure, clearly defined the role of a Data Scientist and a Data Engineer, introduced working groups to solve common problems (like this), and positioned ourselves to do incredible work! Most recently, we started thinking about the work that a Data Scientist does, and how best to describe and share the process that we use to work on a business problem. Based on the experiences of our Data Scientists, we distilled a set of steps, tips and general guidance representing the best practices that we collectively know of and agree to as a community of practitioners.","link":"https://developers.soundcloud.com/blog/soundclouds-data-science-process","owner":"Soundcloud"},{"title":"The scrypt parameters","description":"kg-card-begin: markdown","link":"https://blog.filippo.io/the-scrypt-parameters/","owner":"Filippo Valsorda"},{"title":"Visioncamp: betaworks + GIPHY","description":"January 2018 betaworks HQ – New York, NY Betaworks is rolling out visioncamp, a thematically-driven, frontier tech accelerator focused on the visual computing space, and GIPHY is thrilled to be a part of it. Visioncamp, beginning in January 2018, is the third camp program out of betaworks and will focus on AR, computer vision, and […]","link":"https://engineering.giphy.com/visioncamp-betaworks-giphy/","owner":"GIPHY"},{"title":"Write Guest Articles On The Polyglot Developer Blog","description":"\n                    <p>Do you find the content on The Polyglot Developer valuable? What if I told you that you could contribute valuable content to other developers as well?</p>\n<p>I wanted to let you know that I&rsquo;m currently accepting original guest content, from talented developers like yourself, on a variety of awesome topics.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/10/write-guest-articles-polyglot-developer/'>Write Guest Articles On The Polyglot Developer Blog</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2017/10/write-guest-articles-polyglot-developer/","owner":"Nic Raboy"}]