[{"title":"All Systems Go! - The Userspace Linux Conference","description":"At Kinvolk we spend a lot of time working on and talking about the Linux userspace. We can regularly be found presenting our work at various events and discussing the details of our work with those who are interested. These events are usually either very generally about open source, or focused on a very specific technology, like containers , systemd , or ebpf . While these events are often awesome, and absolutely essential, they simply have a focus that is either too broad, or too specific.","link":"/blog/2017/07/all-systems-go-the-userspace-linux-conference/","owner":"Kinvolk"},{"title":"Disable Transparent Hugepages","description":"tl;dr &ldquo;Transparent Hugepages&rdquo; is a Linux kernel feature intended to improve performance by making more efficient use of your processor&rsquo;s memory-mapping hardware. It is enabled (&ldquo;enabled=always&rdquo;) by default in most Linux distributions.\nTransparent Hugepages gives some applications a small performance improvement (~ 10% at best, 0-3% more typically), but can cause significant performance problems, or even apparent memory leaks at worst.\nTo avoid these problems, you should set enabled=madvise on your servers by running","link":"https://blog.nelhage.com/post/transparent-hugepages/","owner":"Nelson Elhage"},{"title":"Immutability in angular","description":"\n<p>Some time ago I&rsquo;ve been struggling with mapping hierarchical data structure in angular. Labels\nhierarchy was complex (like 4 levels deep with multiple parents, multiple children, basically graph\nlike structure with some logic behind it). In the end it was/is still working but that&rsquo;s the\nbest I can say about it.</p>\n<p><a href=\"https://blog.pchudzik.com/201707/immutability-in-angular/\">Read more</a></p>","link":"https://blog.pchudzik.com/201707/immutability-in-angular/","owner":"Paweł Chudzik"},{"title":"Introducing Channels: Private Q&A for Your Team","description":null,"link":"https://stackoverflow.blog/2017/07/11/introducing-channels-private-qa-team/","owner":"Stack Overflow"},{"title":"Let's Reduce! A Gentle Introduction to Javascript's Reduce Method","description":"","link":"http://engineering.khanacademy.org/posts/lets-reduce.htm","owner":"Khan Academy"},{"title":"Securing W Magazine: Our Migration to HTTPS","description":"After getting Wired on HTTPS last year, we made the push for W Magazine next. Here's how we did it.","link":"https://technology.condenast.com/story/securing-w-magazine-our-migration-to-https","owner":"Condé Nast"}]