[{"title":"Clustering applied to showers in the OPERA","description":"<!-- TODO: tags for social networks -->\n<p>\n\t<i>\n\t\tAbstract: in this post I discuss clustering: \n\t\ttechniques that form this method and some peculiarities of using clustering in practice.\n\t\tThis post continues <a href='/2017/06/24/opera.html'>previous one</a> about the OPERA.\n\t</i>\n</p>\n\n<p>\n\t<strong>Update:</strong> now you can play with a 3-dimensional\n\t<a href=\"https://arogozhnikov.github.io/clustering_visualizations/\">visualization of clustering</a>.\n\n</p>\n<p>\n\t<img src='/images/opera/post/opera-step3.png' style='margin: 20px 0px;' />\n</p>\n\n<h2>\n\tWhat is clustering and when it is needed?\n</h2>\n<p>\n\tClustering is a typical problem of unsupervised machine learning. \n\tGiven a set of objects (also called observations), split them into groups (called clusters) so that objects in each group are more similar to each other \n\tthan to observations from other groups.\n</p>\n<p>\n\tClustering may become the right tool to identify structure of the data.\n\tFor instance, cluster analysis helped in 199","link":"https://arogozhnikov.github.io/2017/07/10/opera-clustering.html","owner":"Alex Rogozhnikov"},{"title":"Display Local Notifications In A NativeScript Application With Angular","description":"\n                    <p>A while back I wrote a tutorial that demonstrated <a href=\"https://www.thepolyglotdeveloper.com/2016/04/using-local-notifications-nativescript-mobile-app/\">how to use local notifications in a NativeScript Core project</a>, also referred to as a vanilla NativeScript project. Since writing that tutorial I had received several requests to demonstrate the same in a NativeScript with Angular project.</p>\n<p>If you’re unfamiliar, local notifications are scheduled notifications rather than notifications sent from a server. These notifications are useful when you need to trigger reminders in your application or based on events. For example, maybe you develop an iBeacon application and as you approach an iBeacon you want to receive a notification. This type of notification would be a local notification.</p>\n<p>We’re going to see how to schedule and display notifications in Android and iOS using <a href=\"https://www.nativescript.org/\">NativeScript</a> and Angular.</p>\n   ","link":"https://www.thepolyglotdeveloper.com/2017/07/display-local-notifications-nativescript-application-angular/","owner":"Nic Raboy"},{"title":"Mixmax calendar improvements","description":"<p>We’re excited to share a series of improvements to your Mixmax calendar. We know how frustrating scheduling can be, whether you’re scheduling meetings for yourself or for your team. We decided to fix it. <p class=\"poet-read-more\"><a href=\"/blog/mixmax-calendar-improvements\" title=\"Read more of Mixmax calendar improvements\">Continue reading</a></p>","link":"https://mixmax.com/blog/mixmax-calendar-improvements","owner":"Mixmax"}]