[{"title":"Concurrent Golang Applications With Goroutines And Channels","description":"\n                    <p>One of the highlights of the Go programming language is its ability to handle concurrency with minimal effort using what are called goroutines and channels. The beauty here versus other programming languages is that you don’t end up in a callback mess or locking hell. In fact, you can even create far more goroutines in Go than you can in a language such as Java with the same hardware.</p>\n<p>We’re going to see an example where we have an application that starts several worker goroutines and shares a channel for accessing data.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/05/concurrent-golang-applications-goroutines-channels/'>Concurrent Golang Applications With Goroutines And Channels</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2017/05/concurrent-golang-applications-goroutines-channels/","owner":"Nic Raboy"},{"title":"Copying GitHub Markdown Style","description":"For many, the clean look of Github pages, issues and comments defines how markdown should be rendered. Here’s a few ways of getting the same look in your projects.\nsindresorhus/github-markdown-css Sindre Sorhus made a site that covers everything about GitHub-flavored markdown. The CSS to replicate the GitHub style can be found at the matching GitHub repository.\nshurcool/github-flavored-markdown Dmitri Shuralyov wrote shurcool/github-flavored-markdown as a extension to the Black Friday markdown processor. It takes markdown and turns it into HTML that should be identical to what GitHub produces.","link":"https://www.client9.com/copying-github-markdown-style/","owner":"Nick Galbreath"},{"title":"Git Undo Last Commit","description":"If you did not git push, then you have a easy choice on how much you want to undo. If you did push, it&#39;s more work but can be done.\nKeep changes, just modify the commit message Undo commit, but keep changes Undo the commit, undo the changes Undo a push, and the commit How do I just change the last commit message? If you didn&#39;t push, and just need to change the last commit message, use the --amend flag.","link":"https://www.client9.com/git-undo-last-commit/","owner":"Nick Galbreath"}]