[{"title":"Building Amazon Alexa Skills With Node.js, Revisited","description":"\n                    <p>A little more than two years ago, when the Amazon Echo first started picking up steam and when I was first exposed to virtual assistants, I had written a tutorial around creating a Skill for Amazon Alexa using Node.js and simple JavaScript. In this tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2016/08/create-amazon-alexa-skill-nodejs-aws-lambda/\">Create an Amazon Alexa Skill Using Node.js and AWS Lambda</a>, we saw how to create intent functions and sample utterances in preparation for deployment on AWS Lambda. I later wrote a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2016/08/test-amazon-alexa-skills-offline-with-mocha-and-chai-for-node-js/\">Test Amazon Alexa Skills Offline with Mocha and Chai for Node.js</a>, which focused on building unit tests for these Skills and their intent functions. Fast forward to now and a few things have changed in the realm of Skill development.</p>\n<p>In this tutorial we&rsquo;re going to see ho","link":"https://www.thepolyglotdeveloper.com/2018/11/building-amazon-alexa-skills-nodejs-revisited/","owner":"Nic Raboy"},{"title":"Goroutine Leaks - The Forgotten Sender","description":"Introduction Concurrent programming allows developers to solve problems using more than one path of execution and is often used in an attempt to improve performance. Concurrency doesn’t mean these multiple paths are executing in parallel; it means these paths are executing out-of-order instead of sequentially. Historically, this type of programming is facilitated using libraries that are either provided by a standard library or from 3rd party developers.\nIn Go, concurrency features like Goroutines and channels are built into the language and runtime to reduce or eliminate the need for libraries.","link":"https://www.ardanlabs.com/blog/2018/11/goroutine-leaks-the-forgotten-sender.html","owner":"William Kennedy"},{"title":"Join us for the Global Day of Coderetreat on November 17th","description":"InVision is hosting a remote-friendly event for the Global Day of Coderetreat. GDCR is an opportunity to practice software development and design in a friendly and low-pressure environment. Come join us on Saturday November 17th starting at 10AM EST (UTC -5) and plan for a fun and enlightening day. There is no cost to participate in this event.\nWhat will we be doing for eight hours? After a quick introduction to the tooling for the day and some administrative words, participants will pair off into teams and begin a 45 minute coding session.","link":"https://engineering.invisionapp.com/post/global-day-of-coderetreat-2018/","owner":"InVision"},{"title":"The rise of multivector attacks","description":"","link":"https://idea.popcount.org/2018-11-12-the-rise-of-multivector-attacks","owner":"Marek Majkowski"}]