[{"title":"DevOops!","description":" It all started on a Thursday evening. After months of hard work, we were having the first release for the brand-new version of one of our finance-related products, developed with open source, event-driven microservices, microfrontends, cloud, HCD, agile and DevOps as key principles.","link":"/2018/04/23/devoops/","owner":"Monsanto"},{"title":"How To Come Up With An App Idea And Execute In Development","description":"\n                    <p>I&rsquo;ve been developing applications both as a hobby and professionally for quite some time now. I&rsquo;ve released top ranking mobile applications to the various app stores and even sold the rights to applications.</p>\n<p>One question I get asked quite a bit is in regards to how I come up with those ideas and execute on them for a successful release. Being a solid developer is one thing, but having a solid plan is another.</p>\n<p>I&rsquo;m going to share my process so you can be more successful with your web and mobile application releases.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/04/come-up-app-idea-execute-development/'>How To Come Up With An App Idea And Execute In Development</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2018/04/come-up-app-idea-execute-development/","owner":"Nic Raboy"},{"title":"JSConf Iceland 2018","description":"If there was one word to describe the theme of JSConfIS it would be experience. Beyond ... ","link":"https://tech.small-improvements.com/jsconf-iceland-2018/","owner":"Small Improvements"},{"title":"QueryFilter: A Model Filtering Concept","description":"Having a clean code with single responsibility is important, and doing that for model filtering can be easy and very powerful. Believe me. This blog post is related to a talk I gave on April, 2018 on Darkmira Tour PHP 2018, in Brasília/DF, Brazil, with the same title. The slides are on SpeakerDeck. Filtering models … ","link":"https://blog.jgrossi.com/2018/queryfilter-a-model-filtering-concept/?utm_source=rss&utm_medium=rss&utm_campaign=queryfilter-a-model-filtering-concept","owner":"Junior Grossi"},{"title":"Speaking at flatMap Oslo again this year","description":"Putting the finishing touches on my “Scala for Java developers” workshop for the FlatMap Oslo conference. It will be my second year speaking there. Last year the conference was fantastic. Good speakers, well organised but I was still a little bit nervous when heading off for the conference. I’ve been speaking at developer conferences for […]","link":"http://engineering.speedledger.com/speaking-at-flatmap-oslo-again-this-year/","owner":"Speedledger"},{"title":"Strange and maddening rules","description":"There's this popular idea among developers that when you face a problem with code, you should get out a rubber duck and explain, to the duck, exactly how your code was supposed to work. ","link":"https://www.joelonsoftware.com/2018/04/23/strange-and-maddening-rules/","owner":"Joel Spolsky"},{"title":"Workshop on Numerical Programming in Functional Languages (NPFL)","description":"I’m the chair this year for the first(!) ACM SIGPLAN International Workshop on Numerical Programming in Functional Languages (NPFL), which will be co-located with ICFP this September in St. Louis, Missouri, USA. Please consider submitting something! All you have to do is submit between half a page and a page describing your talk. There will … ","link":"https://idontgetoutmuch.wordpress.com/2018/04/23/1108/","owner":"Idontgetoutmuch's Weblog"}]