[{"title":"Flex Fridays: Matt Jibson Problem-Solves by Building a sqlfmt","description":"Over the next few months, we plan to share with you what some of our Roachers are working on for their Flex Friday projects. Our Fridays are given to employees as a day to self manage, where they can decide to come into the office or WFH and to focus on work priorities or a side project. We hope this helps explain the bigger picture of one of our company values: Establish Balance.","link":"https://www.cockroachlabs.com/blog/free-fridays-matt-jibson/","owner":"CockroachDB"},{"title":"Getting Started With The Android SDK For NativeScript Development On MacOS","description":"\n                    <p>When it comes to mobile development, Android has always been a pain to deal with. While iOS has a terrible deployment to production experience, Android has a terrible installation and configuration experience.</p>\n<p>I&rsquo;ve been developing Android applications since before hybrid web and cross-platform native were a thing and up until recently, the Android installation experience has been unchanged. However, now things are different with a heavy push towards <a href=\"https://developer.android.com/studio/\">Android Studio</a> and less towards the command line interface (CLI).</p>\n<p>If you&rsquo;re like me and feel that Android Studio has no business in your NativeScript workflow, you&rsquo;re probably still interested in the Android CLI&rsquo;s less than ideal experience. We&rsquo;re going to see how to get setup on macOS with not only the Android CLI, but also the various packages and appropriate simulators for <a href=\"https://www.nativescript.org/\">NativeS","link":"https://www.thepolyglotdeveloper.com/2018/08/getting-started-android-sdk-nativescript-development-macos/","owner":"Nic Raboy"},{"title":"The default OpenSSH key encryption is worse than plaintext","description":"<p>The eslint-scope npm package got compromised recently, stealing npm credentials from your home directory. We started running tabletop exercises: what else would you smash-and-grab, and how can we mitigate that risk?</p>\n\n<p>Most people have an RSA SSH key laying around. That SSH key has all sorts of privileges: typically logging into prod and GitHub access. Unlike an npm credential, an SSH key is encrypted, so perhaps it’s safe even if it leaks? Let’s find out!</p>\n\n<pre><code>user@work /tmp $ ssh-keygen\nGenerating public/private rsa key pair.\nEnter file in which to save the key (/home/user/.ssh/id_rsa): mykey\n...\nuser@work /tmp $ head -n 5 mykey  \n-----BEGIN RSA PRIVATE KEY-----\nProc-Type: 4,ENCRYPTED\nDEK-Info: AES-128-CBC,CB973D5520E952B8D5A6B86716C6223F\n\n+5ZVNE65kl8kwZ808e4+Y7Pr8IFstgoArpZJ/bkOs7rB9eAfYrx2CLBqLATk1RT/\n</code></pre>\n\n<p>You can tell it’s encrypted because it says so right there. It also doesn’t start with <code>MII</code> &ndash; the base64 DER clue that an RSA ke","link":"https://latacora.micro.blog/the-default-openssh/","owner":"Latacora"}]