[{"title":"Managing DevOps with Cloud Application Manager and ALM","description":null,"link":"https://www.ctl.io/developers/blog/post/managing-devops-with-cloud-application-manager-and-alm","owner":"CenturyLink"},{"title":"Myntra storefront over the years","description":"","link":"https://medium.com/myntra-engineering/myntra-storefront-over-the-years-4d675035d2fc?source=rss----7484818e9f88---4","owner":"Myntra"},{"title":"Rocksdb Tuning Advisor","description":"<p>The performance of Rocksdb is contingent on its tuning. However, because\nof the complexity of its underlying technology and a large number of\nconfigurable parameters, a good configuration is sometimes hard to obtain. The aim of\nthe python command-line tool, Rocksdb Advisor, is to automate the process of\nsuggesting improvements in the configuration based on advice from Rocksdb\nexperts.</p>\n\n<h3 id=\"overview\">Overview</h3>\n\n<p>Experts share their wisdom as rules comprising of conditions and suggestions in the INI format (refer\n<a href=\"https://github.com/facebook/rocksdb/blob/master/tools/advisor/advisor/rules.ini\">rules.ini</a>).\nUsers provide the Rocksdb configuration that they want to improve upon (as the\nfamiliar Rocksdb OPTIONS file —\n<a href=\"https://github.com/facebook/rocksdb/blob/master/examples/rocksdb_option_file_example.ini\">example</a>)\nand the path of the file which contains Rocksdb logs and statistics.\nThe <a href=\"https://github.com/facebook/rocksdb/blob/master/tools/a","link":"http://rocksdb.org/blog/2018/08/01/rocksdb-tuning-advisor.html","owner":"RocksDB"},{"title":"Simple Data Processing With JavaScript And The HERE API","description":"\n                    <p>Have you ever needed to work with comma separated value (CSV) data that wasn&rsquo;t formatted in a great way or figure out complete address information based on very little provided address information? While unrelated, these two topics come up quite a bit, more frequently when I&rsquo;m dealing with person information or lead data that I retrieve from conferences and other events.</p>\n<p>The great thing is that we live in a time where plenty of development libraries and services exist to make this process of data parsing and manipulation easy to accomplish in an automated fashion.</p>\n<p>We&rsquo;re going to see how to take a CSV file representing partially complete people data and convert it to JSON. Then we&rsquo;re going to fill in the gaps when it comes to the geolocation side of things, using the <a href=\"https://developer.here.com/documentation/geocoder/dev_guide/topics/what-is.html\">HERE Geocoder API</a>.</p>\n                    \n                       ","link":"https://www.thepolyglotdeveloper.com/2018/08/simple-data-processing-javascript-here-api/","owner":"Nic Raboy"}]