[{"title":"Fsyncgate: errors on fsync are unrecovarable","description":"<p><small><em>This is an archive of the original &quot;fsyncgate&quot; email thread. This is posted here because I wanted to have a link that would fit on a slide for <a href=\"//danluu.com/deconstruct-files/\">a talk on file safety</a> with <a href=\"//danluu.com/web-bloat/\">a mobile-friendly non-bloated format</a>.</em></small></p>\n\n<pre><code>From:Craig Ringer &lt;craig(at)2ndquadrant(dot)com&gt;\nSubject:Re: PostgreSQL's handling of fsync() errors is unsafe and risks data loss at least on XFS\nDate:2018-03-28 02:23:46\n</code></pre>\n\n<p>Hi all</p>\n\n<p>Some time ago I ran into an issue where a user encountered data corruption\nafter a storage error. PostgreSQL played a part in that corruption by\nallowing checkpoint what should've been a fatal error.</p>\n\n<p>TL;DR: Pg should PANIC on fsync() EIO return. Retrying fsync() is not OK at\nleast on Linux. When fsync() returns success it means &quot;all writes since the\nlast fsync have hit disk&quot; but we assume it means &quot;all writes since th","link":"https://danluu.com/fsyncgate/","owner":"Dan Luu"},{"title":"React Native Animations: Part 1","description":"At Raizlabs we need our apps to look great and be easy to use. One of the ways we add surprise and delight to an app is by using animation. Lately, we’ve been building cross-platform React Native apps: this gives us new challenges and opportunities. While you can do some pretty complex stuff with React […]","link":"/dev/2018/03/react-native-animations-part1/","owner":"Raizlabs"},{"title":"XboxTools: GameControllerDetector + improved XboxKeyControl","description":"I recently released GameControllerDetector (here), a tool allowing developers to detect automatically if a user uses a Xbox gamepad or a media remote on Xbox. I also released XboxKeyControl (v1 here and v2) some months ago, a control allowing developers to display the different keys available on a xbox gamepad or a media remote. Now that we have a way to detect the input device used by a user, we can improve XboxKeyControl to automatically change the glyph displayed when...","link":"https://www.rudyhuyn.com/blog/2018/03/28/xboxtools-gamecontrollerdetector-improved-xboxkeycontrol/","owner":"Rudy Huyn"}]