[{"title":"An Introduction to Join Ordering","description":"The development of the relational model heralded a big step forward for the world of databases. A few years later, SQL introduced a rich vocabulary for data manipulation: filters, projections, and&#x2014;most importantly&#x2014;the mighty join. Joins meant that analysts could construct new reports without having to interact with those eggheads in engineering, but more importantly, the existence of complex join queries meant that theoreticians had an interesting new NP-hard problem to fawn over for the next five decades.","link":"https://www.cockroachlabs.com/blog/join-ordering-pt1/","owner":"CockroachDB"},{"title":"Causal guarantees are anything but casual","description":"Traditional databases, because they service reads and writes from a single \r\nnode, naturally provide sequential ordering guarantees for read and write \r\noperations known as \"causal consistency\". A distributed system can provide \r\nthese guarantees, but in order to do so, it must coordinate and order \r\nrelated events across all of its nodes, and limit how fast certain \r\noperations can complete. While causal consistency is easiest to understand \r\nwhen all data ordering guarantees are preserved – mimicking a vertically \r\nscaled database, even when the system encounters failures like node crashes \r\nor network partitions – there exist many legitimate consistency and \r\ndurability tradeoffs that all systems need to make.\r\n\r\nMongoDB has been continuously running — and passing — Jepsen tests for \r\nyears. Recently, we have been working with the Jepsen team to test for \r\ncausal consistency. With their help, we learned how complex the failure \r\nmodes become if you trade consistency guarantees for d","link":"https://engineering.mongodb.com/post/ryp0ohr2w9pvv0fks88kq6qkz9k9p3","owner":"MongoDB"},{"title":"GIPHY @ ‘Microservices  & Microwave Dinners’","description":"October 24, 2018 Splash HQ – New York, NY We’re excited to be part of the Splash ‘Microservices & Microwave Dinners’ meetup, where we’ll have an open discussion on microservices – the nuances, hype, benefits, and more. GIPHY’s Director of Engineering API, Laurence Girard, will be moderating a discussion on “Continuous Health and Monitoring in […]","link":"https://engineering.giphy.com/giphy-microservices-microwave-dinners/","owner":"GIPHY"}]