[{"title":"Improving Redshift performance with Intermix","description":"<p>Here at Remind, Amazon Redshift is a centerpiece of our data infrastructure.  Event data is continuously ingested into Redshift. ETL processes are run within Redshift. Team members across the company, in a variety of roles, query Redshift. True, <a href=\"http://engineering.remind.com/data-infrastructure/\">recent efforts</a> have shifted some of our data processing onto other tools like Amazon Athena and EMR/Spark, but Redshift remains critical to data at Remind, and the performance of our Redshift cluster is therefore one of the primary concerns of the DataEng team.</p>\n\n<p>Late last year we came across <a href=\"https://www.intermix.io\">Intermix</a>, a company that specializes in helping folks like us optimize their Redshift performance. We decided to do a two-week trial with them in January 2018.</p>\n\n<p>Some months before, we had scaled our Redshift cluster from 12 to 16 nodes (ds.xlarge) as a quick-and-dirty way of improving performance, as well as to give us more headroom on dis","link":"http://engineering.remind.com/redshift-performance-intermix/","owner":"Remind"},{"title":"Use Sendy To Build And Maintain An Email List For Cheap","description":"\n                    <p>When you&rsquo;re building a business, the experts all say that you should make your list building strategy a priority. Using social networks like Twitter and Facebook for your marketing is great, but those might not be around forever. Email has been around for a long time and it will likely exist a long time into the future as well.</p>\n<p>I&rsquo;ve briefly mentioned this before, but I&rsquo;m currently using <a href=\"https://sendy.co/?ref=GMC4m\">Sendy</a> to manage my email subscribers and send out my monthly newsletter. However, I wasn&rsquo;t always using Sendy to accomplish this task. For around a year, I was using Mailchimp, a similar product.</p>\n<p>We&rsquo;re going to see what Sendy is, how to use it, and why I&rsquo;m using it over the various alternatives that exist.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/02/use-sendy-build-maintain-email-list-cheap/'>Use Sendy To","link":"https://www.thepolyglotdeveloper.com/2018/02/use-sendy-build-maintain-email-list-cheap/","owner":"Nic Raboy"}]