[{"title":"BenchmarkDotNet v0.10.12","description":"<p>BenchmarkDotNet v0.10.12 has been released! This release includes:</p>\n<ul>\n<li><strong>Improved DisassemblyDiagnoser:</strong>\nBenchmarkDotNet contains an embedded disassembler so that it can print assembly code for all benchmarks;\nit&rsquo;s not easy, but the disassembler evolves in every release.</li>\n<li><strong>Improved MemoryDiagnoser:</strong>\nit has a better precision level, and it takes less time to evaluate memory allocations in a benchmark.</li>\n<li><strong>New TailCallDiagnoser:</strong>\nnow you get notifications when JIT applies the tail call optimizations to your methods.</li>\n<li><strong>Better environment info:</strong>\nwhen your share performance results, it&rsquo;s very important to share information about your environment.\nThe library generates the environment summary for you by default.\nNow it contains information about the amount of physical CPU, physical cores, and logic cores.\nIf you run a benchmark on a virtual machine, you will get the name of the hypervisor","link":"https://aakinshin.net/posts/bdn-v0_10_12/","owner":"Andrey Akinshin"},{"title":"Building a compact, quiet, low powered ESXi/Storage Whitebox Hybrid","description":null,"link":"https://blog.monstermuffin.org/building-compact-quiet-low-powered-esxi-storage-whitebox-hybrid/?utm_source=rss&utm_medium=rss&utm_campaign=building-compact-quiet-low-powered-esxi-storage-whitebox-hybrid","owner":"Monstermuffin"},{"title":"Building a compact, quiet, low powered ESXi/Storage Whitebox Hybrid","description":null,"link":"https://blog.muffn.io/building-compact-quiet-low-powered-esxi-storage-whitebox-hybrid/?utm_source=rss&utm_medium=rss&utm_campaign=building-compact-quiet-low-powered-esxi-storage-whitebox-hybrid","owner":"Monstermuffin"},{"title":"License Compliance Management in Practice","description":"VersionEye was set up to aggregate details on the different artifacts you consume in your development projects. The data VersionEye produces can feed important information to your continuous development pipeline or support your quality gates and thereby increase the quality of your software product in terms of security and compliance to the associated licenses or … ","link":"https://blog.versioneye.com/2018/01/14/license-compliance-management-in-practice/","owner":"VersionEye"},{"title":"Mine Bitcoin And Other Cryptocurrency Coins With A CPU Miner And Docker","description":"\n                    <p>So you&rsquo;ve been doing a lot of research around the blockchain and the various cryptocurrencies. Don&rsquo;t worry, I&rsquo;ve been doing a lot of the same research. There is so much in the news and on social media around this subject, it would be a good idea to educate yourself.</p>\n<p>When it comes to cryptocurrencies, there are a lot of people trying to mine it rather than buy it. Depending on the type of currency, it could be near impossible to mine or very easy. Take Bitcoin for example. Bitcoin is one of the most difficult coins to mine, while others such as DigiByte are much easier. That&rsquo;s not to say the easier coins won&rsquo;t become more difficult in the future.</p>\n<p>So how do you get started with mining?</p>\n<p>I use a Mac. If you&rsquo;re a Mac owner and you try to find a mining tool online, you&rsquo;re going to struggle because most are for Windows or Linux. We&rsquo;re going to see how to leverage <a href=\"https://www.docker.com\">Docke","link":"https://www.thepolyglotdeveloper.com/2018/01/mine-bitcoin-other-cryptocurrency-coins-cpu-miner-docker/","owner":"Nic Raboy"},{"title":"SYN packet handling","description":"","link":"https://idea.popcount.org/2018-01-15-syn-packet-handling","owner":"Marek Majkowski"}]