[{"title":"Building a shrimp tank","description":"<p>This past summer I managed to fit in a TON of fun experiments. One of them was a butterfly kit. I accidentally kept the hatched butterflies for a little bit too long and one day I suddenly had a cage full of <strong>hundreds</strong> of butterfly eggs. I couldn't possibly take</p>","link":"https://jack.ofspades.com/building-a-shrimp-tank/","owner":"Jacopo Tarantino"},{"title":"Migrate the Empire to C5","description":"<p><strong>Migrate the Empire to C5</strong> — or why it took me a month to move from C4 to C5 AWS instances.</p>\n\n<p>At around Dec 15th, 2017 my team reviewed our Instance Reservations and chose to switch our fleet’s scaling unit from <code class=\"language-plaintext highlighter-rouge\">c4.2xlarge</code> to <code class=\"language-plaintext highlighter-rouge\">c5.2xlarge</code>. The C5 instance type family is Amazon’s first cloud offering running on the KVM Hypervisor.</p>\n\n<p>Additionally, C5 runs a newer generation of CPU, offers up an extra 1G of memory, and provides significantly faster intra VPC networking (through the use of ENA) all for less cost then the C4 family. Essentially we get the the best-bang-for-our-buck by choosing C5 over C4.</p>\n\n<p>As a result I took on the task of switching our stage environment to <code class=\"language-plaintext highlighter-rouge\">c5.2xlarge</code> instances.</p>\n\n<h1 id=\"ami-complications\">AMI Complications</h1>\n\n<p>As a first test I naively adjust","link":"http://engineering.remind.com/migrate-the-empire-to-c5/","owner":"Remind"},{"title":"Use Chart.js To Display Attractive Charts In A Vue.js Web Application","description":"\n                    <p>Charts are a great way to illustrate data within an application. No one likes trying to make sense of raw data or looking at it via a table. Instead a nice bar chart or line graph can paint a perfect picture of what&rsquo;s going on.</p>\n<p>There are a lot of charting libraries available, but my personal favorite is <a href=\"http://www.chartjs.org/\">Chart.js</a>. It is a vanilla JavaScript library, so including it within a framework can be a little intimidating.</p>\n<p>We&rsquo;re going to see how to work with Chart.js within a project that uses the <a href=\"https://vuejs.org/\">Vue.js</a> JavaScript framework.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/01/use-chartjs-display-attractive-charts-vuejs-web-application/'>Use Chart.js To Display Attractive Charts In A Vue.js Web Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot","link":"https://www.thepolyglotdeveloper.com/2018/01/use-chartjs-display-attractive-charts-vuejs-web-application/","owner":"Nic Raboy"}]