[{"title":"Create A Cross-Platform Desktop DigiByte DGB Wallet With Angular And Electron","description":"\n                    <p>A few weeks back I had written an article titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/01/send-manage-digibyte-dgb-coins-nodejs/\">Send And Manage DigiByte DGB Coins With Node.js</a>, which had explained how to interact with <a href=\"https://www.digibyte.co/\">DigiByte</a> coins via Node.js and the CLI. We saw how to keep track of a wallet, compare against the market value, and send DGB to other wallets. The catch here was that it was all CLI based and not particularly user friendly.</p>\n<p>A popular solution towards adding a GUI to a Node.js application comes in the flavor of <a href=\"https://electronjs.org/\">Electron</a>. With Electron you&rsquo;re essentially packaging a web application that can interact with native platform APIs.</p>\n<p>Since I&rsquo;m a fan of Angular, we&rsquo;re going to see how to create a fancy DigiByte wallet using Electron, Node.js, and Angular.</p>\n                    \n                        <p>The post <a rel='nofollow'","link":"https://www.thepolyglotdeveloper.com/2018/01/create-cross-platform-desktop-digibyte-dgb-wallet-angular-electron/","owner":"Nic Raboy"},{"title":"Introducing a new look for GIPHY Engineering","description":"Technology is changing the way we communicate and the way we communicate is driving innovation in technology. GIPHY Engineering is revolutionizing both – when words don’t cut it, say it with GIPHY. Follow us on Twitter @GIPHYENG for all the exciting GIPHY Engineering updates!","link":"https://engineering.giphy.com/fresh-new-look-for-giphyeng/","owner":"GIPHY"},{"title":"The Vogue Augmented Reality Experience: How We Did It","description":"On a tight deadline, we built a fully functioning AR experience inside an iMessage app to coincide with the iPhone X launch. Here's how.","link":"https://technology.condenast.com/story/the-vogue-augmented-reality-experience","owner":"Condé Nast"},{"title":"Twirp: a sweet new RPC framework for Go","description":"","link":"https://medium.com/twitch-news/twirp-a-sweet-new-rpc-framework-for-go-5f2febbf35f?source=rss----3ae745429979--engineering","owner":"Twitch"}]