[{"title":"Containerization with Docker by Example Released","description":"\n                    <p>I am pleased to announce that <a href=\"https://www.udemy.com/containerization-with-docker-by-example/?couponCode=POLYGLOT\">Containerization with Docker by Example</a>, a course I&rsquo;ve been working on for a while, has been published to the popular Udemy education network.</p>\n<p>This course, is the fifth course that I&rsquo;ve released and the first that hasn&rsquo;t been on the topic of mobile application development.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/01/containerization-docker-example-released/'>Containerization with Docker by Example Released</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2018/01/containerization-docker-example-released/","owner":"Nic Raboy"},{"title":"From express and pug to HTML","description":"\n<div class=\"paragraph\">\n<p>While working on private stuff I&#8217;ve encountered a moment when I was in need to create a web-based\nuser interface for the application I&#8217;ve been developing lately. In this post, I&#8217;m going to briefly\ndescribe why I&#8217;ve decided to use Node.js for generating HTML on the server side and how I&#8217;ve taken\nadvantage of the javascript on the server side and in the browser.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201801/express-pug/\">Read more</a></p>","link":"https://blog.pchudzik.com/201801/express-pug/","owner":"Paweł Chudzik"},{"title":"Talking to Mr. Money Mustache about the US Digital Service","description":"Last week, I passed my one year anniversary as head of the US Digital Service (USDS). So when Mr. Money Mustache asked for an interview, I was delighted to talk about some of the work that the USDS does. If you aren’t familiar with Mr. Money Mustache, he writes about a philosophy of badassity in […]","link":"https://www.mattcutts.com/blog/interview-mr-money-mustache-us-digital-service/","owner":"Matt Cutts"},{"title":"White Elephant Holiday Festivities","description":"Here at InVision, we enjoy a fully distributed work environment. We get to work with people from all across the globe every single day! Our unique environment comes with many perks and great experiences, and we wanted to add to that by doing something special together for the holidays.\nWe had to find something that would actually work and be fun for a fully remote team. Think new tradition and memorable as well.","link":"https://engineering.invisionapp.com/post/remote-gift-exchange/","owner":"InVision"}]