[{"title":"Assessing software engineering candidates","description":"Note: This blog entry reproduces RFD 151. Comments are encouraged in the discussion for RFD 151. How does one assess candidates for software engineering positions? This is an age-old question without a formulaic answer: software engineering is itself too varied to admit a single archetype. Most obviously, software engineering is intellectually challenging; it demands minds [...]","link":"http://dtrace.org/blogs/bmc/2018/10/05/assessing-software-engineering-candidates/","owner":"Bryan Cantrill"},{"title":"Open-Sourcing Panoptes, Oath’s distributed network telemetry collector","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/178699833943/open-sourcing-panoptes-oaths-distributed-network\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p>By Ian Flint, Network Automation Architect and Varun Varma, Senior Principal Engineer<b><br/></b></p>\n<p>The Oath network automation team is proud to announce that we are open-sourcing <a href=\"https://github.com/yahoo/panoptes\">Panoptes</a>, a distributed system for collecting, enriching and distributing network telemetry.  </p>\n<p>We developed Panoptes to address several issues inherent in legacy polling systems, including overpolling due to multiple point solutions for metrics, a lack of data normalization, consistent data enrichment and integration with infrastructure discovery systems.  </p>\n<p>Panoptes is a pluggable, distributed, high-performance data collection system which supports multiple polling formats, including SNMP and vendor-specific APIs. It is also extensible to support emerging streaming teleme","link":"https://yahooeng.tumblr.com/post/178738044351","owner":"Yahoo"},{"title":"Outlier Detection in SQL","description":"Inevitably, the unexpected happens. A historically low-traffic channel brings in 10x the normal amount of users. Or your user login rate drops by half.","link":"https://www.periscopedata.com/blog/outlier-detection-in-sql","owner":"Periscope Data"},{"title":"We’re not good enough – and that’s okay (Norwegian)","description":"This Norwegian language blog post summarizes my talk at Oslo Agile Meetup in the beginning of October. Jeg tror ingen egentlig vet hvordan de skal få til bra utviklingsprosjektet. Selv når vi lykkes så er det veldig mye flaks. De … ","link":"http://johannesbrodwall.com/2018/10/04/were-not-good-enough-and-thats-okay-norwegian/","owner":"Johannes Brodwall"}]