[{"title":"A Vue.js App Using Axios With Vuex","description":"\n                    <p>In this tutorial we will build a simple Vue.js application which will demonstrate the power of using <a href=\"https://vuex.vuejs.org/\">Vuex</a> as a central data store, where the data will be asynchronously retrieved using <a href=\"https://github.com/axios/axios\">Axios</a> for the API requests.</p>\n<p>A basic level of HTML, CSS and JavaScript will be beneficial but is not required.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/04/vuejs-app-using-axios-vuex/'>A Vue.js App Using Axios With Vuex</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2018/04/vuejs-app-using-axios-vuex/","owner":"Nic Raboy"},{"title":"Interceptor : Your Own Mock Server inside the browser","description":"During development, often times front-end devs have to wait for the back-end devs to offer an API to work on. Even after the API is given, if the front-end team wants a different set of data to work on, they again need to wait for the changes to be made and hosted. We, front-end developers resort to techniques like storing the data in a variable or using mock API&rsquo;s.\nTo overcome this, we are working on a browser extension Interceptor, which lets you define your own response, and everytime the browser requests data from a particular URL, returns you with mock data instead of, from the server.","link":"https://crypt.codemancers.com/posts/2018-04-24-intro-to-interceptor/","owner":"Codemancers"},{"title":"Service Workers can save the environment!","description":"Service workers allow you to cache resources on the user's device when they visit your site for the first time.  Fewer HTTP requests mean less CPU usage and less energy consumed.","link":"https://34.220.116.254:80/service-workers-can-save-the-environment/","owner":"Dean Hume"}]