[{"title":"A New Chapter for Omid","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/180863698576/a-new-chapter-for-omid\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p><i>By Ohad Shacham, Yonatan Gottesman, Edward Bortnikov<br/>Scalable Systems Research, Verizon/Oath</i></p>\n<p><a href=\"https://omid.incubator.apache.org/\">Omid</a>, an open source transaction processing platform for Big Data, was born as a research project at Yahoo (now part of Verizon), and became an Apache Incubator project in 2015. Omid complements Apache HBase, a distributed key-value store in Apache Hadoop suite, with a capability to clip multiple operations into logically indivisible (atomic) units named transactions. This programming model has been extremely popular since the dawn of SQL databases, and has more recently become indispensable in the NoSQL world. For example, it is the centerpiece for dynamic content indexing of search and media products at Verizon, powering a web-scale content management platform since 2015. </p>\n<p>","link":"https://yahooeng.tumblr.com/post/180867271141","owner":"Yahoo"},{"title":"Can Friendly Competition Lead to Better Models?","description":"Here on Squarespace’s Strategy and Analytics team, we build models that \r\npredict customer lifetime value, forecast customer service demand, and even \r\ndetermine how much we should spend on those ubiquitous Squarespace ads you \r\nhear on your favorite podcast.","link":"https://engineering.squarespace.com/blog/2018/can-friendly-competition-lead-to-better-models","owner":"Squarespace"},{"title":"Improving Kubernetes Security","description":"In summer 2018, the Gardener project team asked Kinvolk to execute several penetration tests in its role as a third-party contractor. We applied our Kubernetes expertise to identify vulnerabilities on Gardener installations and to make recommendations.\nSome of our findings are now presented in this article on the Gardener website .\nWe presented some of our findings in a joint presentation with SAP entitled Hardening Multi-Cloud Kubernetes Clusters as a Service at KubeCon 2018 in Shanghai .","link":"/blog/2018/12/improving-kubernetes-security/","owner":"Kinvolk"}]