[{"title":"Automatic Stubbing of Network Requests to Deflakify Automation Testing","description":"Apple introduced automated UI testing in Xcode 7. This was a great addition for developers because this native support promised, among other things, an improvement in the flakiness notoriously associated with automation tests. As many of us developers have experienced, tests can sometimes fail even when there has been no modification to the test or underlying feature code.","link":"https://developers.soundcloud.com/blog/automatic-stubbing-of-network-requests-to-de-flakify-automation-testing","owner":"Soundcloud"},{"title":"AWS SDK for Java, version 2.0","description":"\n","link":"http://tech.gilt.com/cloud/2018/01/26/aws-sdk-for-java","owner":"Gilt"},{"title":"IP Spoofing at Packet Hacking Village","description":"","link":"https://idea.popcount.org/2018-01-26-ip-spoofing-at-packet-hacking-village","owner":"Marek Majkowski"},{"title":"Use Vue.js To Generate Cold Storage Paper Wallets For DigiByte DGB Coins","description":"\n                    <p>To continue on my technical journey of cryptocurrency coin management, I figured it would be a good idea to share how to create a paper wallet for DigiByte DGB coins. A few weeks back I had written a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/01/generate-cold-storage-paper-wallets-ripple-xrp-coins-angular/\">Generate Cold Storage Paper Wallets for Ripple XRP Coins with Angular</a>, but we all know Ripple isn&rsquo;t the only technology on the block.</p>\n<p>In case you&rsquo;re unfamiliar with paper wallets, they are nothing more than printouts that contain your private and public key information. It is separated from the internet and the paper wallets can be placed in a cold storage location like a locked safe or a bank.</p>\n<p>We&rsquo;re going to see how to use JavaScript and the <a href=\"https://vuejs.org/\">Vue.js</a> framework to generate <a href=\"https://digibyte.io/\">DigiByte</a> DGB wallet information that includes QR codes for eas","link":"https://www.thepolyglotdeveloper.com/2018/01/vuejs-generate-cold-storage-paper-wallets-digibyte-dgb-coins/","owner":"Nic Raboy"}]