[{"title":"Database Migration Guide: How to Migrate from Oracle to CockroachDB","description":"Why do Companies Migrate from Oracle to CockroachDB? There is not one specific answer to this question, but rather a list of consistent trends that we have seen over the years.  Companies migrate from Oracle to CockroachDB because of the high Total Cost of Ownership at Oracle - in which we include the operational overhead required to run an Oracle database.  Companies migrate because they want to move to the cloud and, in particular, want to build on a distributed database that is compatible with Kubernetes.","link":"https://www.cockroachlabs.com/blog/database-migration-guide-oracle-to-cockroachdb/","owner":"CockroachDB"},{"title":"E-Commerce Image Attribute Extraction using Machine Learning","description":null,"link":"https://www.semantics3.com/blog/e-commerce-image-attribute-extraction-using-machine-learning/","owner":"Semantics3"},{"title":"How boba trips and event onsites made me a better engineer (a Briteling intern’s reflection on community at Eventbrite)","description":null,"link":"https://www.eventbrite.com/engineering/how-boba-trips-and-event-onsites-made-me-a-better-engineer-a-briteling-interns-reflection-on-community-at-eventbrite/","owner":"Eventbrite"},{"title":"How to create Web Components by a project.","description":"","link":"https://jobandtalent.engineering/how-to-create-web-components-by-a-project-7577e5cf2262?source=rss----66415b986b2d---4","owner":"Jobandtalent"},{"title":"USING DATA TO DRIVE SUCCESS","description":"Learn how Zulily and Sounders FC get the most out of their metrics! On Tuesday, September 10th, Zulily was proud to partner with Seattle Sounders FC for a tech talk on data science, machine learning and AI. This exclusive talk … ","link":"https://zulily-tech.com/2019/09/25/using-data-to-drive-success/","owner":"Zulily"},{"title":"What is the technology behind Nextdoor in 2019?","description":"","link":"https://engblog.nextdoor.com/what-is-the-technology-behind-nextdoor-in-2019-ccc3d2173eda?source=rss----5e54f11cdfdf---4","owner":"Nextdoor"}]