[{"title":"DotNet Core: A Vector For AWL Bypass & Defense Evasion","description":"[*] Introduction .NET Core is an open-source, cross-platform framework for building and running applications.  The framework was introduced in 2014 as the (eventual) successor to the ever-popular .NET Framework. .NET Core runs on Windows, *Nix, and MacOS operating systems. The .NET Core management tool, DotNet (dotnet.exe), potentially offers an untapped attack surface on Windows when […]","link":"https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/","owner":"Bohops"},{"title":"Using OCaml to drive a Raspberry Pi robot car","description":"<p>Back when the Raspberry Pi was first released in 2012 Michael Bacarella wrote\na <a href=\"https://blog.janestreet.com/bootstrapping-ocamlasync-on-the-raspberry-pi/\">blog post</a>\non using OCaml and Async on this little device.\nSince then installing OCaml via opam has become a pretty smooth experience\nand everything works out of the box when using Raspbian – the default Raspberry Pi\ndistribution.</p>\n\n","link":"https://blog.janestreet.com/using-ocaml-to-drive-a-raspberry-pi-robot-car/","owner":"Jane Street"},{"title":"Web Services for the Go Developer, First Edition","description":"\n                    <p>I&rsquo;m pleased to announce that my eBook titled, <a href=\"https://gum.co/kjHSa\">Web Services for the Go Developer</a>, has been published! This is my second book and was inspired by my previous book with nearly the same name that focused on JavaScript development rather than Go development.</p>\n<p>So what is the objective of this book?</p>\n<p>It is important for developers to be familiar with web services that follow the GraphQL or REST specification, not only from the perspective of using those web services, but also in designing and developing them. The objective of this book is to teach Go developers, through example, how to do just that.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/08/web-services-golang-developer-first-edition/'>Web Services for the Go Developer, First Edition</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot D","link":"https://www.thepolyglotdeveloper.com/2019/08/web-services-golang-developer-first-edition/","owner":"Nic Raboy"}]