[{"title":"Cronjob 101 part 2","description":"","link":"https://medium.com/jobteaser-dev-team/cronjob-101-part-2-78503d3967b3?source=rss----bd77d16a0035---4","owner":"JobTeaser"},{"title":"Lambda@Edge support now available","description":"Using Lambda@Edge is a great way to speed up your application. And the Serverless Framework now has support for it.","link":"https://serverless.com/blog/lambda-at-edge-support-added/","owner":"Serverless"},{"title":"Live Reloading PHP Applications With Nodemon","description":"When building a traditional web application in PHP we don’t care about reloading it. We make some changes in the source code, save it, then make the request in the browser or some other client and we can see these changes. They have already applied automatically because of the nature of PHP, its request-response model. On every new request each time we bootstrap the whole application. But what if we are building another sort of application: a long-running script. It may be an HTTP server or some other service listening for incoming requests. Having this kind of applications each time we make a change we need to reload the application: manually stop it and then run the script again. It’s...","link":"http://sergeyzhuk.me/2019/09/16/live-reload-php-applications/","owner":"Sergey Zhuk"},{"title":"TPDP Episode #31: Developer Education through Books, Video Courses, and Conferences","description":"\n                    <p>I&rsquo;m pleased to announce that the 31st episode of The Polyglot Developer Podcast, featuring <a href=\"https://www.adrienne.io/\">Adrienne Tacke</a> and <a href=\"https://www.linkedin.com/in/alexziskind/\">Alex Ziskind</a>, has published to all of the popular podcast networks.</p>\n<p>This episode, titled <strong>Developer Education through Books, Video Courses, and Conferences</strong>, shares the personal stories of three developers when it comes to how they learn and expand their skill arsenal, as well as how they use their knowledge to produce content for other developers to consume in the format of books and courses.</p>\n<p>Adrienne, Alex, and myself share some publishing options and the amount of work that goes into each, with the end goal of honing our skills and helping out other developers.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/09/tpdp-e31-developer-education-books-v","link":"https://www.thepolyglotdeveloper.com/2019/09/tpdp-e31-developer-education-books-video-courses-conferences/","owner":"Nic Raboy"}]