[{"title":"An Open Letter To The Go Team About Try","description":"“Once a language gets complex enough, programming in it is more like carving out a subset from an infinite sea of features, most of which we’ll never learn. Once a language feels infinite, the costs of adding further features to it are no longer apparent&rdquo;. - Mark Miller\nThe new try proposal is an addition to the language that introduces a second mechanic to handle errors. It is being introduced in response to data gathered from the 2018 Go Survey and a review of proposals that were submitted during the Go 2 proposal process.","link":"https://www.ardanlabs.com/blog/2019/07/an-open-letter-to-the-go-team-about-try.html","owner":"William Kennedy"},{"title":"Cross Compiling with Docker on WSL 2","description":"<p>Now that WSL 2 packs a true Linux kernel and supports Linux containers (via Docker), it can be a perfect setup to perform application cross compilations.</p>\n\n<p>While <a href=\"https://engineering.docker.com/2019/06/docker-hearts-wsl-2/\">Docker for Windows</a> will soon support WSL 2, it is just easier to use WSL 2 as is, install Docker, and use it. In case you are new to the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/install-win10\">wonderful world</a> of WSL, check the <a href=\"https://docs.microsoft.com/en-us/windows/wsl/wsl2-install\">documentation</a> to have it installed. Note that <a href=\"https://devblogs.microsoft.com/commandline/announcing-wsl-2/\">for WSL 2</a>, you need to be using Windows Insiders for now. <strong>Update:</strong> No need to use Windows Insiders anymore as WSL 2 is now included with <a href=\"https://docs.microsoft.com/en-us/windows/release-information/status-windows-10-2004\">Windows 10 June 2020 update (version 2004)</a>.</p>\n\n<p><img src=\"https","link":"https://ariya.io/2019/06/cross-compiling-with-docker-on-wsl-2","owner":"Ariya Hidayat"},{"title":"Google open sources their robots.txt parser","description":null,"link":"https://dotdev.co/opensource-robots-txt-parser/","owner":"Dot Dev (.dev)"},{"title":"No Longer a Microsoft MVP–Hello MVP Reconnect","description":"Today marks the first time in nearly a decade that I am no longer an MVP. I will be joining the MVP alum in the MVP Reconnect program. Getting the MVP award every year has become a great side benefit … ","link":"http://feedproxy.google.com/~r/CodeBetter/~3/Uybci09SQN0/","owner":"Code Better"},{"title":"Share Internet Between macOS and a Raspberry Pi Zero Over USB","description":"\n                    <p>If you&rsquo;re a fan of the Raspberry Pi, you might have stumbled upon my tutorial for <a href=\"https://www.thepolyglotdeveloper.com/2016/06/connect-raspberry-pi-zero-usb-cable-ssh/\">interacting with a Raspberry Pi Zero</a> using nothing more than a USB cable. If you recall, the standard Raspberry Pi Zero has no WiFi, no Bluetooth, and no Ethernet.</p>\n<p>Alright, so let&rsquo;s assume that you&rsquo;re able to interact with your <a href=\"https://www.amazon.com/Raspberry-Zero-v1-3-Development-Board/dp/B01L3IU6XS/ref=as_li_ss_tl?keywords=raspberry+pi+zero&amp;qid=1561481515&amp;s=gateway&amp;sr=8-8&amp;linkCode=ll1&amp;tag=nraboy-20&amp;linkId=997fc7c1d01e1990fb655f2359e6846e&amp;language=en_US\">Raspberry Pi Zero</a>. Now what? How do you update it, download new software, or work on some awesome projects that might require internet in some fashion?</p>\n<p>Well, you could take a look at my tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2016/08/thr","link":"https://www.thepolyglotdeveloper.com/2019/07/share-internet-between-macos-raspberry-pi-zero-over-usb/","owner":"Nic Raboy"},{"title":"Transpiling between any programming languages (Part 1)","description":"The Compass team has written a lightweight, extendable transpiler that \r\ntranslates BSON to and from any language. This tool allows developers to \r\nwork in one language while being able to export the queries and \r\naggregations they build to other languages. Most compilers are one-to-one, \r\nor less commonly, one-to-many or many-to-one. There are hardly any \r\nmany-to-many transpilers. To avoid having to start from scratch, we \r\nleveraged the open source parsing tool ANTLR which provided us with a set \r\nof compiler tools along with preexisting grammars for the languages we \r\nneeded. We successfully minimized the amount of additional complexity by \r\ncoming up with a creative set of class hierarchies that reduced the amount \r\nof work needed from n² to n.","link":"https://engineering.mongodb.com/post/transpiling-between-any-programming-languages-part-1","owner":"MongoDB"},{"title":"Using a Bernzomatic TS8000 Kitchen Torch to Sear Meat","description":"For a company trying to sell and explain a product, a lot of this information was amazingly difficult to find so I wrote this. For the rest of this we'll assume you're cooking a steak but the same advice applies to most other meats/cuts. Why Do You Want A Torch to Sear Meat To get […]","link":"https://kevin.burke.dev/kevin/bernzomatic-kitchen-torch-sear-meat/","owner":"Kevin Burke"},{"title":"Why We Run Managed CockroachDB on Kubernetes","description":"There&#x2019;s this really fun game I like to play. You get a bunch of SREs in a room and you see how quickly you can rile them up. Here are some things to say next time you&#x2019;re in a room of SREs:\n&#x201C;SRE team&#x2019;s only job is to keep the service in SLO.&#x201D; &#x201C;This SLO doesn&#x2019;t mean anything anyway so I don&#x2019;t care about it.&#x201D; If you say one of these things, you&#x2019;ll have all the other SREs in the room screaming and sweating and breaking their laptops over their knees in no time.","link":"https://www.cockroachlabs.com/blog/managed-cockroachdb-on-kubernetes/","owner":"CockroachDB"}]