[{"title":"Bullet Updates - Windowing, Apache Pulsar PubSub, Configuration-based Data Ingestion, and More","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/183271418613/bullet-updates-windowing-apache-pulsar-pubsub\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p>By <a href=\"https://www.linkedin.com/in/akshai-sarma-9029b011/\">Akshay Sarma</a>, Principal Engineer, Verizon Media &amp; <a href=\"https://www.linkedin.com/in/brian-xiao-77276450/\">Brian Xiao</a>, Software Engineer, Verizon Media<br/></p>\n<p>This is the first of an ongoing series of blog posts sharing releases and announcements for <a href=\"https://bullet-db.github.io/\">Bullet</a>, an open-sourced lightweight, scalable, pluggable, multi-tenant query system.<b><br/></b></p>\n<p>Bullet allows you to query any data flowing through a streaming system without having to store it first through its UI or API. The queries are injected into the running system and have minimal overhead. Running hundreds of queries generally fit into the overhead of just reading the streaming data. Bullet requires running an instance of its backe","link":"https://yahooeng.tumblr.com/post/183315480351","owner":"Yahoo"},{"title":"format_version 4","description":"<p>The data blocks in RocksDB consist of a sequence of key/values pairs sorted by key, where the pairs are grouped into <em>restart intervals</em> specified by <code class=\"language-plaintext highlighter-rouge\">block_restart_interval</code>. Up to RocksDB version 5.14, where the latest and default value of <code class=\"language-plaintext highlighter-rouge\">BlockBasedTableOptions::format_version</code> is 2, the format of index and data blocks are the same: index blocks use the same key format of &lt;<code class=\"language-plaintext highlighter-rouge\">user_key</code>,<code class=\"language-plaintext highlighter-rouge\">seq</code>&gt; and encode pointers to data blocks, &lt;<code class=\"language-plaintext highlighter-rouge\">offset</code>,<code class=\"language-plaintext highlighter-rouge\">size</code>&gt;, to a byte string and use them as values. The only difference is that the index blocks use <code class=\"language-plaintext highlighter-rouge\">index_block_restart_interval</code> for the size","link":"http://rocksdb.org/blog/2019/03/08/format-version-4.html","owner":"RocksDB"},{"title":"GIPHY Engineering Celebrates Women’s History Month!","description":"March is Women’s History Month! For this year’s special month, GIPHY Engineering is celebrating with a whole new sticker pack dedicated to Women Pioneers in STEM. All stickers were illustrated and brought to life by the amazing Denyse Mitterhofer, and you can find them on GIPHY.com, the GIPHY mobile app and anywhere you get your […]","link":"https://engineering.giphy.com/giphy-engineering-celebrates-womens-history-month/","owner":"GIPHY"},{"title":"Hardware vulnerabilities in cloud-native environments","description":"The Spectre/Meltdown family of information disclosure vulnerabilities—including the more recent L1 Terminal Fault (aka “Foreshadow”)—are a new class of hardware-level security issues which exploit optimizations in modern CPUs that involuntarily leak information. This potentially has a subtle impact on container workloads, particularly in a virtualized environment. This post will look at the individual OS abstraction levels of a generic container stack, and discuss risks and mitigations in a variety of scenarios.","link":"/blog/2019/03/hardware-vulnerabilities-in-cloud-native-environments/","owner":"Kinvolk"},{"title":"Opening the Door to Future Women Leaders","description":"“Whether or not my daughters pursue a career in tech is immaterial, but that needs to be their own choice, not because they didn't have access or exposure to the opportunities.\"","link":"https://www.bigeng.io/opening-the-door-for-future-women-leaders/","owner":"Bigcommerce"}]