[{"title":"Bonjour, MapTiler France!","description":"\n          <img src=\"https://www.maptiler.com/media/2019-11-21-bonjour-maptiler-france-1.jpg\"\n          alt=\"Thumb\">\n          <p>We are proud to announce <a href=\"https://maptiler.fr/\">MapTiler France</a>, your hub for products and services in France! Map design inspired by the French cartography, high-resolution satellite imagery, maps in the French coordinate system and contact to a local expert in Lyon can be found there.</p>\n\n<h2 id=\"maps-for-our-frenchusers\">Maps for our French users</h2>\n<p>A set of beautiful map styles can be directly used in your mobile or web applications, including <a href=\"https://www.maptiler.com/blog/2019/06/new-pastel-and-topographique-map-styles.html\">Pastel and Topographique</a> inspired by the legacy of French cartography. The Customize tool can be used to change colors or add your own fonts for a map fitting your company brand or use-case. Country and city names from all over the world can be displayed in French, but also in 60 other languages includ","link":"https://www.maptiler.com/news/2019/11/bonjour-maptiler-france/","owner":"MapTiler"},{"title":"Checkout Surveys: A Data Science Approach","description":"Squarespace’s Data Science team helps stakeholders across the company make \r\nbetter strategic decisions using data. Marketing attribution, one major \r\nfocus of the team’s work, is how we answer the question: “How much credit \r\ndoes each form of marketing deserve for a sale or conversion?”","link":"https://engineering.squarespace.com/blog/2019/checkout-surveys-a-data-science-approach","owner":"Squarespace"},{"title":"Resolve Serverless Errors the Easy Way- with Tags","description":"Tag your Lambdas to track errors and debug serverless applications. If you’re using NodeJS or Python, we’ll help you find even the trickiest serverless application errors faster.","link":"https://serverless.com/blog/debugging-with-tags/","owner":"Serverless"},{"title":"The State of AWS Lambda Supported Languages & Runtimes (Updated November 2019)","description":"A look at the past, present, and future of AWS Lambda runtimes.","link":"https://serverless.com/blog/aws-lambda-supported-languages-and-runtimes/","owner":"Serverless"}]