[{"title":"8 Ways to Trick Out Your Bash Experience on Mac","description":null,"link":"https://elegantcode.com/2019/10/07/8-ways-trick-bash-experience-mac/","owner":"Elegant Code"},{"title":"Drawing my cat","description":"<p>On Saturday I felt like drawing and (no surprises here) I decided to create a painting of my cat.</p>\n\n<p>Without further ado, this is the result.</p>\n\n<p><img src=\"/assets/images/posts/drawing-my-cat/painting.jpg\" alt=\"Picatso painting\" /></p>\n\n<p>At the top center and right section of the photo you may notice the paws of my cat which was present during the whole process and which actually is responsible for some of the inconsistencies of the painting <strong>(blaming the cat)</strong>. Imagine a cat having a moving paint brush in front of her and not touching it (never happens).</p>\n\n<p>I would have taken photos showing the progress of the painting but everything was a mess. There was paint everywhere: on my hands, on my clothes, on the cat, on the table I put the canvas on and on the floor too. Everything I touched was turning to blue, brown or white.</p>\n\n<p>I used a painting set that was given to me as a present which had many stuff inside. At some point I mixed acrylic with wa","link":"https://iridakos.com/painting/2019/10/07/drawing-my-cat","owner":"Lazarus Lazaridis"},{"title":"Implementation of efficient algorithm for changepoint detection: ED-PELT","description":"<p><a href=\"https://en.wikipedia.org/wiki/Change_detection\">Changepoint detection</a> is an important task that has a lot of applications.\nFor example, I use it to detect changes in the <a href=\"https://www.jetbrains.com/rider/\">Rider</a> performance test suite.\nIt&rsquo;s very important to detect not only performance degradations, but any kinds of performance changes\n(e.g., the variance may increase, or a unimodal distribution may be split to several modes).\nYou can see examples of such changes on the following picture (we change the color when a changepoint is detected):</p>\n<div class=\"row\">\n<div class=\"mx-auto\">\n<a href=\"https://aakinshin.net/posts/edpelt/img/edpelt-light.png\" target=\"_blank\" class=\"imgldlink\" alt=\"edpelt\">\n<picture>\n<source\ntheme='dark'\nsrcset=\"https://aakinshin.net/posts/edpelt/img/edpelt-dark.png\"\nmedia=\"(prefers-color-scheme: dark)\">\n<source\ntheme='light'\nsrcset=\"https://aakinshin.net/posts/edpelt/img/edpelt-light.png\"\nmedia=\"(prefers-color-scheme: light), (pre","link":"https://aakinshin.net/posts/edpelt/","owner":"Andrey Akinshin"},{"title":"The Google Assistant for Android developers – PART 1","description":"Everybody knows about the Google Assistant, available on most Android and iPhone devices. As for “Hey Siri”, the well known “Ok Google” has entered common language. We probably all have already used it at least once if only to try it. However, the scope of its field of action and implementation seems to be mysterious […]","link":"https://blog.octo.com/en/the-google-assistant-for-android-developers-part-1/","owner":"OCTO Technology"},{"title":"What does it mean to be a open-source project maintainer?","description":"<p>There are many different responsibilities for the maintenance of an open source project, and while some of them get called &quot;maintainership&quot;, I&#39;m not sure they should be.</p>\n\n<p>Let&#39;s zoom out for a moment. What labor must be performed, by someone, anyone - in any successful open source project?</p>\n\n<ul>\n<li><strong>Writing code</strong> - fixing bugs, writing new features, refactoring old code.</li>\n<li><strong>Writing documentation</strong> - explaining why things are the way they are. Recording intention and design, and how to use the APIs provided.</li>\n<li><strong>Issue triage.</strong> Making bug reporters create reproducing examples. Closing issues that are stale or invalid. Providing feedback on feature requests.</li>\n<li><strong>Code review.</strong> Looking at pull requests and providing feedback.</li>\n<li><strong>Regular releases.</strong> Packaging up a release and pushing to the package namespace.</li>\n<li><strong>&quot;Green Button&quot; control.</st","link":"https://www.nateberkopec.com/blog/2019/10/07/what-does-it-mean-do-be-an-oss-maintainer.html","owner":"Nate Berkopec"}]