[{"title":"Lessons Learned: Adding Single Sign-On to Stack Overflow for Teams","description":null,"link":"https://stackoverflow.blog/2019/07/11/single-sign-on-sso-stack-overflow-okta-integration/","owner":"Stack Overflow"},{"title":"Spock extensions","description":"\n<div class=\"paragraph\">\n<p>Recently I had to set up some extra logic to be executed before running tests. I had two options -\ncreate yet another abstract class with some behavior or somehow extend Spock and introduce extra\nlogic to be executed just before actual test starts. As we already have enough of abstract classes I\ndecided to try and do the second option.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201907/spock-extensions/\">Read more</a></p>","link":"https://blog.pchudzik.com/201907/spock-extensions/","owner":"Paweł Chudzik"},{"title":"Streaming Cassandra at WePay - Part 1","description":"<p>Historically, MySQL had been the de-facto database of choice for microservices at WePay. As WePay scales, the sheer volume of data written into some of our microservice databases demanded us to make a scaling decision between sharded MySQL (i.e. <a href=\"https://vitess.io/\">Vitess</a>) and switching to a natively sharded NoSQL database. After a series of evaluations, we picked Cassandra, a NoSQL database, primarily because of its high availability, horizontal scalability, and ability to handle high write throughput.</p>\n\n<p><br /></p>\n<h2 id=\"batch-etl-options\">Batch ETL Options</h2>\n\n<p>After introducing Cassandra to our infrastructure, our next challenge was to figure out a way to expose data in Cassandra to <a href=\"https://cloud.google.com/bigquery/\">BigQuery</a>, our data warehouse, for analytics and reporting. We quickly built an Airflow <a href=\"https://github.com/apache/airflow/blob/master/airflow/contrib/hooks/cassandra_hook.py\">hook</a> and <a href=\"https://github.com/apac","link":"https://wecode.wepay.com/posts/streaming-cassandra-at-wepay-part-1","owner":"WePay"},{"title":"Vue.js Advanced Reactivity API and Caching Method-style Getters","description":"","link":"https://engineroom.teamwork.com/vue-js-advanced-reactivity-api-and-caching-method-style-getters-a80979b6660?source=rss----cea4eecd5960---4","owner":"Teamwork"}]