[{"title":"Navigating Legacy Code","description":"","link":"https://medium.com/homeaway-tech-blog/here-be-dragons-a4487980a32?source=rss----c8142f33b9ec---4","owner":"HomeAway"},{"title":"Response API Demo App","description":"Are you looking to develop your own application on top of the Bazaarvoice Response API? Well, we got something for you. The Response API Demo App is a simple Node-React application which demonstrates how to use Response API in conjunction with our 3-legged OAuth2 API. It is recommended to go through the Developer Portal and […]","link":"https://blog.developer.bazaarvoice.com/2019/04/29/response-api-demo-app/","owner":"Bazaarvoice"},{"title":"Sort A Vector Of Integers With The Quicksort Algorithm In C++","description":"\n                    <p>If you&rsquo;re studying computer science, at some point you&rsquo;re going to be exposed to the Quicksort algorithm. Even if you&rsquo;re not a computer science student, chances are this particular algorithm will come up at some point in time as part of an interview. I&rsquo;ve been asked about it plenty of times in interview processes and never once used it again.</p>\n<p>Whether or not you&rsquo;ll ever use the Quicksort algorithm, it is important to know and that is what we&rsquo;re going to review in this back to the basics tutorial.</p>\n<p>In this tutorial we&rsquo;re going to sort a vector of integer values using the Quicksort algorithm. We&rsquo;re going to use a vector because it is a commonly used data structure in C++.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/04/sort-vector-integers-quicksort-algorithm-cpp/'>Sort A Vector Of Integers With The Quicksort Algorithm In C+","link":"https://www.thepolyglotdeveloper.com/2019/04/sort-vector-integers-quicksort-algorithm-cpp/","owner":"Nic Raboy"},{"title":"Spring internals - BeanDefinition","description":"\n<div class=\"paragraph\">\n<p>How beans are registered in spring and what is the base of beans creation, how to extend spring&#8217;s\ncontext to our needs? In this post, I’m going to dig into the foundation of many mechanics in spring\nframework - bean definition.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201904/beandefinition/\">Read more</a></p>","link":"https://blog.pchudzik.com/201904/beandefinition/","owner":"Paweł Chudzik"}]