[{"title":"How to Use jOOQ’s Commercial Distributions with Spring Boot","description":"Spring Boot is great to get started very quickly with what the Spring Boot authors have evaluated to be useful defaults. This can be a lot of help when you’re doing things for the first time, and have no way to copy paste working Maven pom.xml files from existing projects, for example. When working with … ","link":"https://blog.jooq.org/2019/06/26/how-to-use-jooqs-commercial-distributions-with-spring-boot/","owner":"jOOQ"},{"title":"How to write better emails","description":"<p><strong>Email communication</strong> is not my favorite but since I can’t avoid it, I am trying to compose messages in a way that I think it makes it easier for both me and the recipient:</p>\n<ul>\n  <li>to <strong>quickly address what is being communicated</strong></li>\n  <li><strong>avoid misunderstandings</strong></li>\n  <li><strong>save time</strong></li>\n</ul>\n\n<p>Here are some tips. They don’t apply to all type of messages, I provide <code class=\"highlighter-rouge\">before</code> and <code class=\"highlighter-rouge\">after</code> examples to better describe each case.</p>\n\n<h2 id=\"emphasize-text-with-boldunderlined-font\">Emphasize text with bold/underlined font</h2>\n\n<p><strong>Emphasizing</strong> the appropriate parts of a message, especially when it’s a long one, you help readers <strong>quickly get an idea</strong> of what the email is about and easily <strong>locate the important stuff</strong> after going back to it at some point in the future.</p>\n\n<h3 id=\"examples\">Example","link":"https://iridakos.com/programming/2019/06/26/composing-better-emails","owner":"Lazarus Lazaridis"},{"title":"Introducing the New and Improved GIPHY SDK","description":"Today, we’re announcing our new and improved GIPHY SDK, the fastest and easiest way to integrate the world’s most-loved GIF library — and the full GIPHY experience — into your app for free. Built with developers and product designers in mind, our SDK is the best way to get direct access to GIFs, stickers, and new […]","link":"https://engineering.giphy.com/introducing-the-new-and-improved-giphy-sdk/","owner":"GIPHY"}]