[{"title":"Amazon RDS Proxy makes it easier to use SQL in Serverless","description":"The release of the Amazon RDS Proxy at re:Invent removes one of the main objections to using relational databases in serverless applications. Read this post to understand why.","link":"https://serverless.com/blog/amazon-rds-proxy/","owner":"Serverless"},{"title":"NY MusicTech @ GIPHY","description":"December 10, 2019 GIPHY HQ – New York, NY Join us and the MusicTech meetup for a night of demos and musical performances! MusicTech is a community that’s supports the people who are defining what music technology will look like in the future. Demos by:– Christian Rutledge, Muzooka– Hazmin Valdes, BillFold POS– Deane Marcus, RIFF […]","link":"https://engineering.giphy.com/ny-musictech-giphy/","owner":"GIPHY"},{"title":"Provisioned Concurrency: What it is and how to use it with the Serverless Framework","description":"If you were trying to use Lambda in a use case that was very latency sensitive, cold starts were probably your greatest concern. AWS has heard the concerns","link":"https://serverless.com/blog/aws-lambda-provisioned-concurrency/","owner":"Serverless"},{"title":"Reducing Multi-Region Latency with Follower Reads","description":"At Cockroach Labs, we&apos;re focused on making data easy for our customers. CockroachDB is designed as a vendor-agnostic, cloud-native database for transactional workloads. We offer a number of benefits over traditional relational databases including serializable isolation, online schema changes, and high availability fault-tolerance. Today, we want to demonstrate another CockroachDB differentiator: multi-region support for global scale.\nIn this blog post, we introduce Follower reads,a key feature for supporting multi-region reads with low latency when your use case can accept stale data.","link":"https://www.cockroachlabs.com/blog/follower-reads/","owner":"CockroachDB"},{"title":"The Fastest Homepages in Higher Ed","description":"<p>I’ve been tracking performance on homepages within higher education since 2012. My <a href=\"https://github.com/erunyon/highered-homepages\">current list of domains clocks in at 1,769</a>. I figured it would be fun to take the performance stats from that list and compile a list of the ten fastest when tested under mobile conditions.<!-- more --></p>\n\n<h2 id=\"the-criteria\">The Criteria</h2>\n\n<ul>\n  <li>Must be an accredited, degree-granting higher education institution</li>\n  <li>Must be the primary URL for a university, college, or campus. May include campuses that fall under a larger umbrella.</li>\n  <li>Must not be a school or medical facility that exists under a parent university (that includes business schools, law schools, etc.)</li>\n  <li>Must not be a specialty school such as chiropractic or cosmetology</li>\n  <li>Must be “mobile friendly” employing responsive web design principles, without being mobile-specific</li>\n</ul>\n\n<h2 id=\"the-methodology\">The Methodology</h2>\n\n<p>All ","link":"https://erikrunyon.com/2019/12/the-fastest-homepages-in-highered/","owner":"Erik Runyon"},{"title":"Wingify towards Docker and Kubernetes","description":"Introduction: At Wingify, we follow microservices based architecture to leverage it's great scalability benefits. We have a lot of…","link":"https://engineering.wingify.com//posts/wingify-towards-docker-kubernetes/","owner":"Wingify"}]