[{"title":"Concurrency Trap #2: Incomplete Work","description":"Introduction In my first post on Goroutine Leaks, I mentioned that concurrency is a useful tool but it comes with certain traps that don&rsquo;t exist in synchronous programs. To continue with this theme, I will introduce a new trap called incomplete work. Incomplete work occurs when a program terminates before outstanding Goroutines (non-main goroutines) complete. Depending on the nature of the Goroutine that is being terminated forcefully, this may be a serious problem.","link":"https://www.ardanlabs.com/blog/2019/04/concurrency-trap-2-incomplete-work.html","owner":"William Kennedy"},{"title":"Docker user best practices","description":"","link":"https://medium.com/jobteaser-dev-team/docker-user-best-practices-a8d2ca5205f4?source=rss----bd77d16a0035---4","owner":"JobTeaser"},{"title":"Naperian Functors meet surface sea temperatures","description":"Blog post on my new site.","link":"https://idontgetoutmuch.wordpress.com/2019/04/18/naperian-functors-meet-surface-sea-temperatures/","owner":"Idontgetoutmuch's Weblog"},{"title":"Taking Our Bug Bounty Program Public","description":"We’re excited to announce the launch of our public bug bounty program with Bugcrowd — the #1 crowdsourced security platform. This public program is open to Bugcrowd’s full crowd of top, trusted whitehat hackers, and we will award up to $1,500 per vulnerability identified on our website, API, and mobile apps.","link":"https://developers.soundcloud.com/blog/taking-our-bug-bounty-program-public","owner":"Soundcloud"},{"title":"Why are my Go executable files so large?","description":"This blog post was originally published on the author&apos;s personal blog.\nOverview I built some tooling to extract details about the contents of a Go executable file, and a small D3 application to visualize this information interactively as zoomable&#xA0;tree maps.\nHere&#x2019;s a static screenshot of how the app illustrates the size of the compiled code, in this example for a group modules in CockroachDB:\nThe reason why I built this was to help me discover and learn what makes Go executable programs larger than I would expect.","link":"https://www.cockroachlabs.com/blog/go-file-size/","owner":"CockroachDB"}]