[{"title":"Introducing the High Availability Architecture Guide (CockroachDB vs. Oracle)","description":"Which is worse...? One of your users goes to check her bank balance in your app, and the service is down, or,\nOne of your users goes to check her bank balance in your app and there&apos;s a data inconsistency.\nEngineers are frequently faced with this false tradeoff: do you place a higher premium on data correctness, or high availability? This problem only becomes more complicated when you begin dealing with users distributed across broad geographies.","link":"https://www.cockroachlabs.com/blog/oracle-vs-cockroachdb/","owner":"CockroachDB"},{"title":"Search @GIPHY: Keeping up with the Zeitgeist","description":"February 12, 2019 GIPHY HQ – New York, NY While on the outside GIPHY search may seem like a standard search problem, being on the top of the zeitgeist is an increasingly viral world is a constant challenge. GIPHY has devised ways to make sure their users are getting the Most relevant search via models […]","link":"https://engineering.giphy.com/search-giphy-keeping-up-with-the-zeitgeist/","owner":"GIPHY"},{"title":"TPDP Episode #24: Mobile Application Security","description":"\n                    <p>I&rsquo;m pleased to announce that the latest episode of The Polyglot Developer Podcast titled, <strong>Mobile Application Security</strong>, has been published to iTunes, Pocket Casts, and every other major podcasting network that consumes the feed!</p>\n<p>In this episode, which is the 24th episode of the show, I&rsquo;m joined by first time guest, <a href=\"https://www.twitter.com/roblauer\">Rob Lauer</a>, and returning guest <a href=\"https://www.twitter.com/tjvantoll\">TJ VanToll</a>. Both of these guests work for <a href=\"https://www.progress.com/\">Progress</a>, which is the company behind <a href=\"https://www.nativescript.org\">NativeScript</a>, and you&rsquo;ll remember that episode 5 was strictly around getting to know what NativeScript has to offer. The focus of this episode isn&rsquo;t around NativeScript, but around the security of your mobile applications. Just like with web applications, security is important with mobile, even if it isn&rsquo;t talked ab","link":"https://www.thepolyglotdeveloper.com/2019/02/tpdp-e24-mobile-application-security/","owner":"Nic Raboy"}]