[{"title":"\nRedis 6 RC1 is out today\n","description":"So it happened again, a new Redis version reached the release candidate status, and in a few months it will hit the shelves of most supermarkets. I guess this is the most “enterprise” Redis version to date, and it’s funny since I took quite some time in order to understand what “enterprise” ever meant. I think it’s word I genuinely dislike, yet it has some meaning. Redis is now everywhere, and it is still considerably able to “scale down”: you can still download it, compile it in 30 seconds, and run it without any configuration to start hacking. But being everywhere also means being in environments where things like encryption and ACLs are a must, so Redis, inevitably, and more than thanks to me, I would say, in spite of my extreme drive for simplicity, adapted.\n","link":"\nhttp://antirez.com/news/131\n","owner":"Antirez"},{"title":"[MaxSMT] Finding minimum of a simple function using MK85 and simulated annealing","description":"[MaxSMT] Finding minimum of a simple function using MK85 and simulated annealing","link":"https://yurichev.com/news/20200312_min/","owner":"Dennis Yurichev"},{"title":"Enhancing collaboration and transparency within a product team","description":"The most effective teams strive for frequent collaboration, creating opportunities for knowledge sharing and creative problem solving.","link":"https://blog.novoda.com/collaboration-and-transparency/","owner":"Novoda"},{"title":"How Microservices Enable Multi-Cloud at the Expense of Developers","description":"This article was originally postedon the Kelda.io blogby CEO and Founder, Ethan J. Jackson. Keldais Docker compose for Kubernetes. It allows you to quickly test your code changes in a remote environment that matches production, without the complexity of interacting with Kubernetes directly.\nI recently had the pleasure of speaking about Keldaat ESCAPE/19- the multi-cloud conference, in New York City. It was a fantastic event packed full of sharp folks with interesting perspectives.","link":"https://www.cockroachlabs.com/blog/multicloud-microservicecs/","owner":"CockroachDB"}]