[{"title":"Building iOS Apps on Azure Pipelines","description":"<p>Traditionally, setting up a continuous integration system for iOS development is not always trivial. Since building can only happen on macOS, this requires a dedicated machine or alternatively, a machine you can rent (in the cloud). With all the hosted CI these days offering macOS support, such a task becomes less challenging.</p>\n\n<p>In this blog post, I summarize the necessary steps to utilize <a href=\"https://azure.microsoft.com/en-us/services/devops/pipelines/\">Azure Pipelines</a>, part of Azure DevOps (formerly known as Visual Studio Team Services) to let you run the compilation process of your iOS apps.  This is fantastic to maintain the development quality, as the automatic build can be hooked into the code review process, such as the GitHub pull request workflow. That allows you (and your team) to prevent bad commit to enter the repository, thereby fulfilling the practice of continous integration.</p>\n\n<p><img src=\"https://ariya.io/images/2019/02/ios-build.png\" alt=\"iOS Apps","link":"https://ariya.io/2019/02/building-ios-apps-on-azure-pipelines","owner":"Ariya Hidayat"},{"title":"Native & React Native @ BigCommerce","description":"Cross-platform tools \"... allowed a team of motivated engineers who had never coded mobile apps to create an impressive full-functioning prototype that turned this exploratory project into a product driven venture for our team.\"","link":"https://www.bigeng.io/native-react-native-bigcommerce/","owner":"Bigcommerce"},{"title":"OpenID Connect 3: Slack can be the identity hub of small organizations","description":"(Technically, this is a blogpost about Oauth2 and not OpenID Connect) Are you using Slack as a central communication tool? Did you know that you can also use it as your identity provider for other apps you make or buy? … ","link":"http://johannesbrodwall.com/2019/03/01/openid-connect-3-slack-can-be-the-identity-hub-of-small-organizations/","owner":"Johannes Brodwall"}]