[{"title":"Creating an email service for my son’s childhood memories with Python","description":"For a number of years – since my now-toddler son was a small baby – I’ve been keeping track of various childhood achievements or memories. When I first came up with this I was rather sleep-deprived, and couldn’t decide what the best way to store this information would be – so I went with a […]","link":"http://blog.rtwilson.com/creating-an-email-service-for-my-sons-childhood-memories-with-python/","owner":"Robin Wilson"},{"title":"Increasing TestFlight Adoption With the App Store Connect API","description":"<p>At Deliveroo, we rely on TestFlight to ensure our iOS app ships to the App Store with as few issues as possible. We don’t have manual testers and since we operate in 13 countries and support a number of country specific features and payment options, it is important to get as many people as possible to install the latest beta to cover most use cases. To do this we prompt employees in app with a modal screen to invite them to install the latest beta.</p>\n\n<figure class=\"small\">\n  <p><img src=\"/images/posts/testflight-app-store-connect-api/testflight-prompt.png\" alt=\"Deliveroo TestFlight prompt\" /></p>\n</figure>\n\n<p>The prompt is shown when the app detects it is out of date by comparing the app version with the latest version available on TestFlight. Until recently configuring the latest TestFlight version required a manual step during the release process. The developer in charge of releasing the app that week needed to update a configuration tool to set the latest available TestFlight","link":"https://deliveroo.engineering/2019/12/10/testflight-app-store-connect-api.html","owner":"Deliveroo"},{"title":"MapTiler Desktop 10.3","description":"\n          <img src=\"https://www.maptiler.com/media/2019-12-10-maptiler-desktop-10-3-1.png\"\n          alt=\"Thumb\">\n          <p>Generating maps from PDFs or GeoPDFs was significantly improved and support for the RD New tile grid has been added in the new MapTiler Desktop 10.3.</p>\n\n<h2 id=\"faster-pdf-or-geopdf-processing\">Faster PDF or GeoPDF processing</h2>\n<p>Quicker and much more beautiful maps will get users who are generating maps of venues, floor plans or blueprints in the PDF format. The library which powers maps rendering from PDFs has been upgraded to the latest version.</p>\n\n<p>Improved PDFium library on Windows / macOS (which is also used by Google for displaying PDFs in Chrome) was integrated into GDAL thanks to our team member Martin Mikita and Even Rouault.</p>\n\n<p>In future versions, we are planning to add more improvements for PDF files like layer selection.</p>\n\n<amp-img alt=\"MapTiler Desktop 10.2\" src=\"/media/2019-12-10-maptiler-desktop-10-3-2.png\" width=\"1012\" height","link":"https://www.maptiler.com/news/2019/12/maptiler-desktop-10-3/","owner":"MapTiler"}]