[{"title":"Building a RESTful API Using ReactPHP: JWT Authentication","description":"Previously we have used Basic HTTP Authentication to protect our RESTful API. This authentication method is pretty simple, but in most cases, it can be used only in the internal network with server-to-server communication. For example, we can’t store Basic Authentication credentials to mobile devices. JSON Web Tokens is another solution to protect our RESTful API. At this point, we have one resource defined on our API routes /users. Let’s create a guard-middleware to protect this resource. Also, we will create a new /authenticate route to authenticate a user and get a token. The user will store this token and send it with every request. Getting Started To be able to work with JWT we need to install a package...","link":"http://sergeyzhuk.me/2019/04/22/restful-api-with-reactphp-jwt-auth/","owner":"Sergey Zhuk"},{"title":"Disguise Driven Testing: Jest Mocks In Depth — Part 2","description":null,"link":"https://ponyfoo.com/articles/disguise-driven-testing-jest-mocks-in-depth-part-2","owner":"Pony Foo"},{"title":"Getting Familiar With Arrays And Vectors In C++","description":"\n                    <p>When it comes to the fundamentals of computer programming, arrays will almost always make an appearance. Being able to store a collection of values could be beneficial to a near endless amount of use-cases.</p>\n<p>To continue the back to the basics programming series, in this tutorial we&rsquo;ll explore standard arrays as well vectors which are a much more powerful alternative when it comes to C++.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/04/getting-familiar-arrays-vectors-cpp/'>Getting Familiar With Arrays And Vectors In C++</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2019/04/getting-familiar-arrays-vectors-cpp/","owner":"Nic Raboy"},{"title":"Improving graphics interactivity","description":null,"link":"https://undocumentedmatlab.com/articles/improving-graphics-interactivity?utm_source=rss&utm_medium=rss&utm_campaign=improving-graphics-interactivity","owner":"Undocumented Matlab"},{"title":"NVIDIA Jetson Nano - Upgrade Docker Engine","description":"<p>In our last blogposts about the <a href=\"https://blog.hypriot.com/post/nvidia-jetson-nano-intro/\">NVIDIA Jetson Nano Developer Kit - Introduction</a> and <a href=\"https://blog.hypriot.com/post/nvidia-jetson-nano-install-docker-compose/\">NVIDIA Jetson Nano - Install Docker Compose</a> we digged into the brand-new <strong>NVIDIA Jetson Nano Developer Kit</strong> and we know, that Docker 18.06.1-CE is already installed, but&hellip;</p>\n\n<p><img src=\"https://blog.hypriot.com/images/nvidia-jetson-nano-docker-ce/jetson-desktop-login.jpg\" alt=\"jetson-desktop-login.jpg\" /></p>\n\n<p>But, this isn&rsquo;t the latest available version of the Docker Engine. So, I&rsquo;d like to point you to a few different options on how to upgrade the Docker Engine to the very latest available version for the NVIDIA Jetson Nano.</p>\n\n<p></p>\n\n<h3 id=\"check-the-current-docker-version\">Check the current Docker Version</h3>\n\n<p>For this tutorial I&rsquo;m starting again with a freshly flashed SD card image.</p>\n","link":"https://blog.hypriot.com/post/nvidia-jetson-nano-upgrade-docker/","owner":"Hypriot"}]