[{"title":"Automatic Table Statistics in CockroachDB","description":"Last year, we rebuilt our&#xA0;cost-based optimizer from scratch&#xA0;for CockroachDB&#x2019;s 2.1 release. We&#x2019;ve been continuing to improve the optimizer since then, and we&#x2019;ve added a number of new features for the&#xA0;CockroachDB 19.1 release. One of the new features is automatic collection of table statistics. Automatic statistics enables the optimizer to make better decisions when choosing query plans.\nThis post explains why statistics are important for the optimizer and describes some of the challenges we overcame when implementing automatic collection.","link":"https://www.cockroachlabs.com/blog/automatic-sql-statistics/","owner":"CockroachDB"},{"title":"Fighting Back against DDoS Attacks","description":"","link":"https://medium.com/homeaway-tech-blog/fighting-back-against-ddos-attacks-8c856e0c5c64?source=rss----c8142f33b9ec---4","owner":"HomeAway"},{"title":"TPDP Episode #27: Static Website Generation with Hugo","description":"\n                    <p>I am pleased to announce that the latest episode of the Polyglot Developer Podcast has been published and is now available on all of the major podcast networks!</p>\n<p>As many of you know, <a href=\"https://www.thepolyglotdeveloper.com\">The Polyglot Developer</a> is a static website composed of strictly HTML, JavaScript and CSS. There is no backend technology, no database, nothing dynamic, and as a result it is fast, cheap to operate, and easy to maintain.</p>\n<p>This episode, <strong>Static Website Generation with Hugo</strong>, will shed some light into static site generation and how it differs and is advantageous over the popular alternatives such as WordPress and Drupal.</p>\n<p>There are many static site generators available, but the focus of this episode is on <a href=\"https://gohugo.io\">Hugo</a>, a popular generator because of its speed and functionality. To talk about Hugo, the core maintainer of the open source project, <a href=\"https://twitter.com/bepsay","link":"https://www.thepolyglotdeveloper.com/2019/05/tpdp-e27-static-website-generation-hugo/","owner":"Nic Raboy"}]