[{"title":"Beyond trivago Tech Pt. 2: Four More Side Projects from Our Developers","description":"This is part two of our series about trivago engineer&rsquo;s side projects. The first part is here.\nAs always, take a look and feel free to reach out to any of them if you&rsquo;d like to exchange on any of their topics!\nHello Rust Our backend engineer Matthias Endler is running a YouTube channel about the Rust project as a side-project. In there he explains the ins and outs of the language, but his goal is not only to present information; rather, he&rsquo;s striving to inspire fellow developers to try the language and stay curious.","link":"https://tech.trivago.com/2020/09/22/beyond-trivago-tech-pt.-2-four-more-side-projects-from-our-developers/","owner":"Trivago"},{"title":"Converting from MySQL to Postgres using NMIG","description":"<p class=\"center\"><img src=\"/blog/assets/IMG_9563.jpeg\" alt=\"IMG_9563.jpeg\" /></p>\n\n<p>Historically I've been a MySQL advocate but I've recently been quite impressed with Postgres.  This leaves me in the position of needing to migrate several MySQL databases over to Postgres -or- run two database engines in production.  And, clearly, it is far more desirable to run only a single production database server.</p>\n\n<p>I recently found the <a href=\"https://github.com/AnatolyUss/nmig\">NPM tool NMIG</a> and used it to successfully convert a MySQL database over to Postgres quickly and easily – once I got past the initial installation process.</p>\n\n<h2 id=\"installing-and-using-nmig\">Installing and Using NMIG</h2>\n\n<p>Here's what you need to do to use NMIG.</p>\n\n<p><strong>Pro Tip 2</strong>: Go into your source database before you start the conversion and do a count on any table with a large number of records.  This gives you a checksum on the overall process (NMIG has great logs but I always p","link":"http://fuzzyblog.io/blog/mysql/2020/09/22/converting-from-mysql-to-postgres-using-nmig.html","owner":"Scott Johnson"},{"title":"Introducing the New JSX Transform","description":null,"link":"https://reactjs.org/blog/2020/09/22/introducing-the-new-jsx-transform.html","owner":"React"},{"title":"Our Online Analytical Processing Journey with ClickHouse on Kubernetes","description":null,"link":"https://tech.ebayinc.com/engineering/ou-online-analytical-processing/","owner":"Ebay"},{"title":"Summer 2020 Intern Spotlight: Barcode Scanning and Shareable Worklists with Lilly","description":"","link":"https://benchling.engineering/summer-2020-intern-spotlight-barcode-scanning-and-shareable-worklists-with-lilly-ee2b7462b0cc?source=rss----3d4aa8fb07ea---4","owner":"Benchling"},{"title":"Summer 2020 Intern Spotlight: Improving the Code Deployment Pipeline with Krystopher","description":"","link":"https://benchling.engineering/summer-2020-intern-spotlight-improving-the-code-deployment-pipeline-with-krystopher-5b81992aa4de?source=rss----3d4aa8fb07ea---4","owner":"Benchling"},{"title":"Summer 2020 Intern Spotlight: Parallelizing Bulk Back Translation with Nikash","description":"","link":"https://benchling.engineering/summer-2020-intern-spotlight-parallelizing-bulk-back-translation-with-nikash-1b73d503abbd?source=rss----3d4aa8fb07ea---4","owner":"Benchling"}]