[{"title":"A quick introduction to parallelism in JavaScript","description":"Parallelism in JavaScript? you might be thinking that we are already doing parallel programming in JavaScript using setTimeout(), setInterval(), XMLHttpRequest, async/await and event handlers. But that&rsquo;s just not true. As developers, we have been mimicking parallel programming because of JavaScript&rsquo;s single threading nature using event loop.\nYes, all of the above techniques are asynchronous and non-blocking. But, that doesn&rsquo;t necessarily mean parallel programming. JavaScript&rsquo;s asynchronous events are processed after the currently executing script has yielded.","link":"https://crypt.codemancers.com/posts/2020-02-17-concurrency_in_javascript_browser/","owner":"Codemancers"},{"title":"Computers can be understood","description":"Introduction This post attempts to describe a mindset I’ve come to realize I bring to essentially all of my work with software. I attempt to articulate this mindset, some of its implications and strengths, and some of the ways in which it’s lead me astray.\nSoftware can be understood I approach software with a deep-seated belief that computers and software systems can be understood.\nThis belief is, for me, not some abstruse theoretical assertion, but a deeply felt belief that essentially any question I might care to ask (about computers) has a comprehensible answer which is accessible with determined exploration and learning.","link":"https://blog.nelhage.com/post/computers-can-be-understood/","owner":"Nelson Elhage"},{"title":"General guidelines for making an accessible web page","description":null,"link":"https://medium.com/zoosk-engineering/general-guidelines-for-making-an-accessible-web-page-d12a4a718b7a?source=rss----95d50021e056---4","owner":"Zoosk"},{"title":"macOS Catalina: Setting up a Mac for Development","description":"I have to set up a MacBook Pro fairly often - when starting a new job and when buying a new personal computer. I created this article back…","link":"https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/","owner":"Tania Rascia"},{"title":"Managing Stages and Environments","description":"Being able to manage multiple different stages of deployment within different environments is essential, and Serverless Framework Pro shows you how","link":"https://serverless.com/blog/stages-and-environments/","owner":"Serverless"},{"title":"Mastering Async Await in Node.js","description":"In this article, you will learn how you can simplify your callback or Promise based Node.js application with async functions (async/await).","link":"https://blog.risingstack.com/mastering-async-await-in-nodejs/","owner":"RisingStack"},{"title":"Tips for Engineering a Company Rebrand","description":"Rebranding your company can be fun, but people rarely talk about the engineering work needed to bring a new design to life. Here are a few lessons the engineering team learned during Gusto’s most recent rebrand.","link":"https://engineering.gusto.com/engineering-a-brand-refresh/","owner":"Gusto"}]