[{"title":"Backyard birds of Seattle","description":"Since I’m staying home all day due to the ongoing pandemic emergency, I’ve decided to document all the different species of birds that arrive in my yard. I am not a great bird photographer but I am enjoying practicing every … ","link":"https://ericlippert.com/2020/12/15/backyard-birds-of-seattle/","owner":"Eric Lippert"},{"title":"Diagnosing and fixing an ERR_CONNECTION_RESET error in WordPress","description":null,"link":"https://www.schakko.de/2020/12/14/diagnosing-and-fixing-an-err_connection_reset-error-in-wordpress/?utm_source=rss&utm_medium=rss&utm_campaign=diagnosing-and-fixing-an-err_connection_reset-error-in-wordpress","owner":"Schakko"},{"title":"GIPHY Search Trends During the 2020 Presidential Election","description":"Major social and cultural events mean “all hands on deck” here at GIPHY, as millions of people across the world use GIFs to express themselves as these events unfold. Award shows, championship games, and holidays (such as New Year’s Eve) require resources across the company — from our Editorial team “live-GIFing” video feeds in real-time […]","link":"https://engineering.giphy.com/giphy-search-trends-during-the-2020-presidential-election/","owner":"GIPHY"},{"title":"Recreate the Cyberpunk 2077 Button Glitch Effect in CSS","description":"\n            ","link":"https://www.sitepoint.com/rust-tutorial-introduction-javascript-devs/?utm_source=rss","owner":"SitePoint"},{"title":"Scalability and Load Testing for VALORANT","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/117/loadtestingheaderfinal.png\" width=\"1640\" height=\"624\" alt=\"\" />\n<p>When <em>VALORANT</em> was still early in development, we had high hopes that in the future we’d launch with high initial popularity. From the beginning, we prioritized scalability to make sure we could support the number of players we were hoping for. Once <em>VALORANT</em> entered full production, we began working in earnest on a load test framework to prove out our tech. After many months of work, we successfully ran a load test of two million simulated players against one of our test shards, giving us the confidence we needed for a smooth launch. This article explains how we load tested our platform, and how we tackled the scaling challenges we encountered along the way. </p>\n","link":"https://technology.riotgames.com/news/scalability-and-load-testing-valorant","owner":"Riot Games"},{"title":"Sensitive Data Storage Made Easy","description":"Security it always top of mind for us. Read how to setup a Linux server and utilize Vault. ","link":"https://blog.codelitt.com/sensitive-data-storage/","owner":"Codelitt"},{"title":"Statistical approaches for performance analysis","description":"<p>Software performance is a complex discipline that requires knowledge in different areas\nfrom benchmarking to the internals of modern runtimes, operating systems, and hardware.\nSurprisingly, the most difficult challenges in performance analysis are not about programming,\nthey are about mathematical statistics!</p>\n<p>Many software developers can drill into performance problems and implement excellent optimizations,\nbut they are not always know how to correctly verify these optimizations.\nThis may not look like a problem in the case of a single performance investigation.\nHowever, the situation became worse when developers try to set up an infrastructure that\nshould automatically find performance problems or prevent degradations from merging.\nIn order to make such an infrastructure reliable and useful,\nit&rsquo;s crucial to achieve an extremely low false-positive rate (otherwise, it&rsquo;s not trustable)\nand be able to detect most of the degradations (otherwise, it&rsquo;s not so usef","link":"https://aakinshin.net/posts/statistics-for-performance/","owner":"Andrey Akinshin"},{"title":"Stripe’s payments APIs: the first ten years","description":"Abstracting away the complexity of payments has driven the evolution of our APIs over the last decade. This post provides the context and conceptual frameworks behind our API design—and the milestones that led to the [PaymentIntents API](https://stripe.com/docs/payments/payment-intents). ","link":"https://stripe.com/blog/payment-api-design","owner":"Stripe"},{"title":"Sustainable CI With Buildkite","description":"Welcome again, Wayfair Engineering Enthusiasts, to our virtual fireside. Make yourself comfortable and settle in for the second installment of our Fireside Story series on Continuous Integration. If you haven’t had the pleasure, please read part one, a history of GitLab CI at Wayfair. This installment will feature GitLab CI’s...  ","link":"https://tech.wayfair.com/2020/12/sustainable-ci-with-buildkite/","owner":"Wayfair"},{"title":"The story of the one line fix","description":"Picture yourself, an engineer working at the hottest distributed microservices de jour, assigned to fix a bug. You jump into an unfamiliar codebase and quickly locate the line where the problem occurred. The fix is simple, just return early or substitute a default value in the case that one cannot be determined from your input.","link":"https://dave.cheney.net/2020/12/15/the-story-of-the-one-line-fix","owner":"Dave Cheney"}]