[{"title":"\n    South Dakota v. Wayfair, Technology, and Your Business \n  ","description":"\n    ","link":"https://hashrocket.com/blog/posts/south-dakota-v-wayfair-technology-and-your-business","owner":"Hashrocket"},{"title":"Boost the Performance of OBS Twitch Streams on Mac and Windows","description":"\n                    <p>So you&rsquo;ve decided that you want to start streaming content to Twitch, YouTube, or similar. When I say streaming, I mean live streaming, not publishing pre-recorded videos to be watched on-demand. Streaming is so popular that you might think it&rsquo;s as easy as opening your web camera and clicking stream. The reality is that there&rsquo;s a little more to it, more so around stream quality and performance.</p>\n<p>Take my stream for example. I stream a few times per month on <a href=\"https://www.twitch.tv/polyglotdev\">Twitch</a> using The Polyglot Developer. The first few streams had a large amount of framerate stuttering, audio and video synchronization issues, and computers sounding like airplane jet engines. I was able to resolve these problems by changing the way I streamed with Open Broadcast Studio (OBS).</p>\n<p>In this tutorial, I&rsquo;m going to walk you through some of the things that can be improved in Open Broadcast Studio to give you better str","link":"https://www.thepolyglotdeveloper.com/2020/05/boost-performance-obs-twitch-streams-mac-windows/","owner":"Nic Raboy"},{"title":"Keeping IT Support Human during WFH","description":"Image: Human Connection, KatieWillDesign on Etsy Hi! We’re the Etsy Engineering team that supports core IT and AV capabilities for all Etsy employees. Working across geographies has always been part of our company’s DNA; our globally distributed teams use collaboration tools like Google apps, Slack, and video conferencing. As we transitioned to a fully distributed […]","link":"https://codeascraft.com/2020/05/06/keeping-it-support-human-during-wfh/","owner":"Etsy"},{"title":"Synchronous communication - circuit breaker and fallback","description":"<div class=\"paragraph\">\n<p>The circuit breaker is a communication pattern that helps to avoid cascading failure of the system and gives dependent services time to recover.\nAlong with fallback values defined by the developer, it gives a pretty wide safe net when communication channel is broken.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/202005/circuit-breaker/\">Read more</a></p>","link":"https://blog.pchudzik.com/202005/circuit-breaker/","owner":"Paweł Chudzik"}]