[{"title":"Github Free Angular React Application Hosting","description":"<div class=\"bigInt\">Developing and hosting your own Angular, React applications has never been easier, but now there are many options like Google Firebase, Heroku and etc. Github Pages is offering some great features with free of cost no credit card required and no bandwidth limitations. Just create a public repository and commit all of your product ready files. It has a custom domain support with HTTPs enforcement.</div><br><div class=\"cen\"><img alt=\"Github Free Website Hosting\" class=\"sri650\" itemprop=\"image\" src=\"https://github.com/srinivastamada/9lessonsImages/blob/master/github/github.png?raw=true\"></div><br><a href=\"http://www.9lessons.info/2020/08/github-free-angular-react-hosting.html#more\"></a><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/9lesson?a=oh1sb9YyHIE:mp1THQhdCWg:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/9lesson?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.feedburner.com/~ff/9lesson?a=oh1sb9YyHIE:mp1THQhdCWg:qj6IDK7rITs\">","link":"http://feedproxy.google.com/~r/9lesson/~3/oh1sb9YyHIE/github-free-angular-react-hosting.html","owner":"Srinivas Tamada"},{"title":"Poor Man's High Availability Vault Server With Auto Unseal Using KMS","description":"Hashicorp&rsquo;s Vault provides a solution to secure, store and control access to secrets and other sensitive data. There are multiple ways to achieve a highly available Vault setup, some might use a cluster of vault servers, a few others might go with a master slave deployment strategy. In this blog we will be choosing a poor man&rsquo;s approach to achieve high availability for a non complex and small scale project with minimal configuration and resources.","link":"https://crypt.codemancers.com/posts/2020-08-24-poor-mans-ha-vault-server-with-auto-unseal-using-kms/","owner":"Codemancers"},{"title":"Riding the Roachermobile: Cockroach Labs’ Internal Mobility Program","description":"As a startup, our policies and processes constantly evolve. All content in this post is true at the time of publication. For the most up-to-date information, please visit our careers page or reach out to recruiting@cockroachlabs.com.\nAt Cockroach Labs, we like to embrace our namesake and dub programs after our favorite insect. So far, the dictionary consists of&#xA0; Roacher (a Cockroach Labs employee), Roachmate(your onboarding partner), and Remoacher(remote employees). We even MOLT, which is our onboarding process&#x2014; going from a nymph to an adult Cockroach.","link":"https://www.cockroachlabs.com/blog/internal-mobility-program/","owner":"CockroachDB"},{"title":"Technology and sustainability: what does the future hold?","description":"","link":"https://medium.com/yld-blog/technology-and-sustainability-what-does-the-future-hold-527c9981a86b?source=rss----39c536548b9a---4","owner":"YLD!"},{"title":"Why I Joined InVision as CTO","description":"I may be a CTO, but people—even more than technology—are what excite me. I&rsquo;ve been lucky enough to work at companies that touch nearly every corner of the world. At Microsoft, I was fortunate enough to help found major technological, team and product initiatives and see them through to rollout. These initiatives, from inception like Windows NT (1990), MSN (1993), the first Microsoft Internet Search service (1995), Natural User Interfaces (2001) and Microsoft Teams (2015), taught me that people and collaboration are the driving force behind successful product and tech design.","link":"https://engineering.invisionapp.com/post/sanjeev-katariya-invision-cto/","owner":"InVision"}]