[{"title":"Durability: Linux File APIs","description":"<p>As part of investigating the durability provided by cloud systems, I wanted to make sure I understood the basics. I started by <a href=\"http://evanjones.ca/durability-nvme.html\">reading the NVMe specification, to understand the guarantees provided by disks</a>. The summary is that you should assume your data is corrupt between when a write is issued until after a flush or force unit access write completes. However, most programs use system calls to write data. This article looks at the guarantees provided by the Linux file APIs. It seems like this should be simple: a program calls <code>write()</code> and after it completes, the data is durable. However, <code>write()</code> only copies data from the application into the kernel's cache in memory. To force the data to be durable you need to use some additional mechanism. This article is a messy collection of notes about what I've learned. (The really brief summary: use fdatasync or open with O_DSYNC.) For a better and clearer overvie","link":"https://www.evanjones.ca/durability-filesystem.html","owner":"Evan Jones"},{"title":"Getting Started with Unity for Creating a 2D Game","description":"\n                    <p>If you&rsquo;ve been keeping up with the content on the <a href=\"https://developer.mongodb.com/\">MongoDB Developer Portal</a>, you&rsquo;ll know that a few of us at MongoDB (<a href=\"https://www.nraboy.com/\">Nic Raboy</a>, <a href=\"https://www.twitter.com/adriennetacke\">Adrienne Tacke</a>, <a href=\"https://www.twitter.com/youoldmaid\">Karen Huaulme</a>) have been working on a game titled Plummeting People, a <a href=\"https://fallguys.com/\">Fall Guys: Ultimate Knockout</a> tribute game. Up until now we&rsquo;ve focused on <a href=\"https://www.thepolyglotdeveloper.com/2020/10/designing-strategy-develop-game-unity-mongodb/\">game planning</a> and part of our backend infrastructure with a <a href=\"https://www.thepolyglotdeveloper.com/2020/10//creating-user-profile-store-game-nodejs-mongodb/\">user profile store</a>.</p>\n<p>As part of the natural progression in our development of the game and part of this tutorial series, it makes sense to get started with the actual ga","link":"https://www.thepolyglotdeveloper.com/2020/10/getting-started-unity-creating-2d-game/","owner":"Nic Raboy"},{"title":"Life, part 37","description":"All right, let’s finish this thing off and finally answer the question that I’ve been asking for a while: are there any Life patterns that have unbounded quadratic growth? (Code for this final episode is here.) The answer is yes; … ","link":"https://ericlippert.com/2020/10/12/life-part-37/","owner":"Eric Lippert"},{"title":"Reducing AWS data transfer cost: Kubernetes from Multi-AZ to Single-AZ","description":"","link":"https://lambda.grofers.com/reducing-aws-data-transfer-cost-kubernetes-from-multi-az-to-single-az-341d890553b6?source=rss----42df4a1e8725---4","owner":"Grofers"}]