[{"title":"Building a College Recruiting Program for Tomorrow's Tech Industry","description":"Working at a startup presents a number of challenges for hiring. You have limited resources, you&#x2019;re lesser-known to those outside of your industry, and you innovate at breakneck speed, making it difficult to articulate what you do. In an industry where candidates are inundated with information, cutting through the noise requires new, ever-evolving strategy.\nCompound those challenges with an already-competitive job market, a broad, systemic problem regarding diversity and inclusion in STEM, and inconsistent technical education quality at both the secondary and university level, and what becomes clear is that tech companies need to invest in solutions to disrupt the status quo.","link":"https://www.cockroachlabs.com/blog/building-a-college-recruiting-program-for-tomorrows-tech-industry/","owner":"CockroachDB"},{"title":"CloudFormation To Terraform","description":"<p>For those starting with either Terraform or CloudFormation this guide is a good way to understand the differences between the two.\nI found myself a little bit stuck because I needed to find/create code (in this case) that would help me in Benchmarking our\ncompliance status in AWS. I found a solution in CloudFormation, so I wondered if there was some sort of translator tool (there wasn’t),\nand if not, how and where would I start translating this code? Would it be worth me building it from scratch in Terraform?</p>\n\n<h1 id=\"how-to-convert-cloudformation-cf-to-terraform-tf-cis-foundations-quickstart\">How to convert CloudFormation (CF) to Terraform (TF): CIS Foundations Quickstart</h1>\n\n<h4 id=\"first-lets-state-the-differences-and-how-each-syntax-is-built\">First lets state the differences and how each syntax is built:</h4>\n\n<h3 id=\"terraform\">Terraform</h3>\n\n<p>Terraform language uses HCL (Hashicorp Configuration Language). Terraform code is built around 2 key syntax constructs:</p>\n\n<u","link":"https://deliveroo.engineering/2020/01/02/CloudFormation-To-Terraform.html","owner":"Deliveroo"},{"title":"Digilite — Housing’s new visualization product","description":"","link":"https://medium.com/engineering-housing/digilite-housings-new-visualization-product-9502c2a06cb1?source=rss----3a69e32e2594---4","owner":"Housing.com"},{"title":"Do better, not best - transitioning to a growth mindset","description":"<p>In 2019, I had a few mindset shifts around recurring, daily or near-daily work.</p>\n\n<p>In short: Frequency first. Duration next. Then, quality. Make progress every day. Any progress counts, duration + quality should go unmeasured.</p>\n\n<p>Old goal: Run a marathon in 2019.\nNew goal: Run every day.</p>\n\n<p>Old goal: Write 1000 words every day.\nNew goal: Write every day.</p>\n\n<p><span class='marginnote'><img class='fullwidth' src='/assets/img/posts/burndown.png'/><br>Yikes.</span></p>\n\n<p>In the past, I was very focused on big-picture goals which had very specific targets. Make $X/year in my freelancing business, run this many miles, write this many words. I even had burndown charts.</p>\n\n<p>This approach never lasted more than a month or so. I would inevitably stumble, and be so far behind my goal, or so far off the &quot;streak&quot;, that I saw no point in getting back on. Better wait until next year, I guess.</p>\n\n<p>Unfortunately, you will inevitably stumble temporarily on the wa","link":"https://www.nateberkopec.com/blog/2020/01/02/growth-over-results.html","owner":"Nate Berkopec"},{"title":"Overlap an image over a QR code using Mogrify","description":"Recently, I was working on writing a QR code generator using Elixir for one of our clients. There was a requirement to have a logo above the QRCode and it should be in the center, to identify which company&rsquo;s QR code is being scanned. This post is about what I learned about using Mogrify Elixir library to achieve this.\nFirst we need to generate a QR code and store it in a image file.","link":"https://crypt.codemancers.com/posts/2020-01-02-overlap-an-image-over-a-qr-code-using-mogrify/","owner":"Codemancers"}]