[{"title":"Having “constant” columns in foreign keys","description":"I was asked a very interesting question on Twitter just now: @lukaseder quick q: in pg can I have a composite foreign key where one value is a constant… or do I have to store the constant in the table? constraint foreign key (foo_id, ‘bar_subtype’) references foo(foo_id,foo_type) ? — Look! The Emperor is NAKED V⃝ … ","link":"https://blog.jooq.org/2020/09/10/having-constant-columns-in-foreign-keys/","owner":"jOOQ"},{"title":"Let employees sell their equity","description":"Sometimes people choose to work for one company over another for reasons related to the work environment, for example what the company does, and whether the other employees create a place that's pleasant to work at. But a major factor is compensation. If Company A and Company B are largely comparable, but Company A offers […]","link":"https://kevin.burke.dev/kevin/let-employees-sell-equity/","owner":"Kevin Burke"},{"title":"Life, part 34","description":"All right, we have our quad data structure, we know how to get and set individual elements, and we know how to display it. We’ve deduplicated it using memoization. How do we step it forward one tick? (Code for this … ","link":"https://ericlippert.com/2020/09/10/life-part-34/","owner":"Eric Lippert"},{"title":"Performance Benchmark Analysis of Egress Filtering on Linux","description":"Traffic filtering is a common technique used to protect networks and hosts from malicious activity. The filtering can be done in the incoming and outgoing flows, better known as ingress and egress filtering. There are many examples of use cases for ingress filtering: mitigating DDoS attacks, avoiding SPAM, blocking access to services for specific geographic regions and so on.\nOne common application of egress filtering is to prevent applications and users from reaching remote hosts.","link":"/blog/2020/09/performance-benchmark-analysis-of-egress-filtering-on-linux/","owner":"Kinvolk"},{"title":"The #1 Mistake of a New Leader","description":"Read how one project taught our CTO a very important lesson early on in his career as a leader in software engineering","link":"https://blog.codelitt.com/a-new-leaders-mistake/","owner":"Codelitt"},{"title":"Understanding the Event Loop, Callbacks, Promises, and Async/Await in JavaScript","description":"This article was originally written for DigitalOcean. Introduction In the early days of the internet, websites often consisted of static…","link":"https://www.taniarascia.com/asynchronous-javascript-event-loop-callbacks-promises-async-await/","owner":"Tania Rascia"}]