[{"title":"How we reached 99.9% uptime during our busiest season","description":"<p>Availability is the lifeblood of any app. Downtime blocks new users from signing up, it damages the company reputation, and so on. Additionally for Remind, serving education administrators as they work to increase engagement of entire communities further drives the need for our systems to be available. While administrators share many of the same expectations that teachers have of Remind, that ultimate responsibility to their communities make it crucial for administrators to know that their messages were delivered and that delivery was timely.</p>\n\n<p>The impact of downtime is most apparent during the back-to-school season. Because Remind usage is so closely tied to the school year, we see our traffic increase 5 times and our sign-ups increase 15 times between July 1st and September 30th each year.</p>\n\n<p>As a result, we are always looking for ways to improve our availability. First, we need to be able to measure it.</p>\n\n<p>Internally, we define downtime at Remind as an error rate ","link":"http://engineering.remind.com/99-uptime-busiest-season/","owner":"Remind"},{"title":"Stop Using Encrypted Email","description":"<p>Email is unsafe and cannot be made safe. The tools we have today to encrypt email are badly flawed. Even if those flaws were fixed, email would remain unsafe. Its problems cannot plausibly be mitigated. Avoid encrypted email.</p>\n\n<p>Technologists hate this argument. Few of them specialize in cryptography or privacy, but all of them are interested in it, and many of them tinker with encrypted email tools.</p>\n\n<p>Most email encryption on the Internet is performative, done as a status signal or show of solidarity. Ordinary people don’t exchange email messages that any powerful adversary would bother to read, and for those people, encrypted email is <a href=\"https://www.google.com/search?q=larp\">LARP</a> security. It doesn’t matter whether or not these emails are safe, which is why they’re encrypted so shoddily.</p>\n\n<p>But we have to consider more than the LARP cases. In providing encryption, we have to assume security does matter. Messages can be material to a civil case and subject","link":"https://latacora.micro.blog/2020/02/19/stop-using-encrypted.html","owner":"Latacora"},{"title":"The Magic of Generating an Xcode Project","description":"Planet Earth vs. Jupiter. There is the same order of magnitude between the ratio of these two planets and the amount of code that defined…","link":"https://developers.soundcloud.com/blog/tuist-project-generation","owner":"Soundcloud"},{"title":"Watch all of Jane Street's tech talks","description":"<p>Jane Street has been posting tech talks from internal speakers and\ninvited guests for years—and they’re all available on our YouTube\nchannel:</p>\n\n","link":"https://blog.janestreet.com/watch-all-of-jane-streets-tech-talks/","owner":"Jane Street"}]