[{"title":"Against essential and accidental complexity","description":"\n\n<p>In the classic 1986 essay, <a href=\"http://worrydream.com/refs/Brooks-NoSilverBullet.pdf\">No Silver Bullet</a>, Fred Brooks argued that there is, in some sense, not that much that can be done to improve programmer productivity. His line of reasoning is that programming tasks contain a core of essential/conceptual<sup class=\"footnote-ref\" id=\"fnref:C\"><a rel=\"footnote\" href=\"#fn:C\">1</a></sup> complexity that's fundamentally not amenable to attack by any potential advances in technology (such as languages or tooling). He then uses an <a href=\"https://en.wikipedia.org/wiki/Amdahl%27s_law\">Ahmdahl's law</a> argument, saying that because 1/X of complexity is essential, it's impossible to ever get more than a factor of X improvement via technological improvements.</p>\n\n<p>Towards the end of the essay, Brooks claims that at least 1/2 (most) of complexity in programming is essential, bounding the potential improvement remaining for all technological programming innovations combined to, a","link":"https://danluu.com/essential-complexity/","owner":"Dan Luu"},{"title":"Announcing PhysURLs.com","description":null,"link":"https://catonmat.net/announcing-physurls","owner":"Peteris Krumins"},{"title":"Fast implementation of the moving quantile based on the partitioning heaps","description":"<p>Imagine you have a time series.\nLet&rsquo;s say, after each new observation, you want to know an &ldquo;average&rdquo; value across the last <span class=\"math inline\">\\(L\\)</span> observations.\nSuch a metric is known as <a href=\"https://en.wikipedia.org/wiki/Moving_average\">a moving average</a>\n(or rolling/running average).</p>\n<p>The most popular moving average example is <a href=\"https://en.wikipedia.org/wiki/Moving_average#Simple_moving_average\">the moving mean</a>.\nIt&rsquo;s easy to efficiently implement this metric.\nHowever, it has a major drawback: it&rsquo;s not robust.\nOutliers can easily spoil the moving mean and transform it into a meaningless and untrustable metric.</p>\n<p>Fortunately, we have a good alternative: <a href=\"https://en.wikipedia.org/wiki/Moving_average#Moving_median\">the moving median</a>.\nTypically, it generates a stable and smooth series of values.\nIn the below figure, you can see the difference between the moving mean and the moving median on noisy data.","link":"https://aakinshin.net/posts/partitioning-heaps-quantile-estimator/","owner":"Andrey Akinshin"},{"title":"The Moove It’s customer-centric model with an NPS of 82.02 certified by PwC","description":null,"link":"https://blog.moove-it.com/our-customer-centric-model-with-an-nps-of-82-certified-by-pwc/","owner":"Moove-it"},{"title":"You can, but should you? Combining some of Python’s more esoteric features","description":null,"link":"https://lerner.co.il/2020/12/28/you-can-but-should-you-combining-some-of-pythons-more-esoteric-features/","owner":"Lerner Consulting Blog"}]