[{"title":"5 Tips for Working Remote in Tech","description":"\n                    <p>There&rsquo;s a lot happening in the world right now, forcing companies to change the way they operate. For a lot of people, this means working from home, something they may have never done before, or have not done regularly.</p>\n<p>Working remote or working from home may sound like a dream come true, but it involves more focus and self control than you might think. You want to be able to prove yourself capable, while not burning yourself out in the process.</p>\n<p>I&rsquo;ve been working remote for the past five years and have picked up a few tips and tricks that I thought I&rsquo;d share to those that might be struggling with their new way of working.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/03/5-tips-working-remote-tech/'>5 Tips for Working Remote in Tech</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n     ","link":"https://www.thepolyglotdeveloper.com/2020/03/5-tips-working-remote-tech/","owner":"Nic Raboy"},{"title":"Baby steps with Covid-19 data for (Clojure) programmers","description":"<p>\nThe Corona pandemic is on everyone's mind. If your country has not been locked\ndown yet, it will be soon. The world and the human society is not going to be\nthe same as before. Let's not worry too much about how economy is going to be hit,\nbut hope that we solve it health-wise.\n</p>\n\n<p>\nAnyway, soon, most of us will have to spend most of our time inside, and when\nwe solve basic needs, and make sure our loved ones are safe, we'll have some\ntime to pass. Most people will re-watch their favorite TV shows and re-play their\ngames. I'm sure that many will acquire various skills of America's Got Talent quality.\nSome programmers, though, will itch to try their skills on Covid-19 data.\n</p>\n\n<p>\nMaybe you wanted to add some machine learning skills to your programming-fu,\nbut the day job just made that impossible. Why not start now? If this thing\nis going to be on our minds for months, if not years, we might throw some\nprogramming magic at it.\n</p>\n\n<p>\nBy now, we've seen many shiny visuali","link":"http://dragan.rocks/articles/20/Corona-1-Baby-steps-with-Covid-19-for-programmers","owner":"Dragan Djuric"},{"title":"Steps to Migrate from CoreOS to Flatcar Container Linux","description":"Flatcar Container Linux is a drop-in replacement for CoreOS Container Linux. Thus, one should think that a migration should be an effortless task, and it is.\nSince Red Hat announced that CoreOS Container Linux will reach its end-of-life on May 26 , we’ve seen a major uptick in the usage of Flatcar Container Linux. We’ve also had a number of questions about the migration process. This post looks to highlight how to migrate to Flatcar Container Linux in two ways; modifying your deployment to install Flatcar Container Linux, and updating directly from CoreOS Container Linux.","link":"/blog/2020/03/steps-to-migrate-from-coreos-to-flatcar-container-linux/","owner":"Kinvolk"},{"title":"Writing Kubernetes network policies with Inspektor Gadget’s Network Policy Advisor","description":"At KubeCon EU 2016 in London, I gave a first talk about using BPF and Kubernetes together . I was presenting a proof of concept to introduce various degraded network scenarios in specific pods for testing the reliability of apps. There was not a lot of BPF + Kubernetes talks back then. In the meantime, Kinvolk has worked on various projects mixing Kubernetes and BPF together. The latest such project is our own Inspektor Gadget , a collection of “gadgets” for debugging and inspecting Kubernetes applications.","link":"/blog/2020/03/writing-kubernetes-network-policies-with-inspektor-gadgets-network-policy-advisor/","owner":"Kinvolk"}]