[{"title":"A simple way to get more value from metrics","description":"\n\n<p>We spent one day<sup class=\"footnote-ref\" id=\"fnref:D\"><a rel=\"footnote\" href=\"#fn:D\">1</a></sup> building a system that immediately found a mid 7 figure optimization (which ended up shipping). In the first year, we shipped mid 8 figures per year worth of cost savings as a result. The key feature this system introduces is the ability to query metrics data across all hosts and all services and over any period of time (since inception), so we've called it LongTermMetrics (LTM) internally since I like boring, descriptive, names.</p>\n\n<p>This got started when I was looking for a starter project that would both help me understand the Twitter infra stack and also have some easily quantifiable value. Andy Wilcox suggested looking at <a href=\"https://stackoverflow.com/a/37102630/334816\">JVM survivor space</a> utilization for some large services. If you're not familiar with what survivor space is, you can think of it as a configurable, fixed-size buffer, in the JVM (at least if you use the","link":"https://danluu.com/metrics-analytics/","owner":"Dan Luu"},{"title":"Location Geofencing with MongoDB, Stitch, and Mapbox","description":"\n                    <p>For a lot of organizations, when it comes to location, geofencing is often a very desirable or required feature. In case you’re unfamiliar, a geofence can be thought of as a virtual perimeter for a geographic area. Often, you’ll want to know when something enters or exits that geofence so that you can apply your own business logic. Such logic might include sending a notification or updating something in your database.</p>\n<p>MongoDB supports GeoJSON data and offers quite a few operators that make working the location data easy.</p>\n<p>When it comes to geofencing, why would you want to use a database like MongoDB rather than defining boundaries directly within your client-facing application? Sure, it might be easy to define and manage one or two boundaries, but when you’re working at scale, checking to see if something has exited or entered one of many boundaries could be a hassle.</p>\n<p>In this tutorial, we&rsquo;re going to explore the <a href=\"https://docs.mo","link":"https://www.thepolyglotdeveloper.com/2020/05/location-geofencing-mongodb-stitch-mapbox/","owner":"Nic Raboy"}]