[{"title":"Live Stream with Guests Using OBS with Skype and NDI","description":"\n                    <p>As a technical content streamer, one of the most difficult tasks for me to accomplish was with having guests participate on the stream. To be clear, I don&rsquo;t mean having guests participate in the chat, I mean having them on the stream with their video, audio, and sometimes screen.</p>\n<p>Think about it. You&rsquo;re streaming to Twitch or another platform using <a href=\"https://obsproject.com/\">Open Broadcast Studio</a> (OBS). You&rsquo;re probably streaming your video and audio, but what happens if you need to include a guest? Do you do a Zoom meeting and screen-grab their video using OBS? If you&rsquo;re capturing the guest video, how do you pipe their audio? What happens if they need to share their screen as well?</p>\n<p>This can turn into a complicated mess.</p>\n<p>In this tutorial we&rsquo;re going to see how to have guests on your stream without a bunch of complicated hacks. We&rsquo;re going to see how to use a network device interface (NDI) with Sky","link":"https://www.thepolyglotdeveloper.com/2020/04/live-stream-guests-using-obs-skype-ndi/","owner":"Nic Raboy"},{"title":"Modules Part 05: Gopls Improvements","description":"Series Index Why and What\nProjects, Dependencies and Gopls\nMinimal Version Selection\nMirrors, Checksums and Athens\nGopls Improvements\nVendoring\nPrelude This is a guest post written by Rohan Challa, a member of the Go team working on gopls.\nThis document is a follow up to Bill Kennedy’s post on projects, dependencies and gopls. His post showed that gopls did not work well with modules, particularly when adding and removing dependencies from a project inside of your editor.","link":"https://www.ardanlabs.com/blog/2020/04/modules-05-gopls-improvements.html","owner":"William Kennedy"},{"title":"Updated: Formulas for Bayesian A/B Testing","description":"I’ve updated <a href=\"https://www.evanmiller.org/bayesian-ab-testing.html\">Formulas for Bayesian A/B Testing</a> to include a new equation for analyzing four-pronged (A/B/C/D) tests.","link":"http://www.evanmiller.org/bayesian-ab-testing.html","owner":"Evan Miller"}]