[{"title":"10 design principles for delightful CLIs","description":null,"link":"https://blog.developer.atlassian.com/10-design-principles-for-delightful-clis/","owner":"Atlassian"},{"title":"Animate Spritesheets in a Phaser Game","description":"\n                    <p>When it comes to 2D game development, sprite animations are going to be a critical part of the game experience. No one wants to play a game with a static unappealing image that moves around on the screen. They are going to want vibrant animations that add a certain realism to the game-play experience, even with it being 2D.</p>\n<p>There are a few ways to accomplish animations in game development. You could develop complex logic that swaps images on a sprite every time the render function updates, or you could work from a single spritesheet and iterate over the frames in that spritesheet.</p>\n<p>One of the main benefits to spritesheets, beyond them being easy to animate in modern game development frameworks, is they are easy on the computing resources. Loading one image file is less resource intensive than loading several image files, and when it comes to smooth performance in games, how you manage your resources can make or break your game.</p>\n<p>In this tutori","link":"https://www.thepolyglotdeveloper.com/2020/07/animate-spritesheets-phaser-game/","owner":"Nic Raboy"},{"title":"Distributed SQL: a Cloud-Native, Scalable Postgres Alternative","description":"Gartner predicts that by 2022, 75% of all databaseswill be deployed in the cloud. The findings shouldn&#x2019;t come as a surprise: on-premise data centers are slowly being phased out as companies realize the many benefits to running a database in the cloud.&#xA0;\nIt&#x2019;s a paradigm shift our customers at Cockroach Labs are experiencing first-hand, and, without Distributed SQL, it&#x2019;s a hard one to meet. In a recent webinar, Our Vice President of Product Marketing Jim Walker sat down with Chris Casano, one of Cockroach Lab&#x2019;s Solutions Engineers, to discuss the ins and outs of Distributed SQL, and how it delivers capabilities that traditional databases simply can&#x2019;t.","link":"https://www.cockroachlabs.com/blog/distributed-sql-webinar/","owner":"CockroachDB"},{"title":"Fixing Bugs in FFMPEG GIF Encoding","description":"Here at GIPHY Engineering, we frequently use FFmpeg to resize and reformat GIFs. We generate around 40 different renditions for each GIF uploaded to our platform, so it’s important we do so as efficiently as we can. While FFmpeg is powerful, it was designed for processing MP4 files, and its support for the GIF format […]","link":"https://engineering.giphy.com/fixing-bugs-in-ffmpeg-gif-encoding/","owner":"GIPHY"},{"title":"Generics Part 01: Basic Syntax","description":"Changes The draft is a living document which means these posts will need to change over time. This section documents when changes have taken place to this post.\n21/08/20 : Moving forward with the generics design draft\nSeries Index Generics Part 01: Basic Syntax\nGenerics Part 02: Underlying Types\nGenerics Part 03: Struct Types and Data Semantics\nIntroduction In this series of posts about generics in Go, I will present code and teach to the different aspects of the current generics draft.","link":"https://www.ardanlabs.com/blog/2020/07/generics-01-basic-syntax.html","owner":"William Kennedy"},{"title":"Good Logging","description":"To check if a program is doing what it should, you can inspect the output from a given input. But as the system grows, you also need logging to help you understand what is happening. Good log messages are crucial … ","link":"https://henrikwarne.com/2020/07/23/good-logging/","owner":"Henrik Warne"},{"title":"Introducing Domain-Oriented Microservice Architecture","description":null,"link":"https://eng.uber.com/microservice-architecture/","owner":"Uber"},{"title":"Retrieving Schemes with Project Configuration APIs","description":null,"link":"https://blog.developer.atlassian.com/retrieving-schemes-with-project-configuration-apis/","owner":"Atlassian"},{"title":"Thirteen Years","description":"<p>I’ve had five jobs since university. Of the previous four, my longest stint was four years. Today marks thirteen at Notre Dame. That’s the great thing about working for a university. After thirteen years, I’m still not bored, and there’s still so much to do.</p>\n","link":"https://erikrunyon.com/2020/07/thirteen-years/","owner":"Erik Runyon"}]