[{"title":"A case study on the migration of Housings’ application servers","description":"","link":"https://medium.com/engineering-housing/a-case-study-on-the-migration-of-housings-application-servers-fb898252c940?source=rss----3a69e32e2594---4","owner":"Housing.com"},{"title":"Applications of Blockchain to Programming Language Theory","description":"<p >Let's talk about Blockchain.  Goal is to use this forum topic to highlight its usefulness to programming language theory and practice.  If you're familiar with existing research efforts, please share them here.  In addition, feel free to generate ideas for how Blockchain could improve languages and developer productivity.</p>\n<p >As one tasty example: Blockchain helps to formalize thinking about <a href=\"https://en.wikipedia.org/wiki/Mutual_knowledge_(logic)\">mutual knowledge</a> and <a href=\"https://en.wikipedia.org/wiki/Common_knowledge_(logic)\">common knowledge</a>, and potentially think about sharing intergalactic computing power through vast distributed computing fabrics.  If we can design contracts in such a way that maximizes the usage of mutual knowledge while minimizing common knowledge to situations where you have to \"prove your collateral\", third-party transactions could eliminate a lot of back office burden.  But, there might be benefits in other areas of computer scien","link":"http://lambda-the-ultimate.org/ltu-blockchain-plt-thinktank","owner":"Lambda the Ultimate"},{"title":"JavaScript Quick Tip — Avoid Serial Request Waterfalls","description":"","link":"https://medium.com/javascript-scene/javascript-quick-tip-avoid-serial-request-waterfalls-d03c4021d5fa?source=rss----c0aeac5284ad---4","owner":"Eric Elliot"},{"title":"Modules Part 06: Vendoring","description":"Series Index Why and What\nProjects, Dependencies and Gopls\nMinimal Version Selection\nMirrors, Checksums and Athens\nGopls Improvements\nVendoring\nIntroduction It’s no secret that I am a fan of vendoring when it’s reasonable and practical to use it for your application projects. I believe vendoring gives your application projects the most durability since the project owns every line of source code it needs to build the applications. If you want a reproducible build without needing to rely on external services (like module mirrors) and being connected to the network, vendoring is the solution.","link":"https://www.ardanlabs.com/blog/2020/04/modules-06-vendoring.html","owner":"William Kennedy"},{"title":"Writing an Emulator in JavaScript (Chip-8)","description":"I spent a good portion of my childhood playing emulated NES and SNES games on my computer, but I never imagined I'd write an emulator myself…","link":"https://www.taniarascia.com/writing-an-emulator-in-javascript-chip8/","owner":"Tania Rascia"}]