[{"title":"Favourite books I read in 2019","description":"I made a concerted effort to read more in 2019 – and I succeeded, reading a total of 42 books over the year (and this doesn’t even include the many books I read to my toddler). I’ve chosen a selection of my favourites from the year to highlight in this blog post in the hope […]","link":"http://blog.rtwilson.com/favourite-books-i-read-in-2019/","owner":"Robin Wilson"},{"title":"French open data imagery in Maps API","description":"\n          <img src=\"https://www.maptiler.com/media/2020-01-20-french-open-data-imagery-available-in-maptiler-maps-api-1.jpg\"\n          alt=\"Thumb\">\n          <p>We recently updated the <a href=\"/satellite/\">MapTiler Satellite</a> all over France! Most of the high-resolution aerial imagery available as open data in the country is now seamlessly integrated into our global Satellite map and commercial datasets. This brings much more details at higher zoom levels, suitable for GIS applications and accurate web maps alike.</p>\n\n<h2 id=\"explore-french-cities-towns-andvillages\">Explore French cities, towns, and villages</h2>\n<p>Zoom in the center of Paris (check out <a href=\"https://maptiler.fr/cartes/#hybrid/fr/vector/17/2.335795/48.861108\">Le Louvre</a>, <a href=\"https://maptiler.fr/cartes/#hybrid/fr/vector/16/2.576808/49.00331\">CDG Airport</a> or <a href=\"https://maptiler.fr/cartes/#hybrid/fr/vector/16/2.241117/48.89113\">La Défense</a>), <a href=\"https://maptiler.fr/cartes/#hybrid/fr/vect","link":"https://www.maptiler.com/news/2020/01/french-open-data-imagery-available-in-maptiler-maps-api/","owner":"MapTiler"},{"title":"logv4j v2","description":"\n<div class=\"paragraph\">\n<p>When I’ve first learned that there is something more than printing things to console log4j was state of the art solution.\nThen SLF4J joined the party and improved where log4j was lacking.\nThe new version of LOG4J is available for some time already and I didn’t have a chance to look at what if offers.\nLet’s examine what’s possible with the second version of a very well known logging library.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/202001/log4j2/\">Read more</a></p>","link":"https://blog.pchudzik.com/202001/log4j2/","owner":"Paweł Chudzik"},{"title":"Testing and feedback loops","description":"Testing and feedback loops This post tries to set out one mental model I have for thinking about testing and the purpose testing serves in software engineering, and to explore some of the suggestions of this model.\nAs mentioned in an earlier post, I think a lot about working in long-lived software projects that are undergoing a lot of development and change. The goal when working on these projects is not just to produce a useful artifact at one time, but to maintain and evolve the project over time, optimizing for some combination of the present usefulness of the software, and our ability to continue to evolve and improve it into the future.","link":"https://blog.nelhage.com/post/testing-and-feedback-loops/","owner":"Nelson Elhage"},{"title":"The Power of Types for Errors","description":"At KotlinConf 2019, I talked about the power of types. In essence, I discussed limiting the number of primitives we use in our code in favor…","link":"https://developers.soundcloud.com/blog/power-of-types-for-errors","owner":"Soundcloud"}]