[{"title":"Cloud-Native Java-Persistence Layer using CockroachDB & Hibernate","description":"This blog is written by guest authors &#xA0;Robin de Silva Jayasinghe, Thomas P&#xF6;tzsch, and Joachim Mathes. Robin de Silva Jayasinghe, is a Sr. software engineer based in Germany working at synyx GmbH &amp; Co. KG. synyx is an agile software provider in Karlsruhe, Germany that works together with different companies to find the best possible IT-solutions for their challenges. Thomas and Joachim are working as software and systems engineers at Contargo, one of the leading container hinterland logistics in Europe.","link":"https://www.cockroachlabs.com/blog/java-persistence-layer-hibernate/","owner":"CockroachDB"},{"title":"Deep Learning in Clojure with Fewer Parentheses than Keras and Python","description":"<p>\n<a href=\"https://github.com/uncomplicate/deep-diamond\">Deep Diamond</a>(<iframe class=\"github-btn\" src=\"https://ghbtns.com/github-btn.html?user=uncomplicate&amp;repo=deep-diamond&amp;type=watch&amp;count=true\" width=\"100\" height=\"20\" title=\"Star on GitHub\" frameBorder=\"0\"></iframe>) is a new Deep Learning library written in Clojure.\nIts goal is to be simple, superfast, and to support both CPU and GPU computing. Try it out!\n</p>\n\n<p>\nBut it's Clojure, you might say. Why not Python? Python is simple. Python is easy.\nPython is supported by Google and Facebook. And Clojure&#x2026; Clojure is a&#x2026; you know&#x2026;\na&#x2026; Lisp! Lisp is diiifiiicuuuult. Lisp has soooo many pareentheses. Noone wants to\nwrite their DL models like <code>((((((model.add (((Conv2d etc.)))))))))))))))))))))))))</code>.\nAnd Clojure is&#x2026; you know&#x2026; running on JVM, and JVM is heeeeavy and sloooooow.\nAnd no one is using it except from Rich Hickey and his guitar.\n</p>\n\n<p>\nBoth of these are not t","link":"http://dragan.rocks/articles/20/Deep-Diamond-Deep-Learning-in-Clojure-Fewer-Parentheses-Python-Keras","owner":"Dragan Djuric"},{"title":"Meet the Interns —  Summer 2020","description":"","link":"https://engblog.nextdoor.com/meet-the-interns-summer-2020-11dd47dbc6c3?source=rss----5e54f11cdfdf---4","owner":"Nextdoor"},{"title":"Things I Do To My Every Rails Code Base","description":"<p class=\"center\"><img src=\"/blog/assets/IMG_4005.jpeg\" alt=\"IMG_4005.jpeg\" /></p>\n\n<p><strong>NOTE</strong>: This is written in a Rails context but I've applied these techniques to Python and PHP as well as other languages.  This isn't Rails specific as much as it is a development best practice.</p>\n\n<p>My very first rails codebase was a project called eduFire which was a C2C (consumer to consumer) marketplace for educators who wanted to sell online tutoring in language instruction.  This let an instructor:</p>\n\n<ul>\n  <li>build a profile</li>\n  <li>advertise their services to people who wanted to learn</li>\n  <li>conduct video tutoring sessions</li>\n  <li>make a decent side income</li>\n</ul>\n\n<p>eduFire was a lightly funded startup (seed an then an A round) where all ops tasks were done by the engineers who built the product.  And, yes, there were only two of us with about 90% of the ops tasks falling on my shoulders.  From a technical perspective, we were doing DevOps although we ce","link":"http://fuzzyblog.io/blog/rails/2020/09/18/things-i-do-to-my-every-rails-code-base.html","owner":"Scott Johnson"}]