[{"title":"Achieving 100Gbps intrusion prevention on a single server","description":"","link":"https://blog.acolyer.org/2020/11/16/pigasus/","owner":"Adrian Colyer"},{"title":"Introducing touch-free Venmo and PayPal QR Code payments at CVS Pharmacy stores nationwide","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2020/11/16/introducing-touch-free-venmo-and-paypal-qr-code-payments-at-cvs-pharmacy-stores-nationwide","owner":"Venmo"},{"title":"Kedro 6 Months In","description":"My thoughts and take homes after using Kedro for 6 months in various projects and teams.","link":"https://blog.developer.bazaarvoice.com/2020/11/16/kedro-6-months-in/","owner":"Bazaarvoice"},{"title":"Ok Google: please publish your DKIM secret keys","description":"The Internet is a dangerous place in the best of times. Sometimes Internet engineers find ways to mitigate the worst of these threats, and sometimes they fail. Every now and then, however, a major Internet company finds a solution that actually makes the situation worse for just about everyone. Today I want to talk about … ","link":"https://blog.cryptographyengineering.com/2020/11/16/ok-google-please-publish-your-dkim-secret-keys/","owner":"Matthew Green"},{"title":"Shining a light on the Kubernetes User Experience with Headlamp","description":"If you’ve ever seen a Kubernetes demo, it probably involved a terminal and someone typing commands using kubectl and arcane yaml configuration files. This might be a powerful workflow for experts, but in an age when everything has a slick web interface, it is not the most accessible user experience. It steepens the learning curve for those new to Kubernetes, and presents a barrier to occasional users.\nOf course, there are several graphical user interfaces available for Kubernetes, including the Kubernetes Dashboard project that is part of upstream Kubernetes itself.","link":"/blog/2020/11/shining-a-light-on-the-kubernetes-user-experience-with-headlamp/","owner":"Kinvolk"},{"title":"WoW private server faq","description":"What are WoW private servers ?Wow servers, also known as realms, allow you to play world of warcraft. Private servers allow you to play on a server curated by someone other than blizzard. Is it legal ?Short answer, yes. A bit longer answer, while blizzard does indeed prohibit downloading their assets, they do allow playing […]","link":"https://datchley.name/wow-private-server-faq/","owner":"Dave Atchley"}]