[{"title":"Attack of the week: Voice calls in LTE","description":"I haven’t written an “attack of the week” post in a while, and it’s been bumming me out. This is not because there’s been a lack of attacks, but mostly because there hasn’t been an attack on something sufficiently widely-used that it can rouse me out of my blogging torpor. But today brings a beautiful … ","link":"https://blog.cryptographyengineering.com/2020/08/12/attack-of-the-week-voice-calls-in-lte/","owner":"Matthew Green"},{"title":"Hacking Remotely","description":"At Just Eat Takeaway.com we love Hackathons. They’ve been a key part of our culture for as long as I’ve worked here and for many years before that. I’d like to discuss how we make being a part of them so great at work, the benefits that we get from them and how we’ve adapted...","link":"https://tech.justeattakeaway.com/2020/08/12/hacking-remotely/","owner":"Just Eat"},{"title":"Handle Collisions Between Sprites in Phaser with Arcade Physics","description":"\n                    <p>When it comes to game development, a lot of games will require interaction between the player and the environment or the player and another player. For example, you&rsquo;d probably want to prevent your player from falling through floors or make them lose health every time an opponent collides with them.</p>\n<p>There are numerous strategies towards handling collisions in your game. You could identify the position and bounding boxes for every sprite in your game, something I don&rsquo;t recommend, or you could make use of the physics engine that&rsquo;s available with your game development framework.</p>\n<p>The past few tutorials have focused on <a href=\"http://phaser.io/\">Phaser</a>, so we&rsquo;re going to proceed with developing a game using that framework.</p>\n<p>In this tutorial, we&rsquo;re going to look at using arcade physics, one of several physics engines available in Phaser 3.x, and we&rsquo;re going to see how to handle collisions.</p>\n               ","link":"https://www.thepolyglotdeveloper.com/2020/08/handle-collisions-between-sprites-phaser-arcade-physics/","owner":"Nic Raboy"},{"title":"How Cockroach Labs Supports Work-From-Home During COVID-19","description":"As a startup, our policies and processes constantly evolve. All content in this post is true at the time of publication. For the most up-to-date information, please visit our careers page or reach out to recruiting@cockroachlabs.com\nAdjusting to a completely remote lifestyle to weather a pandemic has been no easy feat. For many of us, maintaining productivity has been even harder. Cockroach Labs is working hard to ensure that our people have what they need to take care of themselves and work effectively, no matter where they are.","link":"https://www.cockroachlabs.com/blog/remote-work/","owner":"CockroachDB"},{"title":"How we built it: our new Articles feature for Stack Overflow Teams","description":null,"link":"https://stackoverflow.blog/2020/08/12/how-we-built-it-articles-feature-stack-overflow-teams/","owner":"Stack Overflow"},{"title":"Writing Reactive Microservices for the JVM","description":null,"link":"https://glennengstrand.info/blog/?p=551","owner":"Glenn Engstrand"}]