[{"title":"7 Elements of AI Product Strategy","description":"A playbook for building ML powered products, teams and businesses","link":"https://www.semantics3.com/blog/7-elements-of-ai-product-strategy/","owner":"Semantics3"},{"title":"AWS Lambda Destination Support","description":"The Serverless Framework now supports the recently released Lambda Event Destinations.","link":"https://serverless.com/blog/lambda-destinations/","owner":"Serverless"},{"title":"Fighting coronavirus with MapTiler maps","description":"\n          <img src=\"https://www.maptiler.com/media/2020-03-10-fighting-coronavirus-with-maptiler-maps-1.png\"\n          alt=\"Thumb\">\n          <p>Since the coronavirus (COVID-19) outbreak in December, journalists have played a very important role in informing the public about the global pandemic. The Berliner Morgenpost created an <a href=\"https://interaktiv.morgenpost.de/corona-virus-karte-infektionen-deutschland-weltweit/\">interactive map</a> that shows the current spread of the virus all over the world.</p>\n\n<h2 id=\"up-to-date-map-from-berliner-morgenpost\">Up-to-Date Map from Berliner Morgenpost</h2>\n<p>In the middle of January, when the coronavirus hit the European continent, the data team from Berliner Morgenpost created an interactive map showing the current state of the pandemic in each country.</p>\n\n<p>Diagrams show the constantly updating figures of people who are confirmed infected, cured, or died from the virus.</p>\n\n<p>The charts are dynamically updated as new information i","link":"https://www.maptiler.com/news/2020/03/fighting-coronavirus-with-maptiler-maps/","owner":"MapTiler"},{"title":"go test -v streaming output","description":"The testing package is one of my favourite packages in the Go standard library, not just because of its low noise approach to unit testing, but, over the lifetime of Go, it has received a steady stream of quality of life improvements driven by real world usage. The most recent example of this is, in","link":"https://dave.cheney.net/2020/03/10/go-test-v-streaming-output","owner":"Dave Cheney"},{"title":"The First Prettier Plugin For Twig is Here","description":"trivago open sourced a Prettier plugin for the Twig template language. It is available under the Apache 2.0 license, and you can access it on trivago&rsquo;s Github space.\nThe trivago core product runs on our own frontend framework Melody. Melody uses a Twig-inspired template language because when it was introduced, it had to be interoperable with our existing codebase, which was based on the Symfony PHP framework with Twig as the default template language.","link":"https://tech.trivago.com/2020/03/10/the-first-prettier-plugin-for-twig-is-here/","owner":"Trivago"}]