[{"title":"Access Selenium Test Screenshots on failed GitLab Pipeline Steps","description":"<div class=\"article-intro\">\r\n    You know those moments when your Selenium based test succeeds locally, but for some weird reason fails on CI? The only hope: screenshots of the failed run! Let&rsquo;s quickly have a look at how we can tell GitLab to store those screenshots on a failed run.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/1Xu7XpSxDV8\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/1Xu7XpSxDV8/","owner":"Juri Strumpflohner"},{"title":"Angular Multiple Language Support using Internationalization (i18n)","description":"<div class=\"bigInt\">Modern web and mobile user experiences is a worldwide thing. Localization of your application (supporting multiple languages) will help you to reach worldwide people.  Angular is offering Internationalization(i18n) plugins to enrich your application with multiple languages. In this post I will discuss the implementation with lazy loading design pattern with supporting dynamic content. Take a quick look at the live demo and choose the language. </div><br><div class=\"cen\"><img alt=\"Angular Translate\" class=\"sri650\" itemprop=\"image\" src=\"https://github.com/srinivastamada/9lessonsImages/blob/master/translate/angular-translate.jpg?raw=true\"></div><br><a href=\"http://www.9lessons.info/2020/10/angular-internationalization-multi-langu.html#more\"></a><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/9lesson?a=0c_tQweqelc:Rx6ByIfLcQs:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/9lesson?d=yIl2AUoC8zA\" border=\"0\"></img></a> <a href=\"http://feeds.feedbu","link":"http://feedproxy.google.com/~r/9lesson/~3/0c_tQweqelc/angular-internationalization-multi-langu.html","owner":"Srinivas Tamada"},{"title":"Animate Spritesheets in a Unity 2D Game","description":"\n                    <p>When it comes to developing a game, at some point in time you&rsquo;re going to want to animate some component within the game. These animations could be character sprites or even elements that exist as part of the background.</p>\n<p>A few months back, I wrote a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2020/07/animate-spritesheets-phaser-game/\">Animate Spritesheets in a Phaser Game</a>, around creating a spritesheet and then animating it within a Phaser game. Phaser is an awesome framework, but it doesn&rsquo;t compare to Unity on a professional level. So what if we wanted to animate a spritesheet in Unity?</p>\n<p>In this tutorial we&rsquo;re going to see how to animate a spritesheet, the same example from the previous tutorial, but this time with Unity, animation clips, animator states, and some basic C#.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/10/animat","link":"https://www.thepolyglotdeveloper.com/2020/10/animate-spritesheets-unity-2d-game/","owner":"Nic Raboy"},{"title":"min(), max(), and clamp(): Three Logical CSS Functions to Use Today","description":"Learn how to control element sizing, maintain proper spacing, and implement fluid typography using these well-supported CSS functions.","link":"https://una.im/2020/10/14/min-max-clamp/","owner":"Una Kravets"},{"title":"The Architecture of a Distributed SQL Database Pt 1: Converting SQL to a KV Store","description":"CockroachDB was designed to be the open source database our founders wanted to use. It delivers consistent, scalable SQL in a distributed environment. Developers often have questions about how we&apos;ve achieved this, and our short answer is this: Distributed SQL. Our long answer requires a deeper understanding of CockroachDB&#x2019;s unique architecture.&#xA0;\nYou definitely don&#x2019;t need to understand the underlying architecture of CockroachDB in order to use CockroachDB. This blog series on the architecture of CockroachDB gives serious users and database enthusiasts a high-level framework to explain what&apos;s happening under the hood.","link":"https://www.cockroachlabs.com/blog/distributed-sql-key-value-store/","owner":"CockroachDB"}]