[{"title":"Automating a Brand with Automate.io, Social Media, and Email Marketing","description":"\n                    <p>When it comes to blogging or running any kind of brand or business, you&rsquo;re going to find a certain rhythm in the activities that you do to keep it functioning. Many of these activities are simple, repetitive, and time consuming over the long term. In certain circumstances, the activities can be automated without needing your intervention.</p>\n<p>I know what you&rsquo;re thinking. For what possible reason could a marketing automation entry on The Polyglot Developer make any sense, since The Polyglot Developer is known for development related topics. While not really a technical topic, you have to remember that The Polyglot Developer is a brand that needs to find its way into the eyes of a technical audience.</p>\n<p>In this article, you&rsquo;re going to learn about how I&rsquo;m using various marketing and automation tools to create workflows that reduce some of the repetitive tasks that happen daily.</p>\n                    \n                        <p>The ","link":"https://www.thepolyglotdeveloper.com/2020/01/automating-a-brand-with-autiomateio-social-media-email-marketing/","owner":"Nic Raboy"},{"title":"Bring Your Venmo Feed to Life with New Custom Animated Stickers from Holler","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2020/1/20/bring-your-venmo-feed-to-life-with-new-custom-animated-stickers-from-holler","owner":"Venmo"},{"title":"Creating and deploying chrome extension on Web Store","description":"","link":"https://engineering.upgrad.com/creating-and-deploying-chrome-extension-on-web-store-15f779908eb3?source=rss----c08812b771e6---4","owner":"UpGrad"},{"title":"My Favourite Soft Skills Interview Questions","description":null,"link":"https://34.220.116.254:80/my-favourite-soft-skills-interview-questions/","owner":"Dean Hume"},{"title":"Our Engineers move people: George Goodyer, Skyscanner Chief Technology Officer","description":"","link":"https://medium.com/@SkyscannerEng/our-engineers-move-people-george-goodyer-skyscanner-chief-technology-officer-825192efb4e4?source=rss-401f3b3c958f------2","owner":"Skyscanner"},{"title":"The Ethical Cloud: How to Evaluate the True Cost of Your Cloud Platform","description":"Cloud services abstract away a lot of complexities involved in data center provisioning. Usually, we think of this as a good thing. It&#x2019;s a huge boon to developer productivity, lowers overhead costs, and allows individual developers and small companies to experiment and grow like never before. But as Rob Reid spoke about at ESCAPE/19, this abstraction obfuscates some darker elements of data center provisioning. Like it or not, cloud computing has real ethical costs attached to it, and due to the &#x201C;service&#x201D; part of &#x201C;cloud services&#x201D;, we won&#x2019;t see those costs unless we actively look for them.","link":"https://www.cockroachlabs.com/blog/the-ethical-cloud/","owner":"CockroachDB"}]