[{"title":"“Avacado” or Avocado? ","description":"","link":"https://tech.instacart.com/avacado-or-avocado-4b4b78dc0698?source=rss----587883b5d2ee---4","owner":"Instacart"},{"title":"Building from the Baltics: Meet the Uber Engineering Team in Vilnius, Lithuania","description":null,"link":"https://eng.uber.com/building-from-the-baltics-uber-vilnius/","owner":"Uber"},{"title":"Exploring the WDAC Microsoft Recommended Block Rules: VisualUiaVerifyNative","description":"Introduction If you have followed this blog over the last few years, many of the posts focus on techniques for bypassing application control solutions such as Windows Defender Application Control (WDAC)/Device Guard and AppLocker. I have not been blogging as much lately but wanted to get back into the rhythm and establish a similar theme […]","link":"https://bohops.com/2020/10/15/exploring-the-wdac-microsoft-recommended-block-rules-visualuiaverifynative/","owner":"Bohops"},{"title":"GigaOm Radar Report: How Enterprise Companies Compare Cloud Databases","description":"There&#x2019;s a new paradigm in the database industry: Databases-as-a-Service. With their inherent advantages in elasticity, cost of ownership, and provisioning flexibility, the Database-as-a-Service (DBaaS) model is quickly becoming the easy choice for small companies and startups. But in enterprise environments, navigating a paradigm shift like this is a different story.&#xA0;\nIn enterprise environments, it may be imprudent to break completely from the on-premises past and present. As is always the case, diligent enterprise organizations must survey the market and take a holistic approach that deals with their data needs in totality.","link":"https://www.cockroachlabs.com/blog/gigaom-enterprise-cloud-databases-comparison-dbaas/","owner":"CockroachDB"},{"title":"webpack Tutorial: How to Set Up webpack 5 From Scratch","description":"webpack used to be a frustrating and overwhelming beast to me. I felt safe using something like  to set up a project, but I avoided webpack…","link":"https://www.taniarascia.com/how-to-use-webpack/","owner":"Tania Rascia"}]