[{"title":"About Async Iterators in Node.js","description":"Async Iterators can be used when we don't know the values & end state we iterate over. Instead, we get promises eventually resolving to the usual object.","link":"https://blog.risingstack.com/async-iterators-in-node-js/","owner":"RisingStack"},{"title":"Cockroach Labs Raises $87 Million of New Investment, Capping a Year of Exceptional Growth","description":"We&#x2019;re proud to mark a new milestone for Cockroach Labs. In a reflection of our continued growth and the overwhelming need for a new database to support cloud-native applications, we&#x2019;ve closed $87 million in a series D financing round co-led by Altimeter Capital and Bond Capital.&#xA0;\nCockroach Labs was founded on a hypothesis: modern, cloud-native applications will need a new type of database built on a distributed architecture to provide bulletproof resilience and elastic, effortless scale, and we can deliver it.","link":"https://www.cockroachlabs.com/blog/cockroach-labs-raises-87-million-of-new-investment-capping-a-year-of-exceptional-growth/","owner":"CockroachDB"},{"title":"Open Sourcing Intervene","description":"A little while back, the web team at SoundCloud got an urgent report that our upload page looked weird in the US. Web engineering is based…","link":"https://developers.soundcloud.com/blog/open-sourcing-intervene","owner":"Soundcloud"},{"title":"The most beautiful fractal I have ever created","description":null,"link":"https://catonmat.net/beautiful-fractal","owner":"Peteris Krumins"},{"title":"TPDP Episode #36: Machine Learning, AI, and Data Science","description":"\n                    <p>The latest episode of The Polyglot Developer Podcast, episode thirty-six featuring <a href=\"https://www.linkedin.com/in/lidderupk/\">Upkar Lidder</a> from IBM, can be found on all of the major podcast networks, including, but not limited to, <a href=\"https://open.spotify.com/show/5eUHubRedHe3ljcnMsyG2T?si=h7873UMlRCiy_HRdeqG3bg\">Spotify</a> and <a href=\"https://itunes.apple.com/us/podcast/the-polyglot-developer-podcast/id1070975158\">Apple Podcasts</a>.</p>\n<p>In this episode titled, <strong>Machine Learning, AI, and Data Science</strong>, Upkar and myself explore what people mean when they talk about machine learning as well as when and how it should be implemented in your own projects.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/05/tpdp-e36-machine-learning-ai-data-science/'>TPDP Episode #36: Machine Learning, AI, and Data Science</a> appeared first on <a rel='nofollow' href='http","link":"https://www.thepolyglotdeveloper.com/2020/05/tpdp-e36-machine-learning-ai-data-science/","owner":"Nic Raboy"},{"title":"Using Custom Chef Recipes in AWS OpsWorks","description":"A Good Step by step Article on how to use Chef Recipe in AWS OpsWorks","link":"https://www.airpair.com/aws-opsworks/posts/using-custom-chef-recipes-in-aws-opsworks","owner":"AirPair"},{"title":"Using SQL Server FOR XML and FOR JSON Syntax on Other RDBMS With jOOQ","description":"SQL Server supports transforming flat tabular SQL result sets into hierarchical structures by convention using the convenient FOR XML or FOR JSON syntaxes. This is really convenient and less verbose than the standard SQL/XML or SQL/JSON APIs – although the standard ones are more powerful. In this blog post, I’d like to show a few … ","link":"https://blog.jooq.org/2020/05/05/using-sql-server-for-xml-and-for-json-syntax-on-other-rdbms-with-jooq/","owner":"jOOQ"}]