[{"title":"A lua-nginx Client for Pub/Sub","description":"Introduction Lua as a part of the OpenResty package, is extensively used in our in-house Dynamic CDN (DACDN) module. CDN generally is used…","link":"https://engineering.wingify.com//posts/a-lua-nginx-client-for-pubsub/","owner":"Wingify"},{"title":"Enhancing TypeScript at LiveRamp","description":null,"link":"https://liveramp.com/engineering/enhancing-typescript-at-liveramp/","owner":"LiveRamp"},{"title":"How To Get Fooled By Metrics","description":"Metrics are one of the main building blocks in the topic of observability.\nHence, we have a lot of metrics within our applications and especially for the connections between our applications. Every outgoing request has its latency measured and we also record the sizes of the request and the response. These numbers are collected in histograms and based on that data, in our Grafana graphs, we create corresponding graphs that show us e.","link":"https://tech.trivago.com/2020/12/04/how-to-get-fooled-by-metrics/","owner":"Trivago"},{"title":"Part 1: Computer Vision @ GIPHY: How we Created an AutoTagging Model Using Deep Learning","description":"Motivation GIPHY search is powered by ElasticSearch, where GIFs are represented as documents with various features, such as tags and captions. Tags in particular have a great impact on the search performance. Therefore, at GIPHY Engineering, we continuously track and improve their quality with both manual and automated verification. However, for the last couple of […]","link":"https://engineering.giphy.com/computer-vision-giphy-how-we-created-an-autotagging-model-using-deep-learning/","owner":"GIPHY"},{"title":"VISCA camera control in C#","description":"During lockdown, I’ve been doing quite a lot of tech work for my local church… mostly acting in a sort of “producer” role for our Zoom services, but also working out how we can enable “hybrid” services when some of us are back in our church buildings, with others still at home. (This is partly … ","link":"https://codeblog.jonskeet.uk/2020/12/04/visca-camera-control-in-c/","owner":"Jon Skeet"}]