[{"title":"A few Git tips","description":"I don't do that much that's clever with git, but I've found the following helpful. Automatically prune When you do a git fetch or git pull, you can ask it to remove remote tracking branches for a branch that has been removed on the remote by using the --prune flag. This can be automated globally with: [crayon-60b4c0053213b657388150/] and if you only want it for a specific repository, you can use: [crayon-60b4c00532140431463617/] One line log I… ","link":"https://akrabat.com/a-few-git-tips/","owner":"Rob Allen"},{"title":"Crossing the Enterprise Chasm with Michael Grinich","description":null,"link":"https://semaphoreci.com/blog/enterprise-chasm-michael-grinich","owner":"Semaphore CI Engineering"},{"title":"Customer cohort analysis: Using event data to understand customer behavior","description":"We like cohorts because they are only able to grow, retaining each individual customer that enters. The fact that someone can’t be removed from a cohort means that, when modeling, we can expect results from our historical models to be consistent.","link":"https://faraday.ai/blog/customer-cohort-analysis-predict-behavior/","owner":"Faraday"},{"title":"How Engineering Internships Work at Cockroach Labs","description":"When building out our internship program at Cockroach Labs, we wanted to be intentional about how we would support up-and-coming developers, bring in fresh ideas, and create a funnel of amazing new grads to Cockroach Labs. It’s been five years since we hosted our first interns at our headquarters in New York. As the company has grown, so has our engineering internship program. Our general philosophy around interns may be different from other technology companies: we assign real work that applies to the next releases of CockroachDB and CockroachCloud.","link":"https://www.cockroachlabs.com/blog/how-eng-internships-work/","owner":"CockroachDB"},{"title":"How to Define a Brand Voice for Maximum Impact","description":"A company’s brand voice is its unique demeanor and style of delivery, and it shapes every customer interaction. How can companies define brand voice guidelines that inspire ongoing trust?","link":"https://www.toptal.com/designers/branding-experts/define-brand-voice","owner":"Toptal"},{"title":"How to Perform a Basic Rolling Upgrade of a Kubernetes Cluster","description":"\n                    ","link":"https://d2iq.com/blog/how-to-perform-a-basic-rolling-upgrade-of-a-kubernetes-cluster","owner":"Mesosphere"},{"title":"Improving the Developer Experience for Operating Services","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/122/consoleheader.png\" width=\"1600\" height=\"611\" alt=\"\" />\n<p dir=\"ltr\">Hello! I’m James “WxWatch” Glenn and I’m a software engineer on the Riot Developer Experience: Operability (RDX:OP) team. My team focuses on providing tools for Riot engineers and operations teams that help them better understand the state of their live services across the globe. Some of these tools include Riot’s service metrics, logging, and alerting pipelines. In this article, I’ll be talking about our one-stop-shop application for Rioters operating services - Console.</p>\n","link":"https://technology.riotgames.com/news/improving-developer-experience-operating-services","owner":"Riot Games"},{"title":"Introducing the DigitalOcean OpenAPI Specification","description":"When v2 of our API first entered general availability in April of 2015, it consisted mainly of features supporting Droplets and domains. Since then, DigitalOcean’s product portfolio has grown, and the surface area of our API has greatly expanded along with it. Today our API supports App Platform, databases, firewalls, Kubernetes, load balancers, and more. Providing over 200 operations, our API enables you to do just about anything you can do in our control panel programmatically.","link":"https://www.digitalocean.com/blog/introducing-the-digitalocean-openapi-specification","owner":"DigitalOcean"},{"title":"Never Again Forget to Call .execute() in jOOQ","description":"jOOQ’s DSL, like any fluent API, has one big caveat. It’s very easy to forget to call .execute(). And when you do, chances are, you’re going to be staring at your code for minutes, because everything looks perfect: Staring… staring… staring… Why is it not inserting that row? “Aaaah, not again!!” This is how it’s … ","link":"https://blog.jooq.org/2021/03/30/never-again-forget-to-call-execute-in-jooq/","owner":"jOOQ"},{"title":"New Course: Build a Full-Stack App in Java with Spring Boot & CockroachDB","description":"We are excited to share that Fundamentals of CockroachDB for Java Developers is now available on Cockroach University. This course is designed for Java application developers who are looking to advance their education with CockroachDB and build scalable, resilient applications and services.\nThis is our third course offering following the inaugural Getting Started course and Fundamentals of CockroachDB for Python Developers. Similar to the Python course, you will build a full-stack-ride sharing application, but in Java using Spring Boot with Spring Data JPA.","link":"https://www.cockroachlabs.com/blog/cockroachdb-for-java-course/","owner":"CockroachDB"},{"title":"Open sourcing Querybook, Pinterest’s collaborative big data hub","description":"","link":"https://medium.com/pinterest-engineering/open-sourcing-querybook-pinterests-collaborative-big-data-hub-ba2605558883?source=rss-ef81ef829bcb------2","owner":"Pinterest"},{"title":"Preventing YAML parsing vulnerabilities with snakeyaml in Java","description":"YAML files are often used to configure applications, application servers, or clusters. It is a very common format in Spring Boot applications and, of course, to configure Kubernetes. However, similarly to JSON and XML, you can use YAML to serialize and deserialize data. Although YAML looks like an excellent alternative for XML and JSON, many […]","link":"https://snyk.io/blog/java-yaml-parser-with-snakeyaml/","owner":"Snyk"},{"title":"Running Atlantis at Lyft","description":"","link":"https://eng.lyft.com/running-atlantis-at-lyft-b95c7fa51db1?source=rss----25cd379abb8---4","owner":"Lyft"},{"title":"Secure coding with Snyk Code: Ignore functionality with a twist","description":"Snyk Code provides the ability to ignore suggestions. Learn about our take on this functionality using intermediate representation. We think you'll like it.","link":"https://snyk.io/blog/secure-coding-snyk-code-ignore-feature-twist/","owner":"Snyk"},{"title":"See How the New Evernote is Getting Better Every Day","description":null,"link":"https://evernote.com/blog/new-evernote-getting-better-every-day/","owner":"Evernote"},{"title":"SoloCoder Podcast: About Coding and Martial Arts","description":"<div class=\"article-intro\">\r\n    I recently had the pleasure to be on the SoloCoder podcast hosted by Aderson Oliveira.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/FSI3S57lL0c\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/FSI3S57lL0c/","owner":"Juri Strumpflohner"},{"title":"Some opinionated thoughts on SQL databases","description":"People who work with me tend to realize that I have Opinions about databases, and SQL databases in particular. Last week, I wrote about a Postgres debugging story and tweeted about AWS’ policy ban on internal use of SQL databases, and had occasion to discuss and debate some of those feelings on Twitter; this article is an attempt to write up more of them into a single place I can refer to.","link":"https://blog.nelhage.com/post/some-opinionated-sql-takes/","owner":"Nelson Elhage"},{"title":"The Big Consumer Financial Trends for 2021","description":null,"link":"https://www.brandwatch.com/blog/big-consumer-financial-trends-2021/","owner":"Brandwatch"},{"title":"The Big Media & Entertainment Industry Trends for 2021","description":null,"link":"https://www.brandwatch.com/blog/big-media-entertainment-industry-trends-2021/","owner":"Brandwatch"},{"title":"The Winner's Curse","description":"<h1 id=\"introduction\">Introduction</h1>\n\n<p>Anytime you have an auction, you have the potential for the\n<a href=\"https://en.wikipedia.org/wiki/Winner%27s_curse\">winner’s curse</a>,\na simple, yet surprising, statistical phenomenon. Despite its\nsimplicity, the effect can have significant financial implications\nfor anyone participating in auctions.</p>\n\n<p>We care about the winner’s curse at NextRoll because we\nparticipate in about 100,000 ad auctions per second. In this\npost, we explain the curse and explore the way it manifests\nitself in our ad-buying systems.</p>\n\n<h1 id=\"understanding-the-curse\">Understanding the Curse</h1>\n\n<p>Let’s pretend Alice is auctioning off a jar containing exactly\n$25 of spare change she has collected. <script type=\"math/tex\">N</script> of Alice’s friends\nparticipate in the auction, hoping to purchase Alice’s jar of\nchange. No one can open the jar before the auction, but each of\nAlice’s friends can inspect the jar to estimate the total worth\nof the coins cont","link":"https://tech.nextroll.com/blog/data-science/2021/03/30/winners-curse.html","owner":"AdRoll"},{"title":"Trimmed modification of the Harrell-Davis quantile estimator","description":"<p>In one of <a href=\"https://aakinshin.net/posts/winsorized-hdqe/\">the previous posts</a>, I discussed winsorized Harrell-Davis quantile estimator.\nThis estimator is more robust than the classic Harrell-Davis quantile estimator.\nIn this post, I want to suggest another modification that may be better for some corner cases:\nthe <em>trimmed</em> Harrell-Davis quantile estimator.</p>","link":"https://aakinshin.net/posts/trimmed-hdqe/","owner":"Andrey Akinshin"}]