[{"title":"Cracking the code on gender parity in the workplace","description":null,"link":"https://blog.cloudera.com/cracking-the-code-on-gender-parity-in-the-workplace/","owner":"Cloudera"},{"title":"Developer Driven Workflows – Dockerfile & image scanning, prioritization, and remediation","description":"When deploying applications in containers, developers are now having to take on responsibilities related to operating system level security concerns. Often, these are unfamiliar topics that, in many cases, had previously been handled by operations and security teams. While this new domain can seem daunting there are various tools and practices that you can incorporate […]","link":"https://snyk.io/blog/dockerfile-optimization-and-docker-image-security-scanning/","owner":"Snyk"},{"title":"Getting Started with the Realm SDK for Unity","description":"\n                    <p>Did you know that MongoDB has a <a href=\"https://www.mongodb.com/realm\">Realm SDK</a> for the <a href=\"https://www.unity.com\">Unity</a> game development\nframework that makes working with game data effortless? The Realm SDK is currently\nan alpha release, but you can already start using it to build\npersistence into your cross platform gaming projects.</p>\n<p>A few weeks ago I <a href=\"https://youtu.be/8S0NuFwFazY\">streamed</a> about and wrote about <a href=\"https://developer.mongodb.com/how-to/build-infinite-runner-game-unity-realm-unity-sdk/\">creating an infinite runner</a>\ntype game using Unity and the Realm SDK for Unity. Realm was used for\nstoring the score between scenes and sessions within the game.</p>\n<p>There were a lot of deep topics in the infinite runner (think Temple Run or Subway Surfer) example, so I\nwanted to take a step back. In this tutorial, we&rsquo;re going to spend less\ntime making an interesting game and more time including and using Realm\nw","link":"https://www.thepolyglotdeveloper.com/2021/03/getting-started-realm-sdk-unity/","owner":"Nic Raboy"},{"title":"How to build brand loyalty that will last beyond the pandemic","description":"Customer retention isn’t just about keeping customers coming back — it’s about building loyalty and encouraging enthusiasm around your products so that customers are excited to engage with your brand and share that with others.","link":"https://faraday.ai/blog/build-brand-loyalty-pandemic/","owner":"Faraday"},{"title":"SQL injection cheat sheet: 8 best practices to prevent SQL injection attacks","description":"SQL injection is one of the most dangerous vulnerabilities for online applications. It occurs when a user adds untrusted data to a database query. For instance, when filling in a web form. If SQL injection is possible, smart attackers can create user input to steal valuable data, bypass authentication, or corrupt the records in your […]","link":"https://snyk.io/blog/sql-injection-cheat-sheet/","owner":"Snyk"},{"title":"Women’s Voices — A Product Design Story","description":"","link":"https://deezer.io/womens-voices-a-product-design-story-bb9891530ff2?source=rss----2ab7e077175a---4","owner":"Deezer"}]