[{"title":"10 Data Predictions for Your Data Strategy in 2021","description":"","link":"https://www.singlestore.com/blog/10-data-predictions-for-your-data-strategy-in-2021","owner":"MemSQL"},{"title":"A Letter to My Team","description":"<p>You sent me a Word doc on Wed 18 Mar 2020.  Inside the doc was a copy/paste of a very large slack conversation.  Inside the conversation was the complete contents of our production incidents channel on the morning of Mon 16 Mar.</p>\n\n<p>I glanced at the document, but was busy - our systems were straining and crashing because COVID-19 had erupted and US schools had closed, and teachers turned to Remind at scales we had never seen.  Teachers have relied on Remind for ten years, and now they needed Remind more than ever.</p>\n\n<p>On Monday 16 Mar 2020, you were all up at 0500 PT, in the dark.  Services crashed, and you fixed the error, and moved on to the next crash.  You partnered to tackle really tough fixes.  Load kept climbing, you felt the sense of panic and fear as it continued to climb all morning.  It did not abate until 1500 PT that day.</p>\n\n<p>And you did it again Tuesday.  And on Wednesday, when I received that Word doc.  And Thursday, and Friday of that week.</p>\n\n<p>You su","link":"http://engineering.remind.com/dear-team/","owner":"Remind"},{"title":"Automatic Multi-Step Code Migrations with Nx","description":"<div class=\"article-intro\">\r\n    Apart from the framework itself, one outcome from Google&rsquo;s Angular team is for sure the tooling. One important tooling feature is the ability to automatically upgrade Angular codebases across breaking changes. Let&rsquo;s see how that works and why it is important.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/nd_fnCy81pI\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/nd_fnCy81pI/","owner":"Juri Strumpflohner"},{"title":"Developing a Side-Scrolling Platformer Game with Unity and MongoDB Realm","description":"\n                    <p>I&rsquo;ve been a gamer since the 1990s, so 2D side-scrolling platformer games like Super Mario Bros. hold a certain place in my heart. Today, 2D games are still being created, but with the benefit of having connectivity to the internet, whether that be to store your player state information, to access new levels, or something else.</p>\n<p>Every year, MongoDB holds an internal company-wide hackathon known as Skunkworks. During Skunkworks, teams are created and using our skills and imagination, we create something to make MongoDB better or something that uses MongoDB in a neat way. For Skunkworks 2020, I (<a href=\"https://www.nraboy.com/\">Nic Raboy</a>) teamed up with Barry O&rsquo;Neill to create a side-scrolling platformer game with Unity that queries and sends data between MongoDB and the game. Internally, this project was known as The Untitled Leafy Game.</p>\n<p>In this tutorial, we&rsquo;re going to see what went into creating a game like <a href=\"https://gi","link":"https://www.thepolyglotdeveloper.com/2021/01/developing-side-scrolling-platformer-game-unity-mongodb-realm/","owner":"Nic Raboy"},{"title":"How to Implement Receipt Data Extraction with OCR, Regex and AI","description":null,"link":"https://code.oursky.com/how-to-implement-receipt-data-extraction-ocr-regex-ai/","owner":"Oursky"},{"title":"Imgur x Black Girls CODE","description":"In 2020, Imgur committed to donating $1,000,000 of advertising space to non-profit organizations that focus on racial justice issues. Black Girls CODE was our first partner in this important endeavor,...","link":"https://blog.imgur.com/2021/01/07/imgur-x-black-girls-code/","owner":"Imgur"},{"title":"MapLibre: Mapbox GL open-source fork","description":"\n          <img src=\"https://www.maptiler.com/media/2021-01-08-mapbox-gl-open-source-fork-1.png\"\n          alt=\"Thumb\">\n          <p>After Mapbox announced the closure of Mapbox GL JS, their JavaScript library for displaying maps using WebGL, the community made a collective decision to maintain and further develop the last open-source version and build a free alternative. Read the story and technical details.</p>\n\n<h2 id=\"maplibre-is-born\">MapLibre is born</h2>\n<p>In December 2020, Mapbox released the second version of their JavaScript library for publishing maps online. However, this time all the new features were overshadowed by a change in the license: previously free as a freedom, it became closed for external contributors and usage was restricted to people with active Mapbox subscriptions. One have to pay even for loading this JavaScript library.</p>\n\n<p>The community reacted swiftly: forks of the latest open-source version were made almost immediately by multiple parties. In anot","link":"https://www.maptiler.com/news/2021/01/mapbox-gl-open-source-fork/","owner":"MapTiler"},{"title":"Turning the Data Firehose on Splunk","description":"","link":"https://medium.com/feedzaitech/turning-the-data-firehose-on-splunk-2dcca6da8aaf?source=rss----e11168e7fe6b---4","owner":"Feedzai"}]