[{"title":"10 Utility Functions for Working with Objects in JavaScript","description":null,"link":"https://medium.com/dailyjs/10-utility-functions-for-working-with-objects-in-javascript-a5ee53ef8809?source=rss----f5105b08f43a---4","owner":"Daily JS"},{"title":"Block Aggregator: Real-time Data Ingestion from Kafka to ClickHouse with Deterministic Retries","description":null,"link":"https://tech.ebayinc.com/engineering/block-aggregator-real-time-data-ingestion-from-kafka-to-clickhouse-with-deterministic-retries/","owner":"Ebay"},{"title":"Changes to Docker Hub Autobuilds","description":null,"link":"https://www.docker.com/blog/changes-to-docker-hub-autobuilds/","owner":"Docker"},{"title":"CodeSOD: Are You Active Enough?","description":"<p><strong>Cornelius</strong> was working with some code where the objects might be &#34;active&#34; or &#34;inactive&#34;. His code needed to do something <em>different</em>, depending on whether the objects were &#34;active&#34; or not, but fortunately, there was a handy-dandy <code>IsActive</code> method. <em>Weirdly</em>, that method required a <code>bool</code> parameter, but also returned a <code>bool</code>. Since there wasn&#39;t any useful documentation, Cornelius checked the C++ code.</p>\r\n<pre><code class=\"language-cplusplus\"><code><div>    bool SomeActivatedClass::IsActive(bool&amp; active)\r\n    {\r\n        active = true;\r\n        return false;\r\n    }\r\n</div></code></code></pre>\r\n<p>This method leaves the choice of whether or not the object <code>IsActive</code> up to the caller. If you check the value in the pass-by-reference parameter, it will <em>always</em> be <code>true</code>. If you check the return value, it will always be <code>false</code>.</p>\r\n<p>This method is, ","link":"https://thedailywtf.com/articles/are-you-active-enough","owner":"The Daily WTF"},{"title":"Everything You Ever Wanted to Know About Session Management in Node.js","description":"<p>Session Management is a pretty scary term for a lot of developers.  Most of the mechanics of session management are abstracted away from developers, to the point where they don’t properly learn about it until it’s necessary.  Usually, this means a late night trying to figure out a vulnerability, a bug, or how to work with a new session management library.  Hopefully, I can remove some of the magic behind session management in NodeJs and give you a good fundamental place to start.  In this article, you will learn what sessions are, how to manage them in Node.js, and some details that should help you minimize bugs and vulnerabilities.</p>\n\n<h2 id=\"overview-of-sessions\">Overview of Sessions</h2>\n\n<p>I will start at the beginning.  When a user uses your web application, they make an HTTP request to the webserver.  The server then knows what to do with this request and returns a response.  The user’s request must contain all the necessary information for the server to make a decision.  F","link":"https://developer.okta.com/blog/2021/06/07/session-mgmt-node","owner":"Okta"},{"title":"How to size your projects for Red Hat's single sign-on technology","description":"<p><a href=\"https://access.redhat.com/products/red-hat-single-sign-on\">Red Hat's single sign-on (SSO) technology</a> is an identity and access management tool included in the Red Hat Middleware Core Services Collection that's based on the well-known <a href=\"https://www.keycloak.org/\">Keycloak</a> open source project. As with other Red Hat products, users have to acquire subscriptions, which are priced according to the number of cores or vCPU used to deploy the product.</p>\n\n<p>This presents an interesting problem for pre-sales engineers like me. To help my customers acquire the correct number of subscriptions, I need to sketch the target architecture and count how many cores they need. This would not be a problem if off-the-shelf performance benchmarks were available; however, they are not.</p>\n\n<p>This article will help colleagues and customers estimate their SSO projects more precisely. We will examine the performance benchmarks I ran, how I designed them, the results I gathered, an","link":"https://developers.redhat.com/articles/2021/06/07/how-size-your-projects-red-hats-single-sign-technology","owner":"Red Hat"},{"title":"How to Store Unlimited* Data in the Browser with IndexedDB","description":"\n            ","link":"https://www.sitepoint.com/indexeddb-store-unlimited-data/?utm_source=rss","owner":"SitePoint"},{"title":"How to update Grub configuration on CentOS server","description":"Simply update Grub on CentOS server. Inspect Grub defaults. $ cat /etc/default/grub GRUB_TIMEOUT=1 GRUB_DISTRIBUTOR=\"$(sed 's, release .*$,,g' /etc/system-release)\" GRUB_DEFAULT=saved GRUB_DISABLE_SUBMENU=true GRUB_TERMINAL_OUTPUT=\"console\" GRUB_CMDLINE_LINUX=\"no_timer_check console=tty0 console=ttyS0,115200n8 net.ifnames=0 biosdevname=0 elevator=noop crashkernel=auto\" GRUB_DISABLE_RECOVERY=\"true\" Determine the exact location of the configuration file. $ sudo readlink -e /etc/grub2.cfg /boot/grub2/grub.cfg Update the Grub configuration. $ sudo grub2-mkconfig --output /boot/grub2/grub.cfg Generating grub configuration […]","link":"https://sleeplessbeastie.eu/2021/06/07/how-to-update-grub-configuration-on-centos-server/","owner":"Milosz Galazka"},{"title":"I will be moving to the Netherlands","description":"<p>I had been planning a move to the Netherlands for a while, at least until a\nlarge COVID-shaped wrench was thrown into the gears. However, I was fully\nvaccinated by early April, and there are signs of the border opening up now, so\nmy plans have been slowly getting back on track. I sent off my visa application\ntoday, and assuming I can navigate the pandemic-modified procedures, I should be\nable to make my move fairly soon. It&rsquo;s a little bit intimidating, but I am\nlooking forward to it!</p>\n<p><em>Quick note: I am looking for temporary housing in NL; somewhere I can stay for\n6-12 months with a permanent mailing address for receiving immigration-related\ndocuments. I would prefer to rent out a room than to use some kind of commercial\naccommodation, to be certain that I can receive mail from the immigration\nservices for the duration of the process. <a href=\"mailto:sir@cmpwn.com\">Please shoot me an email</a> if\nyou&rsquo;ve got a lead! I&rsquo;d rather meet someone through the FOSS c","link":"https://drewdevault.com/2021/06/07/The-Netherlands.html","owner":"Drew DeVault"},{"title":"Is Progressive Delivery Just Continuous Delivery with Feature Flags?","description":"If something goes wrong, anyone (a developer or otherwise) can turn off the associated flag and revert back immediately. If your organization has established an efficient CI/CD pipeline and you’ve made a successful transition to DevOps culture, you probably already understand the benefits of doing DevOps. With more frequent releases that introduce smaller incremental changes, developers can also reduce the chances of things going wrong in production.","link":"https://www.cloudbees.com/blog/progressive-delivery-vs-continuous-delivery","owner":"CloudBees"},{"title":"Jenkins Cluster Hosting for Continuous Integration and Delivery (CI/CD)","description":null,"link":"https://www.rosehosting.com/blog/jenkins-cluster-hosting-for-continuous-integration-delivery-ci-cd/","owner":"RoseHosting"},{"title":"Measuring training and development programs: What healthcare organizations need to know","description":"","link":"https://www.surveymonkey.com/curiosity/measuring-training-and-development-programs-what-healthcare-organizations-need-to-know/?ut_source=rss","owner":"SurveyMonkey"},{"title":"Modernizing Business Data Indexing","description":"On the Yelp app and website, there are many occasions where we need to show detailed business information. We refer to this process as Data Hydration, filling out a “dry” business with compelling, rich data. Whether on the home screen, search results page or business details page, there is a large set of properties we may show about any given business, everything from name and address to photos, Verified Licenses, insights, and more. These properties are stored in a variety of different databases, and their display is subject to a significant amount of filtering and transformation logic. All of this...","link":"https://engineeringblog.yelp.com/2021/06/modernizing-business-data-indexing.html","owner":"Yelp"},{"title":"Nearshoring in DACH – trends and predictions","description":"Digitalisation and globalisation are increasingly forcing the optimisation of conventional corporate management strategies. It is particularly seen in the IT sector where companies are increasingly deciding to outsource entire company processes and leave their handling to IT partners.","link":"https://www.future-processing.com/blog/nearshoring-in-dach-trends-and-predictions/","owner":"Future Processing"},{"title":"Python parameters primer","description":null,"link":"https://lerner.co.il/2021/06/07/python-parameters-primer/","owner":"Lerner Consulting Blog"},{"title":"Python's itertools – count(), cycle() and chain()","description":"In this tutorial, we'll be taking a look at the `itertools` module in Python - and take a look at examples of count(), cycle() and eval().","link":"https://stackabuse.com/pythons-itertools-count-cycle-and-chain","owner":"Stack Abuse"},{"title":"Rediscovering Polari: How This Gay Dialect Is A Map Of Forgotten Subcultures","description":null,"link":"https://www.babbel.com/en/magazine/polaris-etymology","owner":"Babbel"},{"title":"Rediscovering Polari: How This Secret Gay Language Helped Create LGBT Culture","description":null,"link":"https://www.babbel.com/en/magazine/culture-of-polari","owner":"Babbel"},{"title":"Rediscovering Polari: What Is Polari And Why Did It Die Out?","description":null,"link":"https://www.babbel.com/en/magazine/what-is-polari","owner":"Babbel"},{"title":"Say Hello to the Inertia Head Component","description":"\n                                    ","link":"https://laravel-news.com/inertia-js-head-component","owner":"Laravel"},{"title":"Seeing Like the Market – Jun 6, 2021","description":"The market’s opinion this week: fossil fuels might yet kill us all, but that doesn’t mean it’s not a great...","link":"https://blog.rinesi.com/2021/06/seeing-like-the-market-jun-6-2021/","owner":"Marcelo Rinesi"},{"title":"Service Credit Union ensures COVID-safe workplaces using SurveyMonkey Enterprise","description":"","link":"https://www.surveymonkey.com/curiosity/service-credit-union-ensures-covid-safe-workplaces-using-surveymonkey-enterprise/?ut_source=rss","owner":"SurveyMonkey"},{"title":"The ARM processor (Thumb-2), part 6: The lie hiding inside the CMN instruction","description":null,"link":"https://devblogs.microsoft.com/oldnewthing/20210607-00/?p=105288","owner":"Raymond Chen"},{"title":"Three Myths About Value Stream Management, Busted","description":"In this way, VSM tools can help business leaders justify the expense of training, process changes, new headcount etc. We’ll need to invent better value stream management tools to prevent people from unfairly blaming coworkers. MYTH 2: VALUE STREAM MANAGEMENT RESULTS IN FINGER-POINTING AND TREATING DEVELOPERS LIKE COGS There are some who argue that value stream management gives stakeholders across the company in every department too much visibility into how software teams are performing. Value stream management approaches have also been accused of turning software delivery into a factory assembly line, where developers lack autonomy and end up hating their job.","link":"https://www.cloudbees.com/blog/three-myths-about-value-stream-management-busted","owner":"CloudBees"},{"title":"Tilling AI: Startup Digs into Autonomous Electric Tractors for Organics","description":null,"link":"https://blogs.nvidia.com/blog/2021/06/07/startup-digs-into-autonomous-electric-tractors-for-organics/","owner":"Nvidia"},{"title":"What is new in Cloudera Streaming Analytics 1.4?","description":null,"link":"https://blog.cloudera.com/what-is-new-in-cloudera-streaming-analytics-1-4/","owner":"Cloudera"},{"title":"What’s new in News – May 29, 2021 to Jun 6, 2021","description":"New in news this week: Israeli politics gets hairy in a new way, while the International Tennis Federation are insensitive...","link":"https://blog.rinesi.com/2021/06/whats-new-in-news-may-29-2021-to-jun-6-2021/","owner":"Marcelo Rinesi"}]