[{"title":"Clojure Core","description":"Earlier today Rich Hickey let the cat out of the bag that I’m joining the Clojure Core development team. We are excited to welcome @fogus, long-time Clojure contributor and co-author of Joy of Clojure, to the Clojure core team!— Rich Hickey (@richhickey) January 15, 2021 This is a change from my previous relationship with the […]","link":"http://blog.fogus.me/2021/01/15/clojure-core/","owner":"Mike Fogus"},{"title":"Extending the new WinDbg, Part 3 — Embedding a C# interpreter","description":"","link":"https://medium.com/criteo-engineering/extending-the-new-windbg-part-3-embedding-a-c-interpreter-c362b844208a?source=rss----fc3ea5a64a12---4","owner":"Criteo"},{"title":"GCP Outpaces Azure, AWS in the 2021 Cloud Report","description":"The 2021 Cloud Report stands on benchmarks. Now in its third year, our report is more precise than ever, capturing an evaluation of Amazon Web Services (AWS), Microsoft Azure (Azure), and Google Cloud Platform (GCP) that tells realistic and universal performance stories on behalf of mission-critical OLTP applications.\nOur intention is to help our customers and any builder of OLTP applications understand the performance tradeoffs present within each cloud and within each cloud&rsquo;s individual machines.","link":"https://www.cockroachlabs.com/blog/2021-cloud-report/","owner":"CockroachDB"},{"title":"Google Brain's Jax and Flax","description":"<p >Google's AI division, Google Brain, has two main products for deep learning: TensorFlow and Jax.  While TensorFlow is best known, Jax can be thought of as a higher-level language for specifying deep learning algorithms while automatically eliding code that doesn't need to run as part of the model.</p>\n<p ><a href=\"https://github.com/google/jax\">Jax</a> evolved from Autograd, and is a combination of Autograd and <a href=\"https://www.tensorflow.org/xla\">XLA</a>.  Autograd \"can automatically differentiate native Python and Numpy code. It can handle a large subset of Python's features, including loops, ifs, recursion and closures, and it can even take derivatives of derivatives of derivatives. It supports reverse-mode differentiation (a.k.a. backpropagation), which means it can efficiently take gradients of scalar-valued functions with respect to array-valued arguments, as well as forward-mode differentiation, and the two can be composed arbitrarily. The main intended application of Au","link":"http://lambda-the-ultimate.org/google-brain-jax","owner":"Lambda the Ultimate"},{"title":"Understanding Envoy Rate Limits","description":"Envoy rate limits is a fairly complex system, built using multiple components. While there are many articles on the Internet explaining basic setup and how each component works, we weren’t able to find something that explains how each component works end-to-end in simple terms. That’s why we’ve created this blog...  ","link":"https://tech.wayfair.com/2021/01/understanding-envoy-rate-limits/","owner":"Wayfair"},{"title":"Upgrading to React 17: How to Fix the Issues and Breaking Changes","description":null,"link":"https://eng.wealthfront.com/2021/01/14/upgrading-to-react-17-how-to-fix-the-issues-and-breaking-changes/","owner":"Wealthfront"},{"title":"Welcome New Marketplace Partner Program Partners","description":null,"link":"https://blog.developer.atlassian.com/welcome-new-marketplace-partner-program-partners/","owner":"Atlassian"}]