[{"title":"An in-depth guide on the CSS position property","description":null,"link":"https://soshace.com/an-in-depth-guide-on-the-css-position-property/","owner":"Soshace"},{"title":"Create a Retro Gaming Handheld with a Raspberry Pi Zero and the Retroflag GPi Case","description":"\n                    <p>I&rsquo;m a huge <a href=\"https://www.raspberrypi.org/\">Raspberry Pi</a> advocate and own more of them than any single person should own. They are cheap, moderately powerful, and are useful for quite a few circumstances.</p>\n<p>In a previous tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/09/emulate-classic-video-games-raspberry-pi-zero-retropie/\">Emulate Classic Video Games On A Raspberry Pi Zero With RetroPie</a>, I demonstrated how to repurpose an old Raspberry Pi Zero to be a gaming console about the size of an Amazon Fire Stick. For $5.00 to $10.00, these devices make retro gaming possible with little setup involved.</p>\n<p>Recently, my buddy <a href=\"https://twitter.com/judy2k\">Mark Smith</a> told me about the <a href=\"http://retroflag.com/GPi-CASE.html\">Retroflag GPi</a> case, a case with a screen, speaker, and all the expectations of a handheld. This thing looks just like a classic Nintendo Gameboy, but has better hardware and is powe","link":"https://www.thepolyglotdeveloper.com/2021/02/create-retro-gaming-handheld-raspberry-pi-zero-retroflag-gpi-case/","owner":"Nic Raboy"},{"title":"Creating Directionally Lit 3D Buttons with CSS","description":"\n            ","link":"https://www.sitepoint.com/creating-directionally-lit-3d-buttons-with-css/?utm_source=rss","owner":"SitePoint"},{"title":"Designing a Custom Progress bar with timed breaks in Android","description":"","link":"https://tech.olx.com/designing-a-custom-progress-bar-with-timed-breaks-in-android-2937bb4d4f0f?source=rss----761b019b483f---4","owner":"OLX"},{"title":"Learn Snowpack: A High-Performance Frontend Build Tool","description":"\n            ","link":"https://www.sitepoint.com/learn-snowpack/?utm_source=rss","owner":"SitePoint"},{"title":"Simulating Latency with SQL / JDBC","description":"I’ve run across a fun little trick to simulate latency in your development environments when testing some SQL queries. Possible use-cases including to validate that backend latency won’t bring down your frontend, or that your UX is still bearable, etc. The solution is PostgreSQL and Hibernate specific, though to doesn’t have to be. Besides, it … ","link":"https://blog.jooq.org/2021/02/15/simulating-latency-with-sql-jdbc/","owner":"jOOQ"}]