[{"title":"A Day in the Life","description":"<p>Welcome to the latest post in our ‘Day in the Life’ blog series, in which product and engineering’s digital coordinator, Rasha Ardati, interviews a colleague from the department to reflect on their career and experiences at the Guardian</p><p>This week I’m introducing you to my colleague Rebecca Thompson, a software developer at the Guardian. She likes to use the term ‘career switcher’ because Rebecca previously had a career in adventure travel and marketing; working for tour operators in Africa and South America. It was during this time she managed a team of developers, which made her decide to pursue a career in product and engineering.</p><p><strong>Rebecca, how did you make the switch from travel to coding?</strong></p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguardian.com/info/2021/feb/12/a-day-in-the-life\">Continue reading...</a>","link":"https://www.theguardian.com/info/2021/feb/12/a-day-in-the-life","owner":"Guardian"},{"title":"A Dynamic Journey to Performance","description":"Excitement buzzed in the virtual air -- after multiple years of work, we were finally going live! As we ramped up our feature toggle, we were met with words no engineer wants to hear: “Your service isn’t performing fast enough. We need you to toggle off.” Our team quickly pivoted...  ","link":"https://tech.wayfair.com/2021/02/a-dynamic-journey-to-performance/","owner":"Wayfair"},{"title":"Improved Backup & Restore Capabilities in Distributed Database","description":"CockroachDB is designed to deliver bulletproof resilience. But even the world’s safest boat needs to carry life jackets. The same principle applies to your data, which is why we’ve baked a breadth of Backup and Restore capabilities into CockroachDB.\nMoving Backup &amp; Restore into the Free, Open Source Version of CockroachDB\nSince this blog was originally published there has been one massive change to our backup &amp; restore functionality - we moved it into open source.","link":"https://www.cockroachlabs.com/blog/backup-restore/","owner":"CockroachDB"},{"title":"Running AutoPkg in Github Actions","description":null,"link":"https://engineering.gusto.com/running-autopkg-in-github-actions/","owner":"Gusto"},{"title":"Zoe's First Month","description":null,"link":"https://devblog.kogan.com/blog/zoes-first-month","owner":"Kogan.com"}]