[{"title":"2021 PC Build List","description":null,"link":"https://elegantcode.com/2021/02/08/2021-pc-build-list/","owner":"Elegant Code"},{"title":"Build a Rest API for the Jamstack with Hapi and TypeScript","description":"\n            ","link":"https://www.sitepoint.com/jamstack-rest-api-hapi/?utm_source=rss","owner":"SitePoint"},{"title":"Global Financial Data Firm's Database Migration from Oracle to CockroachDB","description":"A global financial data firm migrated off its legacy Oracle infrastructure, creating a single hybrid, geo-partitioned deployment of CockroachDB. Frustrated by its legacy Oracle database architecture, a major American financial data firm wanted to consolidate its legacy databases and migrate to public cloud infrastructure. Through numerous acquisitions and organic growth, the firm had accumulated a multitude of Oracle databases and application platforms spread across the U.S., Canada, Australia, and Europe. They wanted to consolidate this infrastructure into a single platform and migrate many of their applications to the cloud.","link":"https://www.cockroachlabs.com/blog/global-financial-data-firm-migrates-off-oracle-to-cockroachdb/","owner":"CockroachDB"},{"title":"Implementing a generic REDUCE aggregate function with SQL","description":"So, @rotnroll666 nerd sniped me again. Apparently, the Neo4j Cypher query language supports arbitrary reductions, just like any functional collection API, oh say, the JDK Stream API: SQL doesn’t have this, yet it would be very useful to be able to occasionally do that. An arbitrary reduction can be implemented “easily” in SQL. Let’s look … ","link":"https://blog.jooq.org/2021/02/08/implementing-a-generic-reduce-aggregate-function-with-sql/","owner":"jOOQ"},{"title":"The ants and the pheromones","description":"I’m super excited about the new chapter emerging in our research on a programmable cloud. This is what comes after serverless, people. In this thread, a few recent talks/papers on the vision. First off — 10 minute pitch from CIDR is here. https://t.co/fEMboOGF7Q — Joe Hellerstein (@joe_hellerstein) January 28, 2021","link":"https://blog.acolyer.org/2021/02/08/the-ants-and-the-pheromones/","owner":"Adrian Colyer"},{"title":"Using COD and CML to build applications that predict stock data","description":null,"link":"https://blog.cloudera.com/using-cod-and-cml-to-build-applications-that-predict-stock-data/","owner":"Cloudera"}]