[{"title":"Celebrating Martin Luther King, Jr.’s Leadership and Values","description":"","link":"https://www.singlestore.com/blog/celebrating-martin-luther-king-jr-s-leadership-and-values","owner":"MemSQL"},{"title":"Getting Started with Laravel Livewire","description":"\n            ","link":"https://www.sitepoint.com/vs-code-react-development/?utm_source=rss","owner":"SitePoint"},{"title":"Grab ETW Session, Providers and Events","description":"","link":"https://medium.com/criteo-engineering/grab-etw-session-providers-and-events-516ee5396a86?source=rss----fc3ea5a64a12---4","owner":"Criteo"},{"title":"How to beat !dumpheap -stat?… with ClrMD","description":"","link":"https://medium.com/criteo-engineering/how-to-beat-dumpheap-stat-with-clrmd-141d88faf65d?source=rss----fc3ea5a64a12---4","owner":"Criteo"},{"title":"Log and Error Redaction in CockroachDB v20.2","description":"CockroachDB users trust us with their most sensitive data (see: healthcare, finance). And the best way for us to maintain that trust is for Cockroach Labs to never see this data at all.\nIn CockroachDB v20.2, our tooling is able to automatically redact users' sensitive data out of log files, so that Cockroach Labs never even receives it. We also do this always for crash report telemetry. Data sharing in CockroachDB deployments In the default configuration, CockroachDB automatically sends anonymized telemetry data at periodic intervals to Cockroach Labs (see here to turn off diagnostics reporting).","link":"https://www.cockroachlabs.com/blog/log-and-error-redaction-in-cockroachdb-v20-2/","owner":"CockroachDB"},{"title":"Monitor Finalizers, contention and threads in your application","description":"","link":"https://medium.com/criteo-engineering/monitor-finalizers-contention-and-threads-in-your-application-91b3db798958?source=rss----fc3ea5a64a12---4","owner":"Criteo"},{"title":"The GrabMart Journey","description":"<p>Grab is Southeast Asia’s leading superapp, providing everyday services such as ride-hailing, food delivery, payments, and more. In this blog, we’d like to share our journey in discovering the need for GrabMart and coming together as a team to build it.</p>\n\n<h2 id=\"being-there-in-the-time-of-need\">Being There in the Time of Need</h2>\n\n<p>Back in March 2020, as the COVID-19 pandemic was getting increasingly widespread in Southeast Asia, people began to feel the pressing threat of the virus in carrying out their everyday activities. As social distancing restrictions tightened across Southeast Asia, consumers’ reliance on online shopping and delivery services also grew.</p>\n\n<p>Given the ability of our systems to readily adapt to changes, we were able to introduce a new service that our consumers needed - GrabMart. By leveraging the GrabFood platform and quickly onboarding retail partners, we can now provide consumers with their daily essentials on-demand, within a one hour delivery wi","link":"https://engineering.grab.com/grabmart-product-team-experience","owner":"Grab"}]