[{"title":"A deeper dive into our May 2019 security incident","description":null,"link":"https://stackoverflow.blog/2021/01/25/a-deeper-dive-into-our-may-2019-security-incident/","owner":"Stack Overflow"},{"title":"How Retailers Can Achieve 2021 Revenue Resolutions with CockroachDB","description":"It’s 2021 and the in-store shopping experience is still on pause with many stores shutting their doors forever. Online shopping is no longer the future of retail, but the new reality of retail. On average, ecommerce sales grew 32.4% year-over-year with some retailers (Best Buy, Target) seeing over 100% growth. 2020 forced retailers to rethink the way they do business and the way they reach their customers. Smaller businesses were forced to take their sales online, while larger businesses needed to find new, creative ways to stay ahead of the growing ecommerce competition.","link":"https://www.cockroachlabs.com/blog/retail-resolutions/","owner":"CockroachDB"},{"title":"How to Use WordPress as a Headless CMS for Eleventy","description":"\n            ","link":"https://www.sitepoint.com/rollup-javascript-bundler-introduction/?utm_source=rss","owner":"SitePoint"},{"title":"Keeping up the Open Source promise for 2021","description":"COVID-19 has impacted the travel industry very severely. Even in these hard times, trivago remains committed to contributing to open source. As a tech company working on large-scale projects, we feel a responsibility towards supporting the open source community.\nwebpack, Preact and the CNCF This year we will continue supporting projects and organisations that are having a major impact on the products we build and the happiness of our engineers who use them on a daily basis.","link":"https://tech.trivago.com/2021/01/25/keeping-up-the-open-source-promise-for-2021/","owner":"Trivago"},{"title":"Making history: insights from inside a genealogy product team","description":"<p><img src=\"../images/labyrinth.jpg\" alt=\"labyrinth\" /></p>\n\n<p>Every product person is usually on a mission to use insights, research, and tech to make something better for users. At Findmypast, our users are family history researchers. Here’s how their needs shape our work.</p>\n\n<p><strong>The product value is clear</strong></p>\n\n<p>Genealogy was once a paper-based activity largely practised by experts. Then developments in tech enabled enormous amounts of historical records to be scanned and translated into searchable text that users can access at any time, no matter how far they live from an archive. It saves researchers time, money and breaks down traditional barriers to access which in turn democratises research. This - for me - is an excellent reason to go to work.</p>\n\n<p><strong>The outcomes are stories</strong></p>\n\n<p>Customers’ discoveries are wildly diverse and their missions inadvertently spawn all sorts of subject matter expertise along the way. Users set off looking fo","link":"https://tech.findmypast.com/making-history/","owner":"Findmypast"},{"title":"Mathesis: Elements of Learning and Intelligence","description":null,"link":"https://tech.ebayinc.com/research/mathesis-elements-of-learning-and-intelligence/","owner":"Ebay"},{"title":"Welcoming Open Web Docs to the MDN family","description":null,"link":"https://hacks.mozilla.org/2021/01/welcoming-open-web-docs-to-the-mdn-family/","owner":"Mozilla Hacks"}]