[{"title":"A Simple Laravel Hello World","description":"<p>As of late I've been working in Laravel and figuring out how Laravel differs from Rails.  And while I have a bigger blog post in the works, I thought there was learning value in a simple Hello World implemented in Laravel.  Hello World is a simple program that just puts Hello World on the screen.</p>\n\n<p>Here's how I thought a Laravel version of this should work:</p>\n\n<ul>\n  <li>Be a whole Laravel application</li>\n  <li>Be a single controller</li>\n  <li>Be a single route</li>\n  <li>Define the text \"Hello World\" as a variable, $text, in the controller</li>\n  <li>Display that on the screen via an HTML template</li>\n</ul>\n\n<p>While this doesn't illustrated models and database connectivity, this actually illustrates how to use a surprising amount of an overall MVC framework.</p>\n\n<h2 id=\"step-1-creating-an-application\">Step 1: Creating an Application</h2>\n\n<p>The first step is to use composer to generate the overall application with:</p>\n\n<div class=\"language-plaintext highlighter-rouge","link":"http://fuzzyblog.io/blog/laravel/2021/05/27/a-simple-laravel-hello-world.html","owner":"Scott Johnson"},{"title":"Achieving Team Purpose and Pride with Scrum","description":"Team purpose and pride — my team hit those high marks, but it was a long journey to get there from where we started. At Spotify, we strive for “aligned autonomy” among our teams. Meaning: we align on what it is we set out to do, but preserve flexibility to choose how we’ll achieve those [...]","link":"https://engineering.atspotify.com/2021/05/27/achieving-team-purpose-and-pride-with-scrum/","owner":"Spotify"},{"title":"Adventures In (German) Babysitting","description":null,"link":"https://www.babbel.com/en/magazine/adventures-in-german-babysitting","owner":"Babbel"},{"title":"Announcing automated disk management: Safely managing your cloud database","description":"To close out our final week of “Always Be Launching” month, we are announcing “Automated Full Disk Management” for Timescale Forge, a new capability to ease operational overhead, protect against unforeseen overages, and keep your database up and running. ","link":"https://blog.timescale.com/blog/announcing-automated-disk-management-safely-managing-your-cloud-database/","owner":"Timescale"},{"title":"Announcing the Launch of Delta Live Tables: Reliable Data Engineering Made Easy","description":null,"link":"https://databricks.com/blog/2021/05/27/announcing-the-launch-of-delta-live-tables-reliable-data-engineering-made-easy.html","owner":"Databricks"},{"title":"Boost Security by Auditing Your Privileged Users with SOQL","description":null,"link":"https://developer.salesforce.com/blogs/2021/05/boost-security-by-auditing-your-privileged-users-with-soql.html","owner":"Salesforce"},{"title":"Checking Vulnerabilities in Your Python Code with Bandit","description":"In this article, you will be exploring how to use Bandit - an open source security analyzer for Python projects. Bandits generates reports on vulnerabilities in our code!","link":"https://stackabuse.com/checking-vulnerabilities-in-your-python-code-with-bandit","owner":"Stack Abuse"},{"title":"Chef Product Launches, Roadmaps, and Webinars ohmy!","description":null,"link":"https://blog.chef.io/chef-product-launches-roadmaps-and-webinars-ohmy","owner":"Chef"},{"title":"CodeSOD: A More Functional Approach","description":"<p>In functional programming languages, you&#39;ll frequently see some variation of the <code>car</code>/<code>cdr</code> operations from LISP. Given a list, these functions can split it into the <em>head</em> (or first element) of the list, and the <em>tail</em> (the rest of the list). This is often used to traverse a list recursively: function <code>f</code> performs an operation on the head of the list, and then recursively calls <code>f</code> on the tail of the list.</p>\r\n<p>I bring this up because we&#39;re talking about C# today. C# has plenty of fun functional programming features, and you can certainly use them to write very clean, comprehensible code. Or, like <strong>Nico</strong>&#39;s co-worker, you could do something like this.</p>\r\n<pre><code class=\"language-csharp\"><div><span class=\"hljs-function\"><span class=\"hljs-keyword\">private</span> <span class=\"hljs-keyword\">void</span> <span class=\"hljs-title\">HandleProcessPluginChain</span>(<span class=\"hljs-params\">ProcessMess","link":"https://thedailywtf.com/articles/a-more-functional-approach","owner":"The Daily WTF"},{"title":"Collective #663","description":null,"link":"https://tympanus.net/codrops/collective/collective-663/","owner":"Codrops"},{"title":"Databricks Announces the First Feature Store Co-designed with a Data and MLOps Platform","description":null,"link":"https://databricks.com/blog/2021/05/27/databricks-announces-the-first-feature-store-integrated-with-delta-lake-and-mlflow.html","owner":"Databricks"},{"title":"Dot dot dot","description":"<p>The ol’ ellipses. That punctuation that denotes a pause. If ever there was something that could be used as a placeholder for the past year, the ellipses may fill that void. It marks a transition and leaves unsaid the unspeakable. It represents the digital conversations about to be had, waiting on others to say their piece, waiting on you to say yours—conversations that would be more pleasurable, or at least more palatable, in person. </p>\r\r\n<p>And while I am likely premature in raising my glass to mark an end to this grand pause, I’ll do so anyway. I’ll do so in hopes of the many questions, exclamations, and interrobangs to come. </p><hr><small><a href=\"mailto:snookca@snk.ms\">Reply via email</a></small>","link":"http://snook.ca/archives/personal/dot-dot-dot","owner":"Jonathan Snook"},{"title":"ElasticSearch Driver for Laravel Scout","description":"\n                                    ","link":"https://laravel-news.com/explorer","owner":"Laravel"},{"title":"Getting Started with Amazon ECS Anywhere – Now Generally Available","description":"Since Amazon Elastic Container Service (Amazon ECS) was launched in 2014, AWS has released other options for running Amazon ECS tasks outside of an AWS Region such as AWS Wavelength, an offering for mobile edge devices or AWS Outposts, a service that extends to customers’ environments using hardware owned and fully managed by AWS. But […]","link":"https://aws.amazon.com/blogs/aws/getting-started-with-amazon-ecs-anywhere-now-generally-available/","owner":"AWS"},{"title":"GIPHY Product Spotlight: A/B testing in Search","description":"A/B Testing in Search I joined the Search team in February as their Product Manager after 2 years in the Data Science department. I’ve always admired how the team deeply integrated analytics into the Search algorithm. As I began to ramp up in the role, I spent hours reading all the documentation of the various […]","link":"https://engineering.giphy.com/giphy-product-spotlight-a-b-testing-in-search/","owner":"GIPHY"},{"title":"How can I convert between IANA time zones and Windows registry-based time zones?","description":null,"link":"https://devblogs.microsoft.com/oldnewthing/20210527-00/?p=105255","owner":"Raymond Chen"},{"title":"How to update to newer Red Hat OpenShift 4 releases","description":"<p>This article demonstrates two common scenarios for updating <a href=\"https://developers.redhat.com/products/openshift\">Red Hat OpenShift 4</a>: to a newer z-stream release and to a newer minor release. I include plenty of screenshots of actual updates from 4.5.4 to 4.5.17 and then to 4.6.4, so you know what to expect when you make these updates yourself.</p>\n\n<p>OpenShift 4 makes the update process easy and provides a number of safety features to minimize the risk of a failed outcome. Still, updating OpenShift clusters can be scary the first time. This article shows how two perform typical update scenarios, step-by-step:</p>\n\n<ol><li>Updating between two z-stream releases, from 4.y.z to 4.y.z+d. Note that you can skip z-stream releases during an update.</li>\n\t<li>Updating between two minor releases, from 4.y to 4.y+1. Note that you cannot skip a minor release during an update.</li>\n</ol><h2>To use or not to use the web console</h2>\n\n<p>The update process, including web console pages","link":"https://developers.redhat.com/articles/2021/05/27/how-update-newer-red-hat-openshift-4-releases","owner":"Red Hat"},{"title":"How to Use the ClimaCell API with Python, PHP, Ruby & Javascript Examples","description":null,"link":"https://rapidapi.com/blog/climacell-api-with-python-php-ruby-javascript-examples/","owner":"RapidAPI"},{"title":"Introducing Amazon Kinesis Data Analytics Studio – Quickly Interact with Streaming Data Using SQL, Python, or Scala","description":"The best way to get timely insights and react quickly to new information you receive from your business and your applications is to analyze streaming data. This is data that must usually be processed sequentially and incrementally on a record-by-record basis or over sliding time windows, and can be used for a variety of analytics […]","link":"https://aws.amazon.com/blogs/aws/introducing-amazon-kinesis-data-analytics-studio-quickly-interact-with-streaming-data-using-sql-python-or-scala/","owner":"AWS"},{"title":"Introducing Databricks AutoML: A Glass Box Approach to Automating Machine Learning Development","description":null,"link":"https://databricks.com/blog/2021/05/27/introducing-databricks-automl-a-glass-box-approach-to-automating-machine-learning-development.html","owner":"Databricks"},{"title":"Introducing Databricks Machine Learning: a Data-native, Collaborative, Full ML Lifecycle Solution","description":null,"link":"https://databricks.com/blog/2021/05/27/introducing-databricks-machine-learning-a-data-native-collaborative-full-ml-lifecycle-solution.html","owner":"Databricks"},{"title":"Introducing Lyft Engineering: Kyiv!","description":"","link":"https://eng.lyft.com/introducing-lyft-engineering-kyiv-2884d1bba69a?source=rss----25cd379abb8---4","owner":"Lyft"},{"title":"iOS Passwordless Chat Application with Auth0","description":"Build an iOS chat application that uses Auth0’s passwordless features for authentication","link":"https://auth0.com/blog/ios-passwordless-chat-application-with-auth0/","owner":"Auth0"},{"title":"Kubernetes: challenges and opportunities for DevOps","description":"In the case of large-scaled containerised applications, the benefits offered by Kubernetes are unmatched. But the path of its adaptation isn't always clear. Yet, in order to make it less complicated we present 7 principles that will allow you to easily plan and deploy containers, as well as, scale them to the desired state, and manage their lifecycle. ","link":"https://www.future-processing.com/blog/kubernetes-challenges-and-opportunities-for-devops/","owner":"Future Processing"},{"title":"Marbles RTX Playable Sample Now Available in NVIDIA Omniverse","description":null,"link":"https://blogs.nvidia.com/blog/2021/05/27/omniverse-marbles-rtx-playable-sample/","owner":"Nvidia"},{"title":"Muscle Recovery: 8 Tips for a Faster Recovery after Exercise","description":null,"link":"https://www.runtastic.com/blog/en/learn-how-to-speed-up-your-recovery-with-these-8-tips/","owner":"Runtastic"},{"title":"Name Dropping: Lindsey Bleimes, VP of Engineering, Nubank","description":"<div class=\"hs-featured-image-wrapper\"> \r\n <a href=\"https://product.hubspot.com/blog/name-dropping-lindsey-bleimes-vp-of-engineering-nubank\" title=\"\" class=\"hs-featured-image-link\"> <img src=\"https://product.hubspot.com/hubfs/Name%20Dropping%20%289%29.png\" alt=\"Name Dropping: Lindsey Bleimes, VP of Engineering, Nubank\" class=\"hs-featured-image\" style=\"width:auto !important; max-width:50%; float:left; margin:0 15px 15px 0;\"> </a> \r\n</div>    \r\n<p><strong><em>Name Dropping is a Q&amp;A series that aims to elevate the stories of women and nonbinary people leading in the tech space. The idea came from Angela DeFranco, a VP of Product at HubSpot, who said one way to be better allies is to name drop more women and nonbinary people in discussions of achievement, inspiration, and disruptors in tech, instead of referencing, time and again, the same set of (often male) leaders.</em></strong></p>","link":"https://product.hubspot.com/blog/name-dropping-lindsey-bleimes-vp-of-engineering-nubank","owner":"HubSpot"},{"title":"Navigating the Evolving Alternative Payments Ecosystem","description":null,"link":"https://blog.sift.com/2021/navigating-the-evolving-alternative-payments-ecosystem/?utm_source=rss&utm_medium=rss&utm_campaign=navigating-the-evolving-alternative-payments-ecosystem","owner":"Sift Science"},{"title":"Need for Speed: Researchers Switch on World’s Fastest AI Supercomputer","description":null,"link":"https://blogs.nvidia.com/blog/2021/05/27/nersc-perlmutter-ai-supercomputer/","owner":"Nvidia"},{"title":"Nginx setup for your (CakePHP) apps","description":"Quite some time ago, I linked already to the cakephp-config-for-nginx/ blog post. And my post about Apache setup is also now almost 10 years old. It is time to update also my blog about the latest configuration here, and in...","link":"https://www.dereuromark.de/2021/05/27/nginx-setup-for-your-cakephp-apps/","owner":"Dereuromark"},{"title":"Nine Highlights from the Kotlin Roadmap","description":"Many of you want to know about Kotlin’s future and what lies ahead. We often talk about the upcoming new compiler, focus on tooling quality and performance, and server-side and KMM experience, but the talks usually don’t give the full picture.  If you want to stay up to date and follow all of the team’s […]","link":"https://blog.jetbrains.com/kotlin/2021/05/nine-highlights-from-the-kotlin-roadmap/","owner":"Kotlin"},{"title":"RocksDB Secondary Cache","description":"<h2 id=\"introduction\">Introduction</h2>\n\n<p>The RocksDB team is implementing support for a block cache on non-volatile media, such as a local flash device or NVM/SCM. It can be viewed as an extension of RocksDB’s current volatile block cache (LRUCache or ClockCache). The non-volatile block cache acts as a second tier cache that contains blocks evicted from the volatile cache. Those blocks are then promoted to the volatile cache as they become hotter due to access.</p>\n\n<p>This feature is meant for cases where the DB is located on remote storage or cloud storage. The non-volatile cache is officially referred to in RocksDB as the SecondaryCache. By maintaining a SecondaryCache that’s an order of magnitude larger than DRAM, fewer reads would be required from remote storage, thus reducing read latency as well as network bandwidth consumption.</p>\n\n<p>From the user point of view, the local flash cache will support the following requirements -</p>\n\n<ol>\n  <li>Provide a pointer to a secondary","link":"http://rocksdb.org/blog/2021/05/27/rocksdb-secondary-cache.html","owner":"RocksDB"},{"title":"SurveyMonkey Market Research Solutions Pulse: Gen Z and Stock Trading","description":"","link":"https://www.surveymonkey.com/curiosity/surveymonkey-market-research-gen-z-and-stock-trading/?ut_source=rss","owner":"SurveyMonkey"},{"title":"Switching Production DB Seamlessly from RDS to Aurora MySQL with TBs of Data","description":"","link":"https://medium.com/expedia-group-tech/switching-production-db-seamlessly-from-rds-to-aurora-mysql-with-tbs-of-data-afe5aa0a2305?source=rss----38998a53046f---4","owner":"Expedia"},{"title":"Tackling healthcare worker burnout: Using feedback to improve employee wellbeing","description":"","link":"https://www.surveymonkey.com/curiosity/tackling-healthcare-worker-burnout-using-feedback-to-refine-policies/?ut_source=rss","owner":"SurveyMonkey"},{"title":"The Roaring 20+: GFN Thursday Game Releases Include Biomutant, Maneater, Warhammer Age of Sigmar: Storm Ground and More","description":null,"link":"https://blogs.nvidia.com/blog/2021/05/27/geforce-now-thursday-may-27/","owner":"Nvidia"},{"title":"Today Is The Day!","description":null,"link":"https://www.docker.com/blog/today-is-the-day/","owner":"Docker"},{"title":"What’s the Difference Between REST and RESTful?","description":null,"link":"https://nordicapis.com/whats-the-difference-between-rest-and-restful/","owner":"Nordic APIs"},{"title":"Why Elasticsearch is an indispensable component of the Adyen stack","description":null,"link":"https://www.elastic.co/blog/why-elasticsearch-is-an-indispensable-component-of-the-adyen-stack","owner":"Elastic"}]