[{"title":"Cloudera Flow Management Continuous Delivery Architecture","description":null,"link":"https://blog.cloudera.com/cloudera-flow-management-continuous-delivery-architecture/","owner":"Cloudera"},{"title":"How to Give Professional Design Feedback","description":"When delivered well, constructive design feedback improves the design process and boosts team culture. Four professional designers discuss how to handle design feedback and collaborate productively.","link":"https://www.toptal.com/designers/design-leads/giving-feedback","owner":"Toptal"},{"title":"New aspect-ratio CSS property supported in Chromium, Safari Technology Preview, and Firefox Nightly","description":"The new CSS property that helps maintain spacing in responsive layouts.","link":"https://una.im/2021/01/28/aspect-ratio/","owner":"Una Kravets"},{"title":"OpenMapTiles 3.12: improved city centers","description":"\n          <img src=\"https://www.maptiler.com/media/2021-01-28-openmaptiles-3-12-improved-city-centers-1.png\"\n          alt=\"Thumb\">\n          <p>The most visible change in our open-source map publishing project OpenMapTiles 3.12 is in rendering buildings on zoom level 13, adding new features to the water layer and a few South- and East-Asian languages. </p>\n\n<p>Also, a lot of effort was invested into improving the quality of tools which made the workflow of the project much more simple, straightforward, and user-friendly.</p>\n\n<h2 id=\"generalized-urban-settlement\">Generalized urban settlement</h2>\n<p>The most visible change in OpenMapTiles 3.12 is the reworked building layer on the zoom 13. The brand-new algorithm creates blocks of buildings before it generalizes them. This leads to more accurate visualization over cities and villages.</p>\n\n<p><img src=\"https://www.maptiler.com/media/2021-01-28-openmaptiles-3-12-improved-city-centers-2.gif\" alt=\"Generalized building on zoom level 13 s","link":"https://www.maptiler.com/news/2021/01/openmaptiles-3-12-improved-city-centers/","owner":"MapTiler"},{"title":"OSC mixer control in C#","description":"In some senses, this is a follow on from my post on VISCA camera control in C#. It’s about another piece of hardware I’ve bought for my local church, and which I want to control via software. This time, it’s an audio mixer. Audio mixers: from hardware controls to software controls The audio mixer we’ve … ","link":"https://codeblog.jonskeet.uk/2021/01/27/osc-mixer-control-in-c/","owner":"Jon Skeet"}]