[{"title":"Application security automation for GitHub repositories with Snyk","description":"Snyk provides a wide array of integrations and a pretty comprehensive API to enable you to deploy Snyk across the SDLC and monitor all the code your organization is developing.  Of course – this is not always simple.  At scale, ensuring Snyk is monitoring all your repositories becomes more challenging. As you grow, more code […]","link":"https://snyk.io/blog/application-security-automation-github/","owner":"Snyk"},{"title":"Cloudera Data Platform extends Hybrid Cloud vision support by supporting Google Cloud","description":null,"link":"https://blog.cloudera.com/cloudera-data-platform-extends-hybrid-cloud-vision-support-by-supporting-google-cloud/","owner":"Cloudera"},{"title":"Detecting Image Similarity in (Near) Real-time Using Apache Flink","description":"","link":"https://medium.com/pinterest-engineering/detecting-image-similarity-in-near-real-time-using-apache-flink-723ce072b7d2?source=rss-ef81ef829bcb------2","owner":"Pinterest"},{"title":"French imagery ready for your next project with MapTiler","description":"\n          <img src=\"https://www.maptiler.com/media/2021-03-31-french-imagery-ready-for-your-next-project-with-maptiler-1.png?123\"\n          alt=\"Thumb\">\n          <h2 id=\"high-resolution-coverage-of-the-entire-france\">High-resolution coverage of the entire France</h2>\n<p>We are glad to announce that the whole french open imagery is now included in the MapTiler Satellite basemap. Ready-to-use from our cloud infrastructure using <strong>MapTiler Maps API</strong>, we’re now also offering this imagery for self-hosting with MapTiler Server.</p>\n\n<blockquote>\n  <p>High-res aerial images of the entire France were tiled, color-toned, and seamlessly integrated in the MapTiler global satellite map.</p>\n</blockquote>\n\n<p>More than half a million square kilometers of <strong>20cm/px</strong> resolution aerial imagery has been processed and deployed to MapTiler Cloud, now available to all our users. One hundred <em>départements</em> available from the French government were tiled, color-toned and","link":"https://www.maptiler.com/news/2021/03/french-imagery-ready-for-your-next-project-with-maptiler/","owner":"MapTiler"},{"title":"Fun Fast Tools for Serious Work","description":null,"link":"https://eaf4.com/emberconf2021/","owner":"Edward Faulkner"},{"title":"How to Import Data and Export Results in R","description":"\n            ","link":"https://www.sitepoint.com/how-to-import-data-and-export-results-in-r/?utm_source=rss","owner":"SitePoint"},{"title":"How to Migrate from Go Dep to Go Modules","description":"Do you enjoy weird and strange build issues? Or do you think something we do in this blog post is fishy and you want to fix it? Want us to use bazel instead? Good news - we&rsquo;ve got a role for you!\nWe&rsquo;re on the lookout for more engineers on our Developer Infrastructure team! We&rsquo;re looking to expand our sprawling development infrastructure as we grow to more people and a bigger codebase with new and exciting functionality and cloud management.","link":"https://www.cockroachlabs.com/blog/dep-go-modules/","owner":"CockroachDB"},{"title":"Latest products and features at DigitalOcean: March 2021","description":"We launched exciting new capabilities in March to help you achieve better performance, scalability, and efficiency for your apps. Here’s a snapshot of some of the key updates.","link":"https://www.digitalocean.com/blog/latest-products-and-features-at-digitalocean-march-2021","owner":"DigitalOcean"},{"title":"Reduce Boilerplate Code With Scala Macros and Quasiquotes","description":"The concise syntax of Scala usually helps developers avoid writing boilerplate. When repetitive code is required anyway, developers can use macros and quasiquotes to keep code clean and maintainable. Here's how.","link":"https://www.toptal.com/scala/macros-quasiquotes-reduce-boilerplate","owner":"Toptal"},{"title":"Secret Strategies to Win Promotions Other Devs Can’t Get","description":"\n            ","link":"https://www.sitepoint.com/secret-strategies-to-win-promotions-other-devs-cant-get/?utm_source=rss","owner":"SitePoint"},{"title":"SQL Server deadlock trace flags","description":null,"link":"https://vladmihalcea.com/sql-server-deadlock-trace-flags/","owner":"Vlad Mihalcea"}]