[{"title":"Accessibility Improvements & Interactive SQL Shell Now in CockroachDB Docs","description":"The CockroachDB Docs site is home to our product documentation for CockroachDB and CockroachCloud, our two product offerings. It includes reference documentation, conceptual documentation, developer guides, tutorials, and much more.\nCockroach Labs has always prioritized its documentation, investing in it from very early in the company’s existence. We believe clear, concise, and helpful docs are important in enabling our users to be self-sufficient in testing, deploying, and interacting with our products.","link":"https://www.cockroachlabs.com/blog/accessibility-improvements-interactive-sql-shell-now-in-cockroachdb-docs/","owner":"CockroachDB"},{"title":"Black History Month 2021: Be the light","description":null,"link":"https://blog.cloudera.com/black-history-month-2021-be-the-light/","owner":"Cloudera"},{"title":"Continuous Integration and Delivery pipeline mistakes","description":"","link":"https://www.rea-group.com/blog/continuous-integration-and-delivery-pipeline-mistakes/","owner":"REA Group"},{"title":"How Etsy Prepared for Historic Volumes of Holiday Traffic in 2020","description":"The Challenge For Etsy, 2020 was a year of unprecedented and volatile growth. (Simply on a human level it was also a profoundly tragic year, but that’s a different article.) Our site traffic leapt up in the second quarter, when lockdowns went into widespread effect, by an amount it normally would have taken several years […]","link":"https://codeascraft.com/2021/02/25/how-etsy-prepared-for-historic-volumes-of-holiday-traffic-in-2020/","owner":"Etsy"},{"title":"How Uber Deals with Large iOS App Size","description":null,"link":"https://eng.uber.com/how-uber-deals-with-large-ios-app-size/","owner":"Uber"},{"title":"POC@CRL: How Our CREWS for People of Color Builds Community","description":"CREWS (Cockroach Employees Who Support) are groups intended to create an inclusive environment for Roachers from underrepresented backgrounds and help employees connect with their peers on a deeper level. Groups host events and develop programs to support and advocate for their members, both internally and externally. While these groups are company-sponsored, they are run by employees for employees.\nWhat is POC@CRL? Our CREWS is a group for people of color at Cockroach Labs and their allies.","link":"https://www.cockroachlabs.com/blog/poc-at-crl/","owner":"CockroachDB"},{"title":"The end of third-party cookies: How marketers should prepare","description":"The end of third-party cookies may seem daunting, and the coming iOS update is a sure sign that that day is near. Luckily, there are data-driven solutions worth investigating as alternatives — and many brands are already using them.","link":"https://faraday.ai/blog/end-of-third-party-cookies/","owner":"Faraday"},{"title":"To The Future Black History Makers in Tech","description":"","link":"https://medium.engineering/to-the-future-black-history-makers-in-tech-6e87513605b4?source=rss----2817475205d3---4","owner":"Medium"},{"title":"Why Interns Get Equity at Cockroach Labs","description":"The benefits of hiring the best engineering interns into full-time positions are well known by top technology recruiters at Facebook, Apple, and Google. CNBC reported that engineering interns at these companies &#x201C;earn almost twice what the average American worker makes,&#x201D; which often includes an array of mind-blowing perks.\nThis puts pre-IPO companies like Cockroach Labs at a disadvantage. We often can&#x2019;t provide the extensive compensation and perks that top technology companies are offering.","link":"https://www.cockroachlabs.com/blog/equity-for-interns/","owner":"CockroachDB"}]