[{"title":"A Day in the Life","description":"<p>Welcome to our new “Day in the Life” feature in which Rasha Ardati sits down with one of our Product and Engineering colleagues to reflect on their career and experience at the Guardian to date</p><p>Mahesh Makani is a software developer who humorously calls himself a “person who can do code everywhere.” He started coding when he was in sixth form at Woodhouse College in Barnet north London, and went on to study physics at the University of Sussex in Brighton, before working as a developer.</p><p><strong>What led you to software development?</strong></p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguardian.com/info/2021/jan/13/a-day-in-the-life\">Continue reading...</a>","link":"https://www.theguardian.com/info/2021/jan/13/a-day-in-the-life","owner":"Guardian"},{"title":"A Very Cryptic Secret Santa","description":"An extra dose of magic can make the holiday season just a little bit more special. When it comes to Imgur Secret Santa, there is no shortage of magic, generosity,...","link":"https://blog.imgur.com/2021/01/12/a-very-cryptic-secret-santa/","owner":"Imgur"},{"title":"Bose is Building Databases on Demand with Elastic, CockroachDB, and Kubernetes","description":"Back in the bygone era of meeting in person, shaking hands, and clapping enthusiastically for the brave souls who are willing to stand in front of their peers to do live demos, Elasticsearch held a meetup in Boston at Bose headquarters. Chris Chambers, Cloud Engineer at Bose, spoke to the crowd about how his team built a platform as a service using a number of open source tools, including CockroachDB, Elasticsearch, and Kubernetes.","link":"https://www.cockroachlabs.com/blog/bose-elastic-cockroach-meetup/","owner":"CockroachDB"},{"title":"Go To Definition in the Language Server Protocol","description":null,"link":"https://tomassetti.me/go-to-definition-in-the-language-server-protocol/","owner":"Federico Tomassetti"},{"title":"Sharing Screens: What's it Like to Be an Engineer at Cockroach Labs","description":"When it comes to learning, we have all benefited from social learning in the workplace. Social learning is an opportunity for people to learn from one another through programs that help us share knowledge such as peer mentorship, or attending a lunch and learn, where someone shares their expertise with the broader company. Though sometimes unconscious, we are able to learn and observe by example and then apply what we take away to our own work.","link":"https://www.cockroachlabs.com/blog/engineering-learning-at-cockroach-labs/","owner":"CockroachDB"},{"title":"Using a “go links” service in your organization","description":"","link":"https://deezer.io/using-a-go-links-service-in-your-organization-99666125bccc?source=rss----2ab7e077175a---4","owner":"Deezer"},{"title":"Whose Code is it Anyway?","description":"Improving Code Ownership at Yelp In this prior blog post, Kent talked about how the Engineering Effectiveness (EE) organization was created at Yelp to reduce communication complexity between core teams and product teams. Core teams need to communicate infrastructure changes, manage the deprecation of libraries and tools, and evangelize new tooling to other teams at a regular cadence. EE has been investing in building tools that can communicate these changes and provide insights into what might make product teams more effective in shipping code quickly and safely. In order to measure the engineering effectiveness of Yelp, we need to measure...","link":"https://engineeringblog.yelp.com/2021/01/whose-code-is-it-anyway.html","owner":"Yelp"},{"title":"Writing Simulations Using Go","description":"Introduction If you can write a for-loop, you can do statistics. - Jake Vanderplas\nA lot of developers shy away from problems which involve statistics or probability. Which is shameful since in today&rsquo;s data-rich environment, you can gain a lot of insights from data.\nIn this blog post, I&rsquo;ll show you how to write a simulation tool which requires no knowledge in statistics or probability. Simulations are easy to write and can be a very effective tool in research.","link":"https://www.ardanlabs.com/blog/2021/01/writing-simulations-using-go.html","owner":"William Kennedy"}]