[{"title":"2021 State of Postgres Survey Results","description":"Postgres is one of the most popular and loved databases in the world, even after 30+ years of development. Learn how developers use Postgres today, from the use cases they’re tackling and places they go to share and learn to opportunities for improvement in the Postgres community, and more.  ","link":"https://blog.timescale.com/blog/2021-state-of-postgres-survey-results/","owner":"Timescale"},{"title":"Algorithm-Assisted Inventory Curation","description":"<p>Personalizing fashion at scale requires that we build an inventory whose size and complexity are as great as that of our client base. To support our inventory expansion and our broader supply chain management, Stitch Fix has developed a suite of algorithms to act as a new inventory recommender system. In this blog post, we describe how we built this recommender system, from its data sources to its core models. Next, we describe the recommender system’s integrations across the supply chain, which range from augmented inventory curation, to AI-assisted design, to rapid vendor evaluation and onboarding for the <a href=\"https://www.stitchfix.com/impact/elevate-grant-program\">Elevate Grant &amp; Mentorship Program</a>.</p>\n\n<p><strong>Building the Raw Materials for Personalization at Scale</strong></p>\n\n<p>Through the process of styling and collecting feedback, Stitch Fix builds expertise in matching inventory to clients. But we can only style items that already exist in our inventory. I","link":"https://multithreaded.stitchfix.com/blog/2021/05/12/algorithm-assisted-inventory-curation/","owner":"Stitch Fix"},{"title":"Alpine Day - A one day live online conference","description":"\n                                    ","link":"https://laravel-news.com/alpine-day","owner":"Laravel"},{"title":"Announcing the 2021 Data Impact Awards","description":null,"link":"https://blog.cloudera.com/announcing-the-2021-data-impact-awards/","owner":"Cloudera"},{"title":"Cloud Report: Cloud migration – benefits, challenges, best practices","description":"Do you know, that over 2/3 of C-lexel executives find Cloud migration challenging and over 80% decide on engaging an IT partner?   ","link":"https://www.future-processing.com/blog/cloud-report-cloud-migration-benefits-challenges-best-practices/","owner":"Future Processing"},{"title":"Convert Java Object (POJO) To and From JSON with Gson","description":"In this tutorial, we'll take a look at examples on how to convert Java Object (POJO) to JSON and how to convert JSON to Java Object using Gson.","link":"https://stackabuse.com/convert-java-object-pojo-to-and-from-json-with-gson","owner":"Stack Abuse"},{"title":"Customer Success: A Specialist’s Journey","description":null,"link":"https://www.hostinger.com/blog/customer-success-specialist-journey/","owner":"Hostinger"},{"title":"D2iQ Kommander and AWS Kubernetes Services: A Winning Combination","description":"\n                    ","link":"https://d2iq.com/blog/d2iq-kommander-and-aws-kubernetes-services-a-winning-combination","owner":"Mesosphere"},{"title":"Embracing an “Aha!” Moment: Building Trust to Effect Change","description":"What happens when you have a big idea but not the authority to make it happen? Earning trust is the key to influencing without authority.","link":"https://www.toptal.com/product-managers/saas/how-a-product-manager-can-influence-without-authority","owner":"Toptal"},{"title":"Highly available and highly scalable Cloudflare tunnels","description":"Starting today, we’re thrilled to announce you can run the same tunnel from multiple different cloudflareds simultaneously. This enables graceful restarts, elastic auto-scaling, easier Kubernetes integration, and more reliable tunnels.","link":"https://blog.cloudflare.com/highly-available-and-highly-scalable-cloudflare-tunnels/","owner":"Cloudflare"},{"title":"How Our Open Interview Process Helps You Land the Job","description":"At Cockroach Labs, we’ve long worked at reducing bias for better, more inclusive recruiting outcomes. We do this by removing resumes throughout the hiring process so that interviewers can focus on you, the candidate— not your background. We also emphasize exercise-based interviews that give people the opportunity to demonstrate that they can do the job instead of recounting past experience. These practices are rooted in a basic, human principle for hiring: as a company looking for amazing talent, we want to eliminate hurdles that might keep you from showing us your strengths in an interview, not create them.","link":"https://www.cockroachlabs.com/blog/how-our-open-interview-process-helps-you-land-the-job/","owner":"CockroachDB"},{"title":"How to encrypt or decrypt files using OpenSSL utility","description":"Use OpenSSL utility to encrypt or decrypt files. OpenSSL version. $ openssl version OpenSSL 1.1.1f 31 Mar 2020 Encrypt archive.tgz and store it as archive.tgz.enc file. $ openssl enc -aes-256-cbc -in archive.tgz -out archive.tgz.enc -pbkdf2 enter aes-256-cbc encryption password: ************ Verifying - enter aes-256-cbc encryption password: ************ The encrypted file can be easily identified. $ […]","link":"https://sleeplessbeastie.eu/2021/05/12/how-to-encrypt-or-decrypt-files-using-openssl-utility/","owner":"Milosz Galazka"},{"title":"How to Get an RDBMS Server Version with SQL","description":"Do you need to know what RDBMS Server version you’re on, and you only have SQL at your disposal? No problem. Most RDBMS provide you with that information in some form of meta data table. Here’s how: Missing this info for your own RDBMS? Feel free to comment.","link":"https://blog.jooq.org/2021/05/12/how-to-get-an-rdbms-server-version-with-sql/","owner":"jOOQ"},{"title":"How to Install Sensu on Ubuntu 20.04","description":null,"link":"https://www.rosehosting.com/blog/how-to-install-sensu-on-ubuntu-20-04/","owner":"RoseHosting"},{"title":"Improving iOS Intangibles with Tactical","description":null,"link":"https://medium.engineering/improving-ios-intangibles-with-tactical-f744fbff033e?source=rss----2817475205d3---4","owner":"Medium"},{"title":"Inc Magazine Honors Cockroach Labs on Best Workplaces List 2021","description":"Cockroach Labs was named for resilience and survival. The last year has tested us all in unimaginable ways, and it was the strength and resilience of our team and our community that kept us afloat and propelled us forward.\nSo it is an absolute honor that, after the year we&rsquo;ve all had, we have been named to Inc. magazine’s annual list of the Best Workplaces for 2021. The list is the result of a wide-ranging and comprehensive measurement of American companies that have created exceptional workplaces and company culture.","link":"https://www.cockroachlabs.com/blog/inc-magazine-best-workplaces-2021/","owner":"CockroachDB"},{"title":"Increase Performance and lifespan of SSDs & SD Cards","description":null,"link":"https://haydenjames.io/increase-performance-lifespan-ssds-sd-cards/","owner":"Hayden James"},{"title":"Introducing Confluent for Kubernetes","description":"We are excited to announce that Confluent for Kubernetes is generally available! Today, we are enabling our customers to realize many of the benefits of our cloud service with the [&hellip;]\n","link":"https://www.confluent.io/blog/confluent-for-kubernetes-offers-cloud-native-kafka-automation/","owner":"Confluent"},{"title":"LyftLearn: ML Model Training Infrastructure built on Kubernetes","description":"","link":"https://eng.lyft.com/lyftlearn-ml-model-training-infrastructure-built-on-kubernetes-aef8218842bb?source=rss----25cd379abb8---4","owner":"Lyft"},{"title":"Moderating Promotional Spam and Inappropriate Content in Photos at Scale at Yelp","description":"The trust of our community of consumers and business owners is Yelp’s top priority. We take significant measures to maintain this trust through our state of the art review recommendation algorithms in order to maintain the integrity and quality of the content on our site. Albeit popular, review text is only one of the many types of user-generated content at Yelp. Photos are also a key piece of content and they are increasingly becoming an attack vector for spammers and inappropriate or other unwanted behavior. In this blog post we show how we built a scalable photo moderation workflow leveraging...","link":"https://engineeringblog.yelp.com/2021/05/moderating-promotional-spam-and-inappropriate-content-in-photos-at-scale-at-yelp.html","owner":"Yelp"},{"title":"New – Create Microsoft SQL Server Instances of Amazon RDS on AWS Outposts","description":"Last year, we announced Amazon Relational Database Service (Amazon RDS) on AWS Outposts, which allows you to deploy fully managed database instances in your on-premises environments. AWS Outposts is a fully managed service that extends AWS infrastructure, AWS services, APIs, and tools to virtually any datacenter, co-location space, or on-premises facility for a truly consistent […]","link":"https://aws.amazon.com/blogs/aws/new-create-microsoft-sql-server-instances-of-amazon-rds-on-aws-outposts/","owner":"AWS"},{"title":"New invoicing features to help you get paid faster","description":"Over the past few months, we’ve added several new features to Stripe Invoicing to help any business get paid faster and streamline their collection workflows.","link":"https://stripe.com/blog/new-invoicing-features","owner":"Stripe"},{"title":"PHP Benchmarks: OPcache vs OPcache w/ Performance Tweaks","description":null,"link":"https://haydenjames.io/php-benchmarks-opcache-performance-tweaks/","owner":"Hayden James"},{"title":"Sessions kicks off June 16","description":"Sessions, our global user conference, will be fully online this year, making it accessible to anyone who wants to attend. We invite you to join us starting June 16, 2021. Through product talks, workshops, and fireside chats, Stripe leadership will discuss how we're building for the future economic growth of our customers. ","link":"https://stripe.com/blog/stripe-sessions-2021","owner":"Stripe"},{"title":"Solving Bottlenecks With SQL Indexes and Partitions","description":"Indexes and partitioning can help with SQL performance, but they're not cure-alls. Through everyday examples of date range and LIKE queries, find out how to \"think like an RDBMS\" to make yours run faster.","link":"https://www.toptal.com/database/sql-indexes-explained-pt-3","owner":"Toptal"},{"title":"Spotify Wins CNCF’s Top End User Award and Toots Own Horn About It","description":"Last week, Spotify won an award — and we’re not playing it cool. We tweeted. We bragged on LinkedIn. Our internal Slack is alive with emoji and exclamation points. We’re really very proud of this one. The award is Cloud Native Computing Foundation’s Top End User Award, announced at last week’s KubeCon + CloudNativeCon. Voted [...]","link":"https://engineering.atspotify.com/2021/05/11/spotify-wins-cncfs-top-end-user-award-and-toots-own-horn-about-it/","owner":"Spotify"},{"title":"Video: Docker Build – Working with Docker and VSCode","description":null,"link":"https://www.docker.com/blog/video-docker-build-working-with-docker-and-vscode/","owner":"Docker"},{"title":"Visualize Weather Forecast with WebGL","description":"\n          <img src=\"https://www.maptiler.com/media/2021-05-12-visualize-weather-forecast-with-webgl-1.png\"\n          alt=\"Thumb\">\n          <p>New JavaScript components for animating weather data like temperature, wind flow, or any other scientific information were developed by our team. You can use weather data endpoint from us or process your own data with prepared workflows and integrate the functionality with your website and get attractive and easy-to-understand animations with 60 frames per second directly in a web browser - as part of your own branded applications.</p>\n\n<h2 id=\"wind-particles-animation-in-gl-js-maps\">Wind particles animation in GL JS maps</h2>\n<p>Data like wind and wave datasets allow visualization with particles clearly showing direction and speed in an animated way.</p>\n\n<amp-iframe width=\"640\" height=\"360\" sandbox=\"allow-scripts allow-same-origin\" layout=\"responsive\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen=\"\" src=\"https://player.vimeo.co","link":"https://www.maptiler.com/news/2021/05/visualize-weather-forecast-with-webgl/","owner":"MapTiler"},{"title":"What is Flutter? The Game Changer in Application Development","description":null,"link":"https://semaphoreci.com/blog/what-is-flutter","owner":"Semaphore CI Engineering"}]