[{"title":"Building a WebAssembly Runtime for BBC iPlayer and enhanced audience experiences.","description":"","link":"https://medium.com/bbc-design-engineering/building-a-webassembly-runtime-for-bbc-iplayer-and-enhanced-audience-experiences-7087455808ef?source=rss----ccd524e1760a---4","owner":"BBC"},{"title":"Case Study: Equinix Metal Builds on Flatcar","description":"It started as a crazy idea.\nBack in 2014, the cloud rush had just started. Compute workloads were moving to “virtual machines as a service”. This was the inevitable future of IT.\nA small team of industry veterans, however, saw things differently. They believed there would be users who wanted the guaranteed performance, security and control of running their own bare metal, but with the experience of the cloud. The idea of a “bare metal cloud” was born, along with the company, Packet, that would define the category.","link":"/blog/2021/02/case-study-equinix-metal-builds-on-flatcar/","owner":"Kinvolk"},{"title":"Change The Way You Do ML With Applied ML Prototypes","description":null,"link":"https://blog.cloudera.com/kickstart-ai-use-cases-with-new-applied-machine-learning-prototypes/","owner":"Cloudera"},{"title":"Help grow your small business with Venmo: Business profiles are officially available for all sellers ","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2021/2/24/help-grow-your-small-business-with-venmo-business-profiles-are-officially-available-for-all-sellers","owner":"Venmo"},{"title":"Launch of the swisstopo vector maps","description":"\n          <img src=\"https://www.maptiler.com/media/2021-02-25-launch-of-the-swisstopo-vector-maps-1.png\"\n          alt=\"Thumb\">\n          <p><a href=\"https://www.maptiler.com/news/2020/08/swisstopo-vector-tiles-development/\">MapTiler Team has been working with swisstopo</a>, the Swiss Federal Office of Topography,  to develop a new vector map for the modern user. The Swiss data - processed into vector tiles with MapTiler tools - is combined with global maps from MapTiler Cloud and is available in the test version of the next <a href=\"https://test.map.geo.admin.ch/\">Swiss GeoPortal</a>.</p>\n\n<h2 id=\"new-technologies-for-swiss-maps\">New Technologies for Swiss Maps</h2>\n<p>Governments can supply authoritative geodata, to complement the extensive open data from sources like OSM. However, making the government data dynamic and interactive in the way modern users have come to expect is a challenge. That <a href=\"https://www.maptiler.com/news/2019/02/what-are-vector-tiles-and-why-you-should-","link":"https://www.maptiler.com/news/2021/02/launch-of-the-swisstopo-vector-maps/","owner":"MapTiler"},{"title":"Load Shedding with NGINX using adaptive concurrency control — Part 1","description":"","link":"https://tech.olx.com/load-shedding-with-nginx-using-adaptive-concurrency-control-part-1-e59c7da6a6df?source=rss----761b019b483f---4","owner":"OLX"},{"title":"Load Shedding with NGINX using adaptive concurrency control — Part 2","description":"","link":"https://tech.olx.com/load-shedding-with-nginx-using-adaptive-concurrency-control-part-2-d4e4ddb853be?source=rss----761b019b483f---4","owner":"OLX"},{"title":"Update Array Elements in a Document with MQL Positional Operators","description":"\n                    <p>MongoDB offers a rich query language that&rsquo;s great for create, read,\nupdate, and delete operations as well as complex multi-stage aggregation\npipelines. There are many ways to model your data within MongoDB and\nregardless of how it looks, the MongoDB Query Language (MQL) has you\ncovered.</p>\n<p>One of the lesser recognized but extremely valuable features of MQL is\nin the positional operators that you&rsquo;d find in an update operation.</p>\n<p>Let&rsquo;s say that you have a document and inside that document, you have an\narray of objects. You need to update one or more of those objects in the\narray, but you don&rsquo;t want to replace the array or append to it. This is\nwhere a positional operator might be valuable.</p>\n<p>In this tutorial, we&rsquo;re going to look at a few examples that would\nbenefit from a positional operator within MongoDB.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdevelop","link":"https://www.thepolyglotdeveloper.com/2021/02/update-array-elements-document-mql-positional-operators/","owner":"Nic Raboy"},{"title":"Watch Our Webinar: Leading a Distributed Engineering Team","description":"Toptal was an early adopter of an all-remote business model. As one of the leading remote workforces worldwide, Toptal strives to engage with other thought leaders and innovators in this space.\r\n\r\nIn our latest on-demand webinar, Toptal Engineering Manager Marco Santos talks with James Bourne, Editor-in-Chief of TechForge Media, about best practices for remote engineering teams.","link":"https://www.toptal.com/engineering-team-manager/leading-distributed-team-webinar","owner":"Toptal"},{"title":"What Banks Have in Common with Google","description":"Innovative fintech organizations built from the ground up to be agile, data-driven, and cloud-native are driving traditional banks and financial services organizations to adopt cloud-native infrastructure. In order to remain competitive and relevant, banks are modernizing operations, replacing legacy systems like Oracle, IBM DB2, and others. Moreover, to keep pace with fintech organizations, banks are turning to the cloud.\nFinancial services organizations have different infrastructure requirements than most companies undergoing a digital transformation.","link":"https://www.cockroachlabs.com/blog/what-banks-have-in-common-with-google/","owner":"CockroachDB"}]