[{"title":"7 Tips for Writing Clear, Human-friendly Microcopy","description":"\n            ","link":"https://www.sitepoint.com/wordpress-headless-cms-eleventy/?utm_source=rss","owner":"SitePoint"},{"title":"A single outlier could completely distort your Cohen's d value","description":"<p><a href=\"https://en.wikipedia.org/wiki/Effect_size#Cohen's_d\">Cohen&rsquo;s d</a> is a popular way to estimate\nthe <a href=\"https://en.wikipedia.org/wiki/Effect_size\">effect size</a> between two samples.\nIt works excellent for perfectly normal distributions.\nUsually, people think that slight deviations from normality\nshouldn&rsquo;t produce a noticeable impact on the result.\nUnfortunately, it&rsquo;s not always true.\nIn fact, a single outlier value can completely distort the result even in large samples.</p>\n<p>In this post, I will present some illustrations for this problem and will show how to fix it.</p>","link":"https://aakinshin.net/posts/cohend-and-outliers/","owner":"Andrey Akinshin"},{"title":"Building the Twitter UI with Ionic Components","description":null,"link":"https://devdactic.com/twitter-ui-with-ionic/?utm_source=rss&utm_medium=rss&utm_campaign=twitter-ui-with-ionic","owner":"Simon Reimler"},{"title":"Crystal 0.36.0 released!","description":"<p><a href=\"https://github.com/crystal-lang/crystal/releases/tag/0.36.0\">Crystal 0.36.0</a> has been released!</p>\n\n<p>Since 0.35.1 there has been lots and lots of polishing, new features, and important fixes. This created a bigger delta than we wanted to transition from the last 0.x release to the first 1.0-preX. As a result, we are releasing a 0.36.0. This should help the community migrate their packages with less friction to the changes that will appear in 1.0. It will also give us a chance to get rid of a couple of recently introduced deprecations.</p>\n\n<p>Note that this release will be available in <a href=\"/2020/08/24/announcing-new-apt-and-rpm-repositories.html\">the new apt and rpm repositories post</a>, as well as GitHub release artifacts. You might need to update your package repositories.</p>\n\n<p>There were <a href=\"https://github.com/crystal-lang/crystal/compare/0.35.1...0.36.0\">346 commits since 0.35.1</a> by 54 contributors.</p>\n\n<p>Let’s get right into some highlights in ","link":"https://crystal-lang.org/2021/01/26/crystal-0.36.0-released.html","owner":"Crystal"},{"title":"Engineering Tools for Designers with Legends of Runeterra","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/118/puffcapheader.png\" width=\"1640\" height=\"624\" alt=\"\" />\n<p>We’re Patrick Conaboy and Jeff Brock and we’re senior software engineers on the <em>Legends of Runeterra</em> Card Design team. The engineers on our team are responsible for building tools, writing game logic, and supporting card designers. In this article, we’ll be covering how engineers on <em>LoR</em> built out a new scripting system that enables designers to iterate and experiment with new card ideas easily. </p>\n","link":"https://technology.riotgames.com/news/engineering-tools-designers-legends-runeterra","owner":"Riot Games"},{"title":"Goodbye, 2020! Lookout, 2021","description":"Like most people, I am not at all sad to see 2020 go. It introduced unique pressures that challenged all of us in different ways. As snykers, I believe we have emerged stronger. Throughout the year, our global team—alongside our partners and customers—reached so many impressive milestones, made that much sweeter due to the headwinds […]","link":"https://snyk.io/blog/goodbye-2020-lookout-2021/","owner":"Snyk"},{"title":"How to Become a PicCollage Intern","description":"","link":"https://tech.pic-collage.com/how-to-become-a-piccollage-intern-5350f37740a1?source=rss----3819a69148cb---4","owner":"PicCollage"},{"title":"How we made Typerighter, the Guardian’s style guide checker","description":"<p>Lots of regular expressions, and a timely demonstration by an editorial colleague, led to a two year side-project that eventually ended up in production</p><p>The <a href=\"https://www.theguardian.com/guardian-observer-style-guide-a\">Guardian’s style guide</a> was originally published in 1928 as a physical book, and is available to everyone on our website. Over time, it’s grown bigger and more complex, containing guidelines on important topics that we want to get right. Last year, for example, we <a href=\"https://www.theguardian.com/environment/2019/may/17/why-the-guardian-is-changing-the-language-it-uses-about-the-environment\">updated it</a> to more accurately describe the environmental crisis facing the world. In short, our style guide is ever-expanding, and it changes to reflect our times and values. How do journalists writing and editing content keep up to date?</p><p>I’m a software engineer on the Guardian’s Editorial Tools team. Two years ago, the team were introduced to Max Wa","link":"https://www.theguardian.com/info/2021/jan/26/how-we-made-typerighter-the-guardians-style-guide-checker","owner":"Guardian"},{"title":"January brings us Firefox 85","description":null,"link":"https://hacks.mozilla.org/2021/01/january-brings-us-firefox-85/","owner":"Mozilla Hacks"},{"title":"Latest products and features at DigitalOcean: January 2021","description":"We started the new year with a bang and introduced many new features for our Platform as a Service products. Here are the highlights for this month:","link":"https://www.digitalocean.com/blog/latest-products-and-features-at-digitalocean-january-2021","owner":"DigitalOcean"},{"title":"Migrating Apache NiFi Flows from HDF to CFM with Zero Downtime","description":null,"link":"https://blog.cloudera.com/migrating-apache-nifi-flows-from-hdf-to-cfm-with-zero-downtime/","owner":"Cloudera"},{"title":"MySQL High Availability at Eventbrite","description":null,"link":"https://www.eventbrite.com/engineering/mysql-high-availability-at-eventbrite/","owner":"Eventbrite"},{"title":"Optimizing joins in Redshift","description":null,"link":"https://build.affinity.co/optimizing-joins-in-redshift-30039c166092?source=rss----c4f165841679---4","owner":"Affinity"},{"title":"Serving Driver-partners Data at Scale Using Mirror Cache","description":"<p>Since the early beginnings, driver-partners have been the centrepiece of the wide-range of  services or features provided by the Grab platform. Over time, many backend microservices were developed to support our driver-partners such as earnings, ratings, insurance, etc. All of these different microservices require certain information, such as name, phone number, email, active car types, and so on, to curate the services provided to the driver-partners.</p>\n\n<p>We built the <strong>Drivers Data service</strong> to provide drivers-partners data to other microservices. The service attracts a high QPS and handles 10K requests per second during peak hours. Over the years, we have tried different strategies to serve driver-partners data in a resilient and cost-effective manner, while accounting for low response time. In this blog post, we talk about <strong>mirror cache</strong>, an in-memory local caching solution built to serve driver-partners data efficiently.</p>\n\n<h2 id=\"what-we-star","link":"https://engineering.grab.com/mirror-cache-blog","owner":"Grab"},{"title":"The Ultimate Experience: A Guide to the Principles of Sensory Design","description":"Digital design routinely ignores neurological factors beyond sight. Sensory design principles emphasize the interconnection of human perception and prompt designers to explore non-visual solutions.","link":"https://www.toptal.com/designers/ux/sensory-design","owner":"Toptal"},{"title":"Unlimited Plex Storage via Google Drive And Rclone","description":null,"link":"https://blog.monstermuffin.org/unlimited-plex-storage-via-google-drive-and-rclone/?utm_source=rss&utm_medium=rss&utm_campaign=unlimited-plex-storage-via-google-drive-and-rclone","owner":"Monstermuffin"},{"title":"Unlimited Plex Storage via Google Drive And Rclone","description":null,"link":"https://blog.muffn.io/unlimited-plex-storage-via-google-drive-and-rclone/?utm_source=rss&utm_medium=rss&utm_campaign=unlimited-plex-storage-via-google-drive-and-rclone","owner":"Monstermuffin"},{"title":"Use the Cockroach DB Console to Observe and Troubleshoot SQL","description":"Whether you’re a developer or operator, we want to give you the observability tools you need to monitor your CockroachDB cluster. This includes standard tools such as logs, metrics like Prometheus and health endpoints, and alerting. But modern observability requires more than just the standard tools. To give you as much insight into your database as possible, CockroachDB also provides SQL commands, tables, and a native DB Console packaged with every binary to provide observability for any workload.","link":"https://www.cockroachlabs.com/blog/use-the-cockroach-db-console-to-observe-and-troubleshoot-sql/","owner":"CockroachDB"}]