[{"title":"#ClouderaLife Spotlight: Suzy Tonini, Talent Researcher","description":null,"link":"https://blog.cloudera.com/clouderalife-spotlight-suzy-tonini-talent-researcher/","owner":"Cloudera"},{"title":"Choosing Golang for Clever","description":null,"link":"https://engineering.clever.com/2021/04/27/choosing-golang-for-clever/","owner":"Clever"},{"title":"Containerizing Ruby on Rails Applications","description":"<p><img src='https://res.cloudinary.com/dhttas9u5/image/upload/c_fill,fl_progressive,h_800,q_auto,w_1600/containerizing-hero_oin8lf.jpg' /></p>\n<p>As the world moved rapidly towards container technology, we took our time. We only recently started migrating our applications to our <a href='https://kubernetes.io/'>Kubernetes</a> platform. To migrate those applications, we had to <a href='https://technology.doximity.com/articles/buildpacks-vs-dockerfiles'>containerize</a> them. Containerization includes the technical step of packaging an application’s code with it’s dependencies, and changes to the application itself to make it container-friendly. Applications that were previously built and run on standard cloud servers usually need a few modifications to make them work well in a container. </p>\n\n<p>As we prepared our applications to run in containers, the line between build-time and run-time became less blurry and much more strict. This distinction was less critical with our previous pla","link":"https://technology.doximity.com/articles/containerizing-ruby-on-rails-applications","owner":"Doximity"},{"title":"Custom Relationships In Django","description":null,"link":"https://devblog.kogan.com/blog/custom-relationships-in-django","owner":"Kogan.com"},{"title":"Customization vs. Configuration in Evolving Design Systems","description":"When a design system first starts out, the promise of visual consistency glows bright — the ideal product would have only one set of buttons, a unified typography scale, and elements that look the same no matter which designer made the design or which developer programmed them to be real and deployed. As the product [...]","link":"https://engineering.atspotify.com/2021/04/28/customization-vs-configuration-in-evolving-design-systems/","owner":"Spotify"},{"title":"Get Started Using Amazon FSx File Gateway for Fast, Cached Access to File Server Data in the Cloud","description":"As traditional workloads continue to migrate to the cloud, some customers have been unable to take advantage of cloud-native services to host data typically held on their on-premises file servers. For example, data commonly used for team and project file sharing, or with content management systems, has needed to reside on-premises due to issues of […]","link":"https://aws.amazon.com/blogs/aws/get-started-using-amazon-fsx-file-gateway-for-fast-cached-access-to-file-server-data-in-the-cloud/","owner":"AWS"},{"title":"Product Announcement: Chef Infra Client 17 Now Available","description":null,"link":"https://blog.chef.io/product-announcement-chef-infra-client-17-now-available","owner":"Chef"},{"title":"Public Tech Talk: “Gillian Verification of JavaScript and C”","description":null,"link":"https://galois.com/blog/2021/04/public-tech-talk-gillian-verification-of-javascript-and-c/","owner":"Galois"},{"title":"Scrum Master vs. Agile Coach: Why Successful Transformations Need Both","description":"During an Agile transformation, leaders often assume that the Agile coach role can be undertaken by a Scrum master. While they share similar traits, these roles have scopes  that differ greatly.","link":"https://www.toptal.com/project-managers/agile-coaching/agile-coach-vs-scrum-master","owner":"Toptal"},{"title":"The Engineering Interview at Wealthfront","description":null,"link":"https://eng.wealthfront.com/2021/04/27/the-engineering-interview-at-wealthfront/","owner":"Wealthfront"},{"title":"Toptal Webinar: How to Build and Scale a Remote Engineering Team","description":"Building and scaling engineering teams is more complicated than just hiring additional people. As teams grow, everything has to change.\r\n\r\nIn the latest on-demand Toptal Webinar, our Vice President of R&D Bozhidar Batsov and Chief People Officer Michelle Labbe discuss how to build and scale best-in-class engineering teams.","link":"https://www.toptal.com/engineering-management/scaling-remote-engineering-team","owner":"Toptal"},{"title":"Why Learn Kotlin?","description":"Kotlin has always been and continues to be a modern language in the industry, addressing the real needs of real developers. It is increasingly being adopted in many trending fields, including mobile, web, server-side and cloud development, data science, and education. This all gives a strong indication that there is already significant demand for Kotlin […]","link":"https://blog.jetbrains.com/kotlin/2021/04/why-learn-kotlin/","owner":"Kotlin"},{"title":"Zyte Developers Community newsletter issue #3","description":"Hi there, If you are not signed up already for the Zyte Developers Community newsletter, you can sign up here. In this issue: Scrapy 2.5.0 is out Recipe scraping app (with source code) Web scraping in Elixir Easy table scraping with R Scrapy 2.5.0 is out The first new Scrapy release of the year is […]","link":"https://www.zyte.com/blog/zyte-developers-community-newsletter-issue-3/","owner":"Scrapinghub"}]