[{"title":"Adsense Resource Inventory","description":"In addition to my previous post I have gathered some popular resources from around the web that talk about making money off Google Adsense. I hope this sums up all you need to start making money yourself.\nPlease, let me know if I missed something.\nThings to know about making money with Google Adsense There are three things you need in order to make money off your site or blog.","link":"https://www.devroom.io/2006/10/30/adsense-resource-inventory/","owner":"Antirez"},{"title":"Cheat sheets? Look here!","description":"<p>Getting confused of all the tools you use on a daily basis? Don&rsquo;t remember all the exact method names and possibilities of SubVersion, Apache, HTML, CSS, MySQL, Ruby on Rails, CVS, AJAX, JavaScript,  FireFox, Google, etc. etc.? There is a solution! Cheat sheets make your daily work easier by providing you all you need to know on a single paper!</p>\n<p>Here&rsquo;s a <a href=\"http://www.smashingmagazine.com/2006/10/30/cheat-sheet-round-up-ajax-css-latex-ruby/\">very comprehensive list</a> of cheat sheets.</p>\n<p>Cheat sheets are simple put a collection of all important (if not just all) functions and methods you can use for a given product, framework or language. They&rsquo;re great to have on your desk if you just can&rsquo;t quite remember what function to use. Check &lsquo;em out, print &lsquo;em out and start loving &lsquo;em!</p>","link":"https://www.devroom.io/2006/10/30/cheat-sheets-look-here/","owner":"Antirez"},{"title":"Confused about CSS Columns?","description":"<p>I&rsquo;m mainly confused on how to make different layouts with pure CSS. Back in the time when tables were okay, it was rather easy. But with CSS it&rsquo;s gotten rather tricky.</p>\n<p><a href=\"http://www.dynamicdrive.com/style/layouts/\">Dynamic Drive</a> has some great examples (with CSS code!) of different kinds of layouts. It&rsquo;s great to use as a starting point for your design!</p>","link":"https://www.devroom.io/2006/10/30/confused-about-css-columns/","owner":"Antirez"},{"title":"How does your site look on …?","description":"When designing a web site you always check how the site looks in different browsers, even maybe at different resolutions. But how many browsers do you really use? Firefox, Safari when on Mac, Internet Explorer when on Windows and that&rsquo;s mostly it.\nBrowser Shots allows you to select different browsers and set several options like colour depth, screen resolution, java etc. and make screenshots of your site (by entering the URL).","link":"https://www.devroom.io/2006/10/30/how-does-your-site-look-on/","owner":"Antirez"}]