[{"title":"Easily create a FavIcon online!","description":"<p>You know those little icons you see in your browsers address bar? Yes, the ones in you bookmarks! Well, you want such an icon for your site?</p>\n<p>These icons are called FavIcons, short for Favourites Icon. Most modern browsers make use of them.</p>\n<p>To create such an icon you&rsquo;ll need some image first. Normally the process would be rather difficult involving several graphics manipulation programs and conversions. Don&rsquo;t fall for that! Use the followin <a href=\"http://www.chami.com/html-kit/services/favicon/\">FavIcon from Pics</a> site!</p>\n<p>Just upload a gif, jpeg or png image (with transparency if you like) and get a FavIcon for free! There are also some other goodies included!</p>\n<p>Of course, there&rsquo;s information available on how to upload your FavIcon and how to let your browser know about it.</p>","link":"https://www.devroom.io/2006/10/10/easily-create-a-favicon-online/","owner":"Antirez"},{"title":"Generate a SQlite-based Rails app","description":"<p>When you create a Rails application a database.yml files is included with some default configuration for your database. Unfortunately these are defaults for MySQL. If you want to use another database, like SQlite, you&rsquo;d have to rewrite the entire configuration file. And that&rsquo;s not what you want!</p>\n<p>Luckily, rails is very adapative and we can make it do all the work for us.</p>","link":"https://www.devroom.io/2006/10/10/generate-a-sqlite-based-rails-app/","owner":"Antirez"},{"title":"Hi-Res Wallpapers for your MacBook!","description":"<p>For all of you who have a flashy Apple MacBook (or any other device with a 1280x800 resolution) here&rsquo;s a nice site with lot&rsquo;s of hi-res wallpapers. Of course, they&rsquo;re all for free!</p>\n<p>Oh, they have other sizes as well.</p>\n<p>Go check out <a href=\"http://interfacelift.com/wallpaper/index.php?sort=downloads&w=1280&h=800\">InterfaceLIFT</a>.</p>","link":"https://www.devroom.io/2006/10/10/hi-res-wallpapers-for-you-macbook/","owner":"Antirez"},{"title":"Top 5 DVDs you must have","description":"<p>Everybody at this point in time at least owns one or more DVD - Digital Versatile Disk - Videos. Some people try to collect as many DVD&rsquo;s as possible, others just buy the ones they like (or can afford).</p>\n<p>I&rsquo;m not sure how many DVD&rsquo;s I have at this time, but there are quite a few DVD&rsquo;s that you just have to have in your collection.</p>\n<p>If you feel wronged because your favourite movie is not listed, feel free to add a comment stating your favourites. (Oh, let me know why it&rsquo;s such a great movie too!)</p>","link":"https://www.devroom.io/2006/10/10/top-5-dvds-you-must-have/","owner":"Antirez"}]