[{"title":"\nNew Redis Cluster meta-data handling\n","description":"This blog post describes the new algorithm used in Redis Cluster in order to propagate and update metadata, that is hopefully significantly safer than the previous algorithm used. The Redis Cluster specification was not yet updated, as I'm rewriting it from scratch, so this blog post serves as a first way to share the algorithm with the community.\n","link":"\nhttp://antirez.com/news/62\n","owner":"Antirez"},{"title":"Detecting Race Conditions With Go","description":"I always find it interesting when I realize that something I have been practicing or dealing with for a long time has a name. This time it happens to be race conditions. This is something you can&rsquo;t avoid thinking about as soon as you have more than one routine sharing any kind of resource. If you&rsquo;re not thinking about race conditions in your code, now is the time.\nA race condition is when two or more routines have access to the same resource, such as a variable or data structure and attempt to read and write to that resource without any regard to the other routines.","link":"https://www.ardanlabs.com/blog/2013/09/detecting-race-conditions-with-go.html","owner":"William Kennedy"},{"title":"Recursion And Tail Calls In Go","description":"This article was written for and published by Gopher Academy\nI was looking at a code sample that showed a recursive function in Go and the writer was very quick to state how Go does not optimize for recursion, even if tail calls are explicit. I had no idea what a tail call was and I really wanted to understand what he meant by Go was not optimized for recursion.","link":"https://www.ardanlabs.com/blog/2013/09/recursion-and-tail-calls-in-go_26.html","owner":"William Kennedy"},{"title":"Web Payments and the World Banking Conference","description":"The standardization group for all of the banks in the world (SWIFT) was kind enough to invite me to speak at the world’s premier banking conference about the Web Payments […]","link":"http://manu.sporny.org/2013/sibos/?utm_source=rss&utm_medium=rss&utm_campaign=sibos","owner":"Manu Sporny"}]