[{"title":"Continuous Deployment System","description":"\n<p>This is one of the coolest and important thing we recently built at HackerEarth. \nWhat’s so cool about it? Just have a little patience, you will soon \nfind out. But make sure you read till the end :)</p>\n\n<p>I will try to make this post as resourceful, and clear so \nthat people who always wondered how to implement a <a href=\"http://en.wikipedia.org/wiki/Continuous_integration\">Continuous Deployment \nSystem(CDS)</a> can gain\ninsights.</p>\n\n<p>At HackerEarth, we iterate over our product quickly and roll out new \nfeatures as soon as they are production ready. In last two weeks, we deployed\n100+ commits in production, and a major release is scheduled to be launched\nwithin a few days comprising over 150+ commits. Those commits consists of\nchanges to backend app, website, static files, database and many more. We have\nover a dozen different types of servers running e.g. webserver, code-checker\nserver, log server, wiki server, realtime server, NoSQL server, etc. And all of\nthem are running","link":"http://engineering.hackerearth.com/2013/08/05/continuous-deployment-system/","owner":"Gusto"},{"title":"Gustavo's IEEE-754 Brain Teaser","description":"Back in June, Gustavo Niemeyer posted the following question on his Labix.org blog:\nAssume uf is an unsigned integer with 64 bits that holds the IEEE-754 representation for a binary floating point number of that size.\nHow can you tell if uf represents an integer number?\nI can&rsquo;t talk for you, but I write business applications. I just don&rsquo;t have the background to quickly knock out an answer for a question like this.","link":"https://www.ardanlabs.com/blog/2013/08/gustavos-ieee-754-brain-teaser.html","owner":"Wilfred Hughes"},{"title":"Internship experience @Wingify","description":"When I got an opportunity of interning with the engineering team at Wingify it made me ecstatic because of an exciting office with…","link":"https://engineering.wingify.com//posts/internship-experience-at-wingify/","owner":"Wimdu"}]