[{"title":"Analyzing S3 and CloudFront Access Logs with AWS RedShift","description":"<p>It&#39;s not really a surprise that we deal with fairly high volumes of user\ntraffic at theScore. We use AWS for pretty much all of our hosting needs and\ntheir two object distribution services - CloudFront and S3 - are two of the\nmost heavily used offerings in our environment. S3 provides file storage for\nessentially unlimited data, split across as many &quot;buckets&quot; as you would like\nto create. Separate from that is CloudFront, which is a content distribution\nnetwork similar to Akamai or Fastly. CloudFront points at one or more origins,\nand adheres to standard HTTP caching headers. Typically we will deploy S3\nbuckets or application servers behind CloudFront &quot;distributions&quot; - this allows\nthe majority of HTTP requests to our properties be soaked up by CloudFront\nedge servers.</p>\n\n<p>On a daily basis this works very well for us. The challenge comes though when\nwe need to perform any analysis on these logs. The S3 and CloudFront logs for\nus are easily terabytes of data","link":"https://techblog.thescore.com/2014/05/14/analyzing-s3-and-cloudfront-access-logs-with-redshift/","owner":"Teespring"},{"title":"Toggle Unity3D Sprites On Click","description":"\n                    <p>When creating a game there is often the need to create a toggle. An obvious example might be for a volume controller. Click the sprite to turn the volume on, and click the same sprite to turn the volume off.</p>\n<p>The best way to accomplish this task is to create a sprite game object that has a script with two public sprite variables. In the Unity editor add one sprite that will represent the on toggle position and another sprite that will represent the off toggle position.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/05/toggle-unity3d-sprites-on-click/'>Toggle Unity3D Sprites On Click</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2014/05/toggle-unity3d-sprites-on-click/","owner":"Nelson Elhage"}]