[{"title":"\nRedis cluster, no longer vaporware.\n","description":"The first commit I can find in my git history about Redis Cluster is dated March 29 2011, but it is a “copy and commit” merge: the history of the cluster branch was destroyed since it was a total mess of work-in-progress commits, just to shape the initial idea of API and interactions with the rest of the system.\n","link":"\nhttp://antirez.com/news/79\n","owner":"Andrey Akinshin"},{"title":"Updating Your Ionic Framework Project and CLI","description":"\n                    <p>The developers at <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> are constantly releasing updates to both their CLI and base install. With great new features and fixes in every release, you’re going to find yourself wanting to upgrade frequently. But how does one do this?  As of right now there is no magical all in one <code>ionic update</code> command.</p>\n<p>These are the steps to update your CLI and base library for a given project.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/10/updating-ionic-framework-project-cli/'>Updating Your Ionic Framework Project and CLI</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2014/10/updating-ionic-framework-project-cli/","owner":"Nelson Elhage"},{"title":"Using an API - Trakt.tv example","description":"<p>A lot of websites are generating data which could be really useful outside of a\nweb browser. Having the weather shown on your smartphone&rsquo;s lock-screen, the\ndelay until your next bus… How can we use this from an application?</p>\n\n<p>This article will explain what&rsquo;s behind these hidden data flows, and how to\nuse them. For this purpose, I&rsquo;ll use <a href=\"http://trakt.tv\">Trakt.tv</a> as an example.\nIf you don&rsquo;t know it: Trakt allows you to manage your movie/TV series library,\nkeep track of watch progress, your ratings, comments… and see those of other\npeople.</p>\n\n<p>Some code will show how to send such requests. It will be written in\n<a href=\"http://ruby-lang.org/\">Ruby</a>.</p>","link":"https://enoent.fr/posts/using-an-api-trakt-dot-tv-example/","owner":"Manu Sporny"}]