[{"title":"Background Processing: Use Einhorn to Spawn and Manage Worker Processes","description":"<p>Most modern web applications have a background processing subsystem. In other words,\nwhenever something does not need to be done in the web request (i.e. sending a\nwelcome email when a new user signs up), it can be queued up and processed\nlater outside of the request-response cycle. This allows the web requests to\nbe fast and responsive.</p>\n\n<h2>Anatomy of a Background Processing System</h2>\n\n<p>A background processing system usually consists of the following:</p>\n\n<p><strong>Queue</strong> is where the &quot;jobs&quot; are stored till they&#39;re processed. A job contains\nthe data necessary for the task at hand (i.e. we need the <code>user_id</code> to look up the\nuser&#39;s email in our database before sending a welcome email), as well as some\nmeta data (i.e. the time the job entered into the queue).</p>\n\n<p><strong>Producers</strong> put jobs into the queue. For example, the request that handles\nuser sign-ups can produce a new job for each successful sign-up so a welcome email\nw","link":"https://techblog.thescore.com/2014/10/20/background-processing-use-einhorn-to-spawn-and-manage-workers/","owner":"theScore"},{"title":"First Monthly Challenge: Elasticsearch!","description":"<p>TrackMaven has begun hosting a <a href=\"http://www.meetup.com/TrackMaven-Monthly-Challenge/\">Monthly Challenge meetup</a>! Each month, we will name a general topic, a new technology, or something in between. We'll collect a few resources and examples to get everyone started (hence this post), then we'll meet up in a month to share short presentations on everyone's new projects.</p>\n<p>Our first topic is <strong>Elasticsearch</strong>, an incredibly powerful search and analytics engine. Go <a href=\"http://www.elasticsearch.org/overview/elasticsearch\">here</a> for a high level, buzzword-heavy overview, or just jump into <a href=\"http://www.elasticsearch.org/guide/en/elasticsearch/guide/current/\">the documentation</a> if you're feeling bold.</p>\n<p>Built on top of <a href=\"http://lucene.apache.org/core/\">Lucene</a>, Elasticsearch is most frequently used to add full text search functionality; it comes out of the box with a rich query language that supports fuzzy matching and advanced <a","link":"http://engineroom.trackmaven.com/blog/first-monthly-challenge-elasticsearch/","owner":"TrackMaven"}]