[{"title":"Blogging the developer's way","description":"<p>Our last post was about migrating <a href=\"http://blog.8thcolor.com/en/2014/05/migrate-from-wordpress/\">from WordPress to Jekyll</a>. Although the engine is pleasant and has a great design, the main benefit of the move is actually something else.</p>\n\n<p>Of course, we’ll need blog hosting services before we can start writing anything.</p>\n\n<h1 id=\"hosting\">Hosting</h1>\n<p>One of the many features of Jekyll is that it eventually generates simple HTML and CSS files. This means that you will be able to use any web server to host the site. The ruby part is only used at build time. Take the content of your <code class=\"highlighter-rouge\">_site</code> folder and upload it. This is a simple task, but will still require a server and a deploy procedure (it may involve keys or passwords and yes, “upload this folder using SFTP to that server” is a procedure).</p>\n\n<p>GitHub offers a nice alternative as <a href=\"https://pages.github.com/\">GitHub Pages</a>. GitHub Pages allows you to serve any s","link":"http://blog.8thcolor.com/en/2014/06/blogging-development-cycle/","owner":"PubNub:"},{"title":"Building Products at SoundCloud —Part I: Dealing with the Monolith","description":"Most of SoundCloud’s products are written in Scala, Clojure, or JRuby. This wasn’t always the case. Like other start-ups, SoundCloud was…","link":"https://developers.soundcloud.com/blog/building-products-at-soundcloud-part-1-dealing-with-the-monolith","owner":"Soshace"},{"title":"What you need to know about software process and tools as a non-tech product owner - Part 2","description":"In the first part, we discussed the design and project management aspects of the software development process. Here is the link to the complete post. If you have not already read it, please consider reading it first for better continuity.\nCode Hosting &amp; Version Control The code that programmers write is generally stored in text files. Over time, as they add features, the code in these files is modified and every modification renders a new version of your product.","link":"https://crypt.codemancers.com/posts/2014-06-11-what-you-need-to-know-about-software-process-and-tools-as-a-non-tech-product-owner-part-2/","owner":"Codelitt"}]