[{"title":"Implement A Barcode Scanner Using Ionic Framework","description":"\n                    <p>I recently found myself needing to scan barcodes in one of my apps. More specifically I needed to scan quick response (QR) codes. After doing some searching I found that <a href=\"http://ngcordova.com/\">ngCordova</a> had an extension for the Apache Cordova plugin <a href=\"https://github.com/wildabeast/BarcodeScanner/\">BarcodeScanner</a> which has the ability to scan barcodes in the following formats:</p>\n<ul>\n<li>QR Code</li>\n<li>Data Matrix</li>\n<li>UPC E</li>\n<li>UPC A</li>\n<li>EAN 8</li>\n<li>EAN 13</li>\n<li>Code 128</li>\n<li>Code 39</li>\n<li>ITF</li>\n</ul>\n<p>Pretty much all the formats anyone would ever need. The plugin itself makes use of the very popular <a href=\"https://github.com/zxing/zxing\">ZXing</a> library.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/09/implement-barcode-scanner-using-ionic-framework/'>Implement A Barcode Scanner Using Ionic Framework</a> appeared first","link":"https://www.thepolyglotdeveloper.com/2014/09/implement-barcode-scanner-using-ionic-framework/","owner":"Nelson Elhage"},{"title":"So You Want Another PostgreSQL Database? (Part 1)","description":"<h2>Streaming replication with PostgreSQL 9.3 on Amazon EC2</h2>\n<p>They grow up so fast, don't they? It seems like just yesterday you were setting up your PostgreSQL server and tweaking settings you barely understood to try to get the most out of your database. But now, you've got a lot more data and your traffic continues to rise, and you've decided it's time your database had a few companions to help it out. Fortunately, PostgreSQL 9 makes it rather simple to set up a primary database that can handle writes, and any number of replica databases which are read-only, stay in sync with the primary, and can be promoted to the primary in the event of failure on your primary database.</p>\n<p>There are a lot of factors that come into play when you decide to scale your database infrastructure and they vary wildly from project to project. These are outside the scope of this post, and I'm is going to assume you have already decided on a primary/replica database setup. </p>\n<h2>So what are we g","link":"http://engineroom.trackmaven.com/blog/so-you-want-another-postgresql-database-part-1/","owner":"Toptal"}]