[{"title":"Building a Testable D3 Charting Application Within Angular.js","description":"<h2>Why this post?</h2>\n<blockquote>\n<ul>\n<li>\n<p>Most of the examples on d3js.org are much smaller, proof of concept applications which funcion well as a single page app but not necessarily in the reuseable context of a larger, more complex app.</p>\n</li>\n<li>\n<p>This post assumes familiarity with Angular.js' concepts of Controllers, Directives, and Services, Jasmine's testing framework, and d3 concepts like axis, scale, and path.</p>\n</li>\n<li>\n<p>d3.js' customizeability can rapidly lead to a fragile codebase within larger applications. We provide some suggestions on how to modularize and then test a charting application.</p>\n</li>\n</ul>\n</blockquote>\n<p><em>nb: At TrackMaven, we use Coffeescript+Angular to manage our frontend.</em></p>\n<p>Graphing is a core feature of TrackMaven's application. As we added more graph types, it became obvious that a monolithic hunk of coffeescript was not an ideal foundation.</p>\n<p>Our solution was to separate the graphing bloc into separate factorie","link":"http://engineroom.trackmaven.com/blog/building-a-testable-d3-charting-application-within-angularjs/","owner":"Toptal"},{"title":"Great Tools To Improve Android Development","description":"\n                    <p>I’ve been developing Android apps for a few years now. During this time, I’ve had the opportunity to try a huge selection of software, some of which didn’t work as well as I’d hoped and some of which that exceeded my expectations.</p>\n<p>Although these tools are my personal preference, I am confident they will change your Android development strategies and how you develop your apps.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/10/great-tools-improve-android-development/'>Great Tools To Improve Android Development</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2014/10/great-tools-improve-android-development/","owner":"Nelson Elhage"}]