[{"title":"The Toiling Programmer: Succeeding as a Developer","description":"<p>Not sure if you&#39;re a toiling programmer? Ask yourself these questions:</p>\n\n<ul>\n<li>Do you feel like you&#39;re drowning, that there&#39;s no end in sight?</li>\n<li>Do you get stuck on long running problems (1 or more days long)?</li>\n<li>Are you unsure what needs to be done on a <a href=\"http://en.wikipedia.org/wiki/Issue_tracking_system#Issues\">ticket</a>, and yet you continue to work on it?</li>\n<li>Do you often get feedback that functionality is missing after you&#39;ve shipped the work?</li>\n</ul>\n\n<p>That feeling of dread is cancerous towards your work, your relationships at work and your well being. I&#39;ve personally experienced it many times during my short career -- it&#39;s not a fun experience and that&#39;s why I am writing about it.</p>\n\n<p><strong>Work doesn&#39;t have be like that</strong>. You can stop the cycle and feel way better about yourself!</p>\n\n<h2>Manage expectations of other people</h2>\n\n<p>For me, one of the feelings of dread comes from thinking of ","link":"https://techblog.thescore.com/2014/10/22/succeeding-as-a-developer/","owner":"Teespring"},{"title":"Use Crosswalk With Ionic Framework Android Apps","description":"\n                    <p>It is no secret, that many Android devices handle web pages poorly. Unless you have Android 4.4, your device is using whatever proprietary browser your manufacturer has decided to give you. The lucky ones who are running Android 4.4 tend to have higher end Nexus or Motorola devices.</p>\n<p>This isn’t the end of the road for your hybrid development journeys. Using <a href=\"https://crosswalk-project.org/\">Crosswalk</a> in your application replaces the default web runtime with the runtime 4.4 users are already enjoying. The best part is that this will work with Apache Cordova, Phonegap, and <a href=\"https://www.ionicframework.com/\">Ionic Framework</a>. For the sake of this article I’m going to aim it towards Cordova and Ionic Framework, but Phonegap should be pretty similar.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/10/use-crosswalk-ionic-framework-android-apps/'>Use Crosswalk With","link":"https://www.thepolyglotdeveloper.com/2014/10/use-crosswalk-ionic-framework-android-apps/","owner":"Nelson Elhage"}]