[{"title":"Make List Items Swipeable In Ionic Framework","description":"\n                    <p>It is an expectation of modern mobile applications to have a fancy UI with smooth animations and gesture controls. Users want to be able to drag things, see smooth transitions, popups and other neat UI wizardry.</p>\n<p>A common UI feature, as found in apps like Gmail, are swipe-able list items. Whether it be swiping to show buttons or swiping to perform tasks, it adds an additional layer of coolness.</p>\n<p>Using <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> on top of <a href=\"http://cordova.apache.org/\">Apache Cordova</a> gives us access to swipe-able elements in the ion-list directive.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/12/make-list-items-swipeable-ionic-framework/'>Make List Items Swipeable In Ionic Framework</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n         ","link":"https://www.thepolyglotdeveloper.com/2014/12/make-list-items-swipeable-ionic-framework/","owner":"Nelson Elhage"},{"title":"So you want another PostgreSQL database? (part 3)","description":"<p><strong>Read <a href=\"/blog/so-you-want-another-postgresql-database-part-1/\">Part 1</a> or <a href=\"/blog/so-you-want-another-postgresql-database-part-2/\">Part 2</a></strong></p>\n<h2>Tuning your PostgreSQL servers on Amazon EC2</h2>\n<p>It will probably come as no surprise that the settings that are best for your PostgreSQL cluster are heavily dependent on your data and how you're using it. No one can say what will work best for you in every single use case, and it's up to you to profile your database to determine what does and does not work for you. With that being said, a great starting point for general use cases can be found in Christophe Pettus' talk <a href=\"http://thebuild.com/presentations/not-your-job.pdf\">PostgreSQL when it's not your job</a>. If you're completely new to tuning your Postgres instances, I highly recommend using these settings as an initial profile point.</p>\n<p>Here's a quick summary of his suggestions:</p>\n<div class=\"highlight\"><pre><span></span>Memory set","link":"http://engineroom.trackmaven.com/blog/so-you-want-another-postgresql-database-part-3/","owner":"Toptal"}]