[{"title":"Securing Your Apache phpMyAdmin Installation","description":"\n                    <p>If you’re using a LAMP (Linux, Apache, MySQL, PHP) stack, chances are you’re going to be using phpMyAdmin. By default, your phpMyAdmin installation is not very secure and chances are your MySQL database has a treasure trove of excellent information for a malicious user.</p>\n<p>By following these steps, you can make it significantly tougher for your phpMyAdmin installation to be exploited.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/09/securing-your-apache-phpmyadmin-installation/'>Securing Your Apache phpMyAdmin Installation</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2014/09/securing-your-apache-phpmyadmin-installation/","owner":"Nelson Elhage"},{"title":"Using Hub and Fish to Turn GitHub Issues into Pull Requests","description":"<h2>Or: How I Learned to Stop Worrying and Love ZenHub</h2>\n<p>Lately we've been making use of <a href=\"https://www.zenhub.io/\">ZenHub</a> here at TrackMaven for tracking our engineering tasks as GitHub issues move from the backlog into our current cycle, become WIP, enter QC and eventually get merged in. Although ZenHub has certainly had its growing pains (they're still in open beta), it's been great to get GitHub issues organized in one place.</p>\n<p>One issue we've had in tracking our GitHub work, however, has been the inherent duplication between issues and pull requests. ZenHub, <a href=\"https://huboard.com/\">HuBoard</a> and other tools have no ability to filter to <em>only</em> issues or <em>only</em> pull requests - and in fact, most of the time we wouldn't want to do so, since individual issues sometimes lead to multiple separate pull requests needed to tackle them.</p>\n<p>What we really needed was a way to <em>turn issues into pull requests</em> on demand, thus avoiding a lot ","link":"http://engineroom.trackmaven.com/blog/using-hub-and-fish-to-turn-github-issues-into-pull-requests/","owner":"Toptal"}]