[{"title":"Building Products at SoundCloud—Part III: Microservices in Scala and Finagle","description":"In the first two parts of this series, we talked about how SoundCloud started breaking away from a monolithic Ruby on Rails application into…","link":"https://developers.soundcloud.com/blog/building-products-at-soundcloud-part-3-microservices-in-scala-and-finagle","owner":"Soshace"},{"title":"Fast Storage with RocksDB","description":"In November last year, I started developing an infrastructure that would allow us to\ncollect, store, search and retrieve high volume data…","link":"https://engineering.wingify.com//posts/fast-storage-with-rocksdb/","owner":"Wimdu"},{"title":"Saving Data With Ionic Framework","description":"\n                    <p>Coming from native Android and SQLite, the concept of universal data storage on local devices has been different. <a href=\"https://cordova.apache.org/\">Apache Cordova</a> and <a href=\"https://ionicframework.com/\">Ionic Framework</a>, being as awesome as they are, support HTML5 local storage calls. This allows us to store and retrieve data without the use or knowledge of SQL and on any platform we plan to use.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2014/06/saving-data-with-ionicframework/'>Saving Data With Ionic Framework</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2014/06/saving-data-with-ionicframework/","owner":"Nelson Elhage"},{"title":"Scrutinize your code in style","description":"<p><em>This is the second in a series of posts about the design of Iron, our new code\nreview tool. You can read the first post <a href=\"/code-review-that-isnt-boring/\">here</a>.\nAlso, I should give credit where credit is due. While I’ve been involved in some\nof the design discussions, the real work has been done by Stephen Weeks,\nValentin Gatien Baron, Olin Shivers (yes, that Olin Shivers. He’s joining us for\npart of his sabbatical) and Mathieu Barbin.</em></p>\n\n","link":"https://blog.janestreet.com/scrutinizing-your-code-in-style/","owner":"InVision"}]