[{"title":"Data science, big data, machine learning and deep learning","description":"<p>Nowadays, it is popular to claim that with enough personal data, scientists are able to understand and reveal every detail about your personality using modern machine learning techniques.</p>\n\n<blockquote>\n  <p><strong>“Wow! This seems like some kind of alien technology! Is that true?”</strong>\nMaybe</p>\n</blockquote>\n\n<p>Predominantly, it depends on the <em>quantity</em> and <em>quality</em> of personal information available about you. Quantity of course matters, but what about the quality of the information? This is where the real challenge lies. Quality is simply the connection between information and prediction: the tighter the connection, the more accurate the prediction will be.</p>\n\n<blockquote>\n  <p><strong>“To predict what I currently have underneath my bedside table, is it important to know the exact temperature in Dubai?”</strong>\nNope</p>\n</blockquote>\n\n<blockquote>\n  <p><strong>“And my age and gender?”</strong>\nMaybe. It’s not extremely important, but it’s a valuable pi","link":"http://engineering.intenthq.com/2015/05/data-science-big-data-machine-learning-and-deep-learning/","owner":"Intent HQ"},{"title":"Draw A Graphic To A SurfaceView Using Native Android","description":"\n                    <p>There are many ways to create mobile Android games. For example you can use a framework like <a href=\"https://www.thepolyglotdeveloper.com/category/unity3d/\">Unity3D</a> or Unreal Engine, or you can use native APIs like the SurfaceView canvas or OpenGL. All the different methods have their pros and cons.</p>\n<p>In this particular example we’re going to see how to render graphics to the Android screen by extending the SurfaceView class and a canvas.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/05/draw-a-graphic-to-a-surfaceview-using-native-android/'>Draw A Graphic To A SurfaceView Using Native Android</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/05/draw-a-graphic-to-a-surfaceview-using-native-android/","owner":"Nic Raboy"}]