[{"title":"Dr. Pucketlove - Or, How I Learned to Stop Worrying and Love Parquet (partitioning)","description":"<blockquote>\n  <p>Parquet + Bucket = Pucket.</p>\n</blockquote>\n\n<p>Pucket is a Scala library which provides a simple partitioning system for Parquet. But what is Parquet and why does it need partitioning when it already supports filtering? In this post I will attempt to explain Parquet, partitioning in Hadoop, and the motivation and design of Pucket. If you’re not interested in the background, you can skip straight to some <a href=\"#tldr\">simple code examples</a> or go to the <a href=\"https://github.com/intenthq/pucket\">GitHub repository</a>.</p>\n\n<h2 id=\"background\">Background</h2>\n\n<h3 id=\"what-is-parquet-and-why-should-i-care\">What is Parquet and Why Should I Care?</h3>\n\n<p>Parquet is a binary columnar storage format for Hadoop created by Cloudera and Twitter designed to store large volumes of analytics data. Here’s a description plucked straight from the website:</p>\n\n<blockquote>\n  <p>Apache Parquet is a columnar storage format available to any project in the Hadoop ecosystem, reg","link":"http://engineering.intenthq.com/2015/08/pucket/","owner":"Intent HQ"},{"title":"HOW TO SET LOCAL AOSP GERRIT SERVER – PART 3","description":"Hi there. This is the last post in the series of a local AOSP gerrit server setup. In this post, We’ll finalize the configuration of Gerrit, add new branches for development and see how to maintain the setup. In the last post, we’ve finished creating the project in Gerrit. When we develop locally, we should […]","link":"https://nativeguru.wordpress.com/2015/08/18/how-to-set-local-aosp-gerrit-server-part-3/","owner":"Ramon Fried"},{"title":"HOWTO: Get tenure","description":"\n","link":"http://matt.might.net/articles/tenure/","owner":"Matt Might"},{"title":"No cheating allowed!!","description":"","link":"http://engineering.khanacademy.org/posts/no-cheating-allowed.htm","owner":"Khan Academy"},{"title":"Putting all pieces together and shipping with Codeship (part III)","description":null,"link":"http://piotrpasich.com/putting-all-pieces-together-and-shipping-with-codeship-part-iii/?utm_source=rss&utm_medium=rss&utm_campaign=putting-all-pieces-together-and-shipping-with-codeship-part-iii","owner":"Piotr Pasich"}]