[{"title":"Implement A Barcode Scanner Using React Native","description":"\n                    <p>Previously I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2015/09/use-the-ios-camera-in-your-react-native-mobile-app/\">using the device camera</a> in your <a href=\"https://facebook.github.io/react-native/\">React Native</a> mobile application. However, what if we wanted to go a step further and start scanning barcodes?</p>\n<p>This is not a problem because the <a href=\"https://github.com/lwansbrough/react-native-camera\">react-native-camera</a> component we used in the last tutorial also supports barcode scanning.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/10/implement-a-barcode-scanner-using-react-native/'>Implement A Barcode Scanner Using React Native</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/10/implement-a-barcode-scanner-using-react-native/","owner":"Nelson Elhage"},{"title":"Introducing SoundCloud JavaScript SDK 3.0.0","description":"We are happy to announce version 3.0.0 of our SoundCloud JavaScript SDK. The new SDK improves stream security and content uploading…","link":"https://developers.soundcloud.com/blog/introducing-javascript-sdk-3-0-0","owner":"Soshace"},{"title":"Save your DNS and your SANITY when using VPN on a Mac (without rebooting)","description":"There was time when using my Mac was bliss form a DNS perspective, I never had to worry about my routing tables getting corrupted. I could always rely on hosts getting resolved, life was good! And then a combination of … ","link":"http://feedproxy.google.com/~r/CodeBetter/~3/J8PpJwZbXIQ/","owner":"CockroachDB"},{"title":"Tips for Dealing with Developer Stress","description":"This article identifies several types of stress that developers face on a daily basis and explains how they may impact effectiveness. We’ll cover tips for identifying the root cause of the stress and offer suggestions on how to manage them.","link":"https://www.airpair.com/javascript/posts/tips-for-dealing-with-developer-stress","owner":"Airbrake"},{"title":"Use Apache HTTP Client on Android SDK 23","description":"<p>With the Android M SDK (API 23), Google removed the Apache HTTP Client library.\nIt was deprecated since API 22, and Google recommanded to use\n<code>HttpURLConnection</code> instead since API 9. While the classes are still bundled in\nAndroid 6 ROMs, it won&rsquo;t be long until we see them completely go away.</p>\n\n<p>Some applications are still relying on this library, and need to be updated to\nuse the SDK 23, without having time/budget/whatever required to switch from\nHTTP Client. While I strongly recommend you to still take time to move to\nsomething else (there are many high-level libraries, like\n<a href=\"http://square.github.io/okhttp/\">OkHttp</a> or\n<a href=\"https://github.com/koush/ion\">Ion</a>, or you can use <code>HttpURLConnection</code>\nto keep a low-level access), there is a way to use the Apache library\nwhile using the SDK 23.</p>","link":"https://enoent.fr/posts/use-apache-http-client-on-android-sdk-23/","owner":"Manu Sporny"}]