[{"title":"\nCommit messages are not titles\n","description":"Nor subjects, for what matters. Everybody will tell you to don't add a dot at the end of the first line of a commit message. I followed the advice for some time, but I'll stop today, because I don't believe commit messages are titles or subjects. They are synopsis of the meaning of the change operated by the commit, so they are small sentences. The sentence can be later augmented with more details in the next lines of the commit message, however many times there is *no* body, there is just the first line. How many emails or articles you see with just the subject or the title? Very little, I guess. So for me it is like:\n","link":"\nhttp://antirez.com/news/90\n","owner":"Antirez"},{"title":"Babel in Khan Academy's i18n Toolchain","description":"","link":"http://engineering.khanacademy.org/posts/i18n-babel-plugin.htm","owner":"Khan Academy"},{"title":"Process the whole Wikidata in 7 minutes with your laptop (and Akka Streams)","description":"<p>Here at Intent HQ we use Wikipedia and Wikidata as sources of data. They are very important to us because they both encode an enormous amount of information in several languages that we use to build our <a href=\"https://www.intenthq.com/the-topic-graph/\">Topic Graph</a>.</p>\n\n<p>Although the current process we have to process these dumps works well enough, we are always interested in finding new and better ways of doing our work. It’s because of that that we were very excited when we saw the Reactive Streams initiative <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>. We thought it could be used to process the largest encyclopædia in the world <sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>.</p>\n\n<p>One may think about using some of the (alert, buzzword landing) Big Data tools everybody is using nowadays. Wikidata and Wikipedia are huge (the english version of Wikipedia, for example, has over 4.8 million articles<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"f","link":"http://engineering.intenthq.com/2015/06/wikidata-akka-streams/","owner":"Intent HQ"}]