[{"title":"A Note on the DDoS Attacks","description":"Recently, several sites have noticed DDoS attacks from torrent clients in China. These attacks are not originating in the torrent ecosystem, but are caused by DNS servers returning incorrect IP addresses for well-known BitTorrent trackers. While the identity of the perpetrators and the motivation remain unclear, we here at BitTorrent would like to share some […]","link":"https://engineering.bittorrent.com/2015/01/29/a-note-on-the-ddos-attacks/","owner":"Bitly"},{"title":"Mixmax + Text Messaging: Embed an SMS contact form in your email","description":"<p>At Mixmax, we&rsquo;re obsessed with email and believe it&rsquo;s still one of the best ways to reach out to customers, partners, and leads outside of your company. As a professional, sometimes you want to make yourself immediately available to business contacts beyond email. Being directly in-reach is especially important when helping an important customer, building a new partnership, or closing a deal. Now with Mixmax, you can embed an SMS contact form in email for others to reach you quickly without hunting for contact info.</p>\n\n<p class=\"poet-read-more\"><a href=\"/blog/mixmax-text-messaging-embed-an-sms-contact-form-in-your-email\" title=\"Read more of Mixmax + Text Messaging: Embed an SMS contact form in your email\">Continue reading</a></p>","link":"https://mixmax.com/blog/mixmax-text-messaging-embed-an-sms-contact-form-in-your-email","owner":"Microsoft Python Engineering"},{"title":"The Fibonacci Sequence Printed With JavaScript","description":"\n                    <p>If you’re familiar with the material I write on my blog, you’ll probably be confused at why I’m making such a post. Anyone who has been a part of a Computer Science program at a university will probably have dabbled with Fibonacci in their first semester of school. However, many Computer Science graduates don’t realize that this is a common job interview question regardless of the company or job level that you’re applying for. Whether you’re applying for a new graduate position or a senior level position, there is a good chance you’re going to be screened with a question on this topic.</p>\n<p>With that said, I think this can be a refresher to anyone going through the interview process for a programming or software engineering position.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/01/fibonacci-sequence-printed-javascript/'>The Fibonacci Sequence Printed With JavaScript</a> appeared ","link":"https://www.thepolyglotdeveloper.com/2015/01/fibonacci-sequence-printed-javascript/","owner":"Nelson Elhage"}]