[{"title":"DIY Ruby CPU profiling - Part IV","description":"In Part I we saw how CPU profilers work, in Part II we learned how to measure execution time of programs using CPU time and Wall time and in Part III we learned how to use Ruby&rsquo;s TracePoint API to trace method calls and returns in Ruby VM. We also started building our DiyProf gem. It&rsquo;s recommended to read those first before you continue. In this part we&rsquo;re going to create a simple call graph visualization using the data we collected using the TracePoint API.","link":"https://crypt.codemancers.com/posts/2015-07-18-diy-ruby-cpu-profiling-part-iv/","owner":"Codelitt"},{"title":"Introducing Incremental","description":"<p>I’m pleased to announce the release of\n<a href=\"https://github.com/janestreet/incremental\">Incremental</a> (well\ncommented mli\n<a href=\"https://github.com/janestreet/incremental/blob/master/src/incremental_intf.ml\">here</a>),\na powerful library for building <em>self-adjusting computations</em>, <em>i.e.</em>,\ncomputations that can be updated efficiently when their inputs change.</p>\n\n","link":"https://blog.janestreet.com/introducing-incremental/","owner":"InVision"},{"title":"Using A Pin Dialog In Your Ionic Framework Mobile App","description":"\n                    <p>One of my <a href=\"https://www.twitter.com/nraboy\">Twitter</a> followers recently asked me how to properly use a pin dialog in their <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> mobile application. Although I’ve already created a similar article regarding <a href=\"https://www.thepolyglotdeveloper.com/2014/09/add-pin-code-unlock-ionicframework-app/\">creating a pin unlock screen</a> in an Ionic Framework application, I figured it might be a good idea to show how to do this with an actual dialog instead.</p>\n<p>Using the Apache Cordova <a href=\"https://github.com/Paldom/PinDialog\">PinDialog</a> plugin by Paldom we can use native dialogs in our application and accept passwords.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/07/using-a-pin-dialog-in-your-ionic-framework-mobile-app/'>Using A Pin Dialog In Your Ionic Framework Mobile App</a> appeared first on <a rel='nofoll","link":"https://www.thepolyglotdeveloper.com/2015/07/using-a-pin-dialog-in-your-ionic-framework-mobile-app/","owner":"Nelson Elhage"}]