[{"title":"3 Takeaways from Point Nine’s CTO Event on Scaling Up Tech and Tech Teams","description":"","link":"https://medium.com/unexpected-token/3-takeaways-from-point-nine-s-cto-event-on-scaling-up-tech-and-tech-teams-bf617a8ec175?source=rss----2d2624499d2---4","owner":"eFounders"},{"title":"Email tracking 101: Why you need read receipts for your emails","description":"<p>You&rsquo;ve been waiting three days for someone to respond to your email, and now you’re faced with a dilemma: do you continue waiting, send them a reminder, or give up altogether?</p><p class=\"poet-read-more\"><a href=\"/blog/email-tracking-101-why-you-need-read-receipts-for-your-emails\" title=\"Read more of Email tracking 101: Why you need read receipts for your emails\">Continue reading</a></p>","link":"https://mixmax.com/blog/email-tracking-101-why-you-need-read-receipts-for-your-emails","owner":"Mixmax"},{"title":"Ending My Adventure At UC Merced And Starting Fresh","description":"\n                    <p>Back in 2010 I was hired by the <a href=\"https://www.ucmerced.edu/\">University of California, Merced</a> (UC Merced) after having first worked as a student employee for two years prior.</p>\n<p>I was hired as part of the Student Information Systems (SIS) team of IT. Although my responsibilities spanned across all departments, I primarily supported the needs of the Undergraduate Admissions department.</p>\n<p>I designed, developed, and supported many of the applications to address the growing needs of the department. These applications stretched from simple information management systems to complex automatic review processing systems using a variety of programming languages such as Java, ColdFusion, PLSQL, and Shell.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/05/ending-my-adventure-at-uc-merced-and-starting-fresh/'>Ending My Adventure At UC Merced And Starting Fresh</a> appeared fir","link":"https://www.thepolyglotdeveloper.com/2015/05/ending-my-adventure-at-uc-merced-and-starting-fresh/","owner":"Nic Raboy"}]