[{"title":"Creating a long distance phone dialer with Twilio's TwiML","description":"<p>This winter vacation, I had a bunch of spare time at home with my parents. It turns out that my parents call to Romania a lot – especially during the holiday season. Since Romania is far away from here in Canada, if they were to use the local phone provider, Bell, they’d be destroyed with long distance charges (c’mon guys, it’s 2015!). Usually you’d go out and get calling cards, etc, but in the past, when i was still living with them, what I did to get around the high fees of Bell and the unreliability and inconvenience of calling cards is I set up Asterisk.</p>\n\n<p>Asterisk is a self-hosted PBX that can connect to SIP/IAX trunks provided by VoIP companies (I personally used to use <a href=\"http://unlimitel.ca\">Unlimitel</a>, they’re great). Problem with Asterisk is that it needs maintenance. It needs to run on a server, it’s very complicated, patches sometimes break backwards compatibility, etc etc. I needed something less involved that if I were to get hit by a bus and go silent (","link":"https://lg.io/2015/01/01/creating-a-long-distance-phone-dialer-with-twilios-twiml.html","owner":"Lambda the Ultimate"},{"title":"Hooks With Apache Cordova Mobile Applications","description":"\n                    <p>If you develop Apache Cordova applications long enough, you’re eventually going to notice little things that you feel you can improve in the development / deployment lifecycle. Making use of hooks in your Apache Cordova project can yield many great things for your project.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/01/hooks-apache-cordova-mobile-applications/'>Hooks With Apache Cordova Mobile Applications</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2015/01/hooks-apache-cordova-mobile-applications/","owner":"Nelson Elhage"}]