[{"title":"Monthly Challenge: Visualization","description":"<h2>Using CartoDB and Three.js for mapping</h2>\n<p>Our next monthly challenge is <strong>visualization</strong>! Although you could visualize data on just about anything in just about any way, for this post we're going to focus on <strong>mapping</strong> data geographically using two different tools:</p>\n<ul>\n<li>CartoDB: a great drag-and-drop solution for super quick and simple map creation - also a paid product that limits its free plan to 50MB of data!</li>\n<li>Three.js and WebGL Globe: for fancy 3D visualizations and an interactive globe onto which we can plot geographic data.</li>\n</ul>\n<p>A few other possible frameworks for mapping that we <em>won't</em> be covering in this post include:</p>\n<ul>\n<li>\n<p><a href=\"http://www.highcharts.com/\">Highcharts</a> is a library for creating quick interactive charts and has a separate product specifically for <a href=\"http://www.highcharts.com/products/highmaps\">creating maps</a>.</p>\n</li>\n<li>\n<p>At TrackMaven, we use <a href=\"http://d3j","link":"http://engineroom.trackmaven.com/blog/using-cartodb-and-threejs-for-mapping/","owner":"TrackMaven"},{"title":"Using Postman To Troubleshoot RESTful API Requests","description":"\n                    <p>A follower of my blog recently came to me asking for help with their <a href=\"http://magento.com/\">Magento</a> API service. If you’re unfamiliar with Magento, it is an Ecommerce solution by eBay that uses <a href=\"http://oauth.net/core/1.0a/\">Oauth 1.0a</a> to handle API requests. If you’ve been keeping up with my blog you’ll notice I had done a <a href=\"https://www.thepolyglotdeveloper.com/2014/11/understanding-request-signing-oauth-1-0a-providers/\">previous post</a> on Oauth 1.0a, and it was everything, but fun.</p>\n<p>So how does a newbie go about making quick tests to Oauth providers or RESTful APIs without a lot of stress?  If you’re using Google Chrome like I am, there is a nifty application called <a href=\"https://chrome.google.com/webstore/detail/postman-rest-client-packa/fhbjgbiflinjbdggehcddcbncdddomop\">Postman</a> which does very thorough API testing.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thep","link":"https://www.thepolyglotdeveloper.com/2015/01/using-postman-troubleshoot-restful-api-requests/","owner":"Nic Raboy"}]