[{"title":"\nA few things about Redis security\n","description":"IMPORTANT EDIT: Redis 3.2 security improved by implementing protected mode. You can find the details about it here: https://www.reddit.com/r/redis/comments/3zv85m/new_security_feature_redis_protected_mode/\n","link":"\nhttp://antirez.com/news/96\n","owner":"Antirez"},{"title":"Timezones in Python","description":"<p>After struggling for a while to determine how to convert from one timezone to another in Python I thought I&#39;d write a quick little guide on it. Even if the only person it helps is me a few months from now I&#39;ll consider it a success!</p>\n\n<p>It all started when I received the error <code>ValueError: Not naive datetime (tzinfo is already set)</code>. A little bit later I received the error <code>ValueError: astimezone() cannot be applied to a naive datetime</code>. It was about this time that I realized I needed to learn what was actually going on.</p>\n\n<h2>The naive datetime</h2>\n\n<p>Datetimes in Python can either be <code>Naive</code> or <code>Aware</code>. A naive datetime is a datetime that doesn&#39;t know its own timezone. It could be in <code>UTC</code>, it could be in <code>US/Eastern</code>, but it doesn&#39;t know. All it knows is which date and time that it has.</p>\n<div class=\"highlight\"><pre><code class=\"language-python\" data-lang=\"python\"><span class=\"kn\">import<","link":"https://techblog.thescore.com/2015/11/03/timezones-in-python/","owner":"theScore"},{"title":"Why Go Was the Right Choice for CockroachDB","description":"The first question many developers ask us is what our experience has been writing a distributed database in Go, a garbage-collected language. JVM garbage collection is notoriously expensive, so wouldn&#x2019;t we be risking CockroachDB&#x2019;s performance by building it in Go?\nThe fact is, when you&#x2019;re building a high performance, distributed system, you&#x2019;ve only got a handful of languages to choose from, with C++, Java, and Go topping the list. Java&#x2019;s known performance issues made it unappealing, and while many of us spent our careers developing in C++, the effort required to build our own libraries further complicated the already daunting task of writing a distributed database.","link":"https://www.cockroachlabs.com/blog/why-go-was-the-right-choice-for-cockroachdb/","owner":"CockroachDB"}]