[{"title":"Android Array Adapters — What most of the tutorials don’t tell you","description":"<p>Do a quick google search on the topic array adapter, custom array adapter, implementing array adapter, android custom list view, or extending array adapter. You would find that most of the results are tutorials on how you could extend the ArrayAdapter, that is a part of Android SDK, and implement your own custom array adapters. The thing with most of these tutorials is all of them get some of the basic things wrong.</p>\n\n<h2 id=\"adapter\">Adapter</h2>\n\n<p>What is an <em>Adapter</em> anyway? An adapter is an object that provides views for a list view. Whenever list view needs to draw a view at a particular list position, it gets it from the adapter. The adapter makes the view for that position and returns it. Since the adapter creates the views, it is necessary for it to also store the underlying data. So the adapters are all about this. <strong>They pack data and the logic for creating views out of the data.</strong> The data can be a cursor or a list of objects. To support these dif","link":"http://sudhagar.com/android/2015/03/30/android-array-adapters.html","owner":"Steve Yegge"},{"title":"Scaling Mixmax: From Monolithic to Microservices","description":"<p>In the next series of blog posts, we’ll open you up to the technical inner workings of Mixmax and discuss how we evolved it from a simple prototype into a successful product that scales to many thousands of users. In this first post, we’ll tell you about what happened when Mixmax went out-of-control viral and how we quickly diagnosed and fixed a key bottleneck.</p>\n\n<p class=\"poet-read-more\"><a href=\"/blog/scaling-mixmax-monolithic-to-microservices\" title=\"Read more of Scaling Mixmax: From Monolithic to Microservices\">Continue reading</a></p>","link":"https://mixmax.com/blog/scaling-mixmax-monolithic-to-microservices","owner":"Microsoft Python Engineering"},{"title":"Why GADTs matter for performance","description":"<p>When GADTs (<a href=\"http://en.wikipedia.org/wiki/Generalized_algebraic_data_type\">Generalized Algebraic Data\nTypes</a>) landed in\nOCaml, I wasn’t particularly happy about it. I assumed that it was the kind of\nnonsense you get when you let compiler writers design your programming language.</p>\n\n","link":"https://blog.janestreet.com/why-gadts-matter-for-performance/","owner":"InVision"}]