[{"title":"Create A Minesweeper Game With Native Android","description":"\n                    <p>So recently I was presented with a challenge. Make a Minesweeper game using native Android with no additional frameworks such as Unity3D or similar.</p>\n<p>Minesweeper via <a href=\"http://en.wikipedia.org/wiki/Minesweeper_%28video_game%29\">Wikipedia</a>:</p>\n<blockquote>\n<p>A single-player puzzle video game. The objective of the game is to clear a rectangular board containing hidden “mines” without detonating any of them, with help from clues about the number of neighboring mines in each field.</p>\n</blockquote>\n<p>This task can be accomplished many ways. For example we could choose to use OpenGL, a 2D canvas, or something else. In this particular tutorial we’re going to be using a 2D canvas because it is simple and acceptable for a game with minimal to no animations.;</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/05/create-a-minesweeper-game-with-native-android/'>Create A Minesweep","link":"https://www.thepolyglotdeveloper.com/2015/05/create-a-minesweeper-game-with-native-android/","owner":"Nelson Elhage"},{"title":"Linux Serviio start up script","description":"I created my own Serviio service script, I’m sharing it for reference and free usage here. If you don’t know Serviio and you need a Media Server in your home network, this is your best choice. check it out here. Actually, you only need to alter “/etc/default/serviio” with your username and path to Serviio installation. […]","link":"https://nativeguru.wordpress.com/2015/05/01/linux-serviio-start-up-script/","owner":"Radim Řehůřek"},{"title":"Reverse web proxy in ~50 lines of BASH","description":"<p>In the spirit of reinventing the wheel for fun, I hacked this together as a\nquick challenge to myself last week. It’s a little rough around the edges, but I\nthought it was too cute not to share. If you have any bug fixes, please post\nthem in the comments.</p>\n\n","link":"https://blog.janestreet.com/reverse-web-proxy-in-50-lines-of-bash/","owner":"InVision"},{"title":"Share Your Bag of Tricks","description":"<p>Everyone has specific tips and shortcuts that they have picked up from various sources, including the following:</p>\n\n<ul>\n<li>Trial &amp; error or self-discovery</li>\n<li>From a friend or colleague</li>\n<li>Reading books, blog posts, articles</li>\n<li>Watching videos, conferences</li>\n<li>Formal education</li>\n</ul>\n\n<p>Regardless of how one has gained these skills, it is obvious that they increase their effectiveness and efficiency at tasks. With enough exposure and time, one can amass an impressive assortment of skills, tips and shortcuts. We tend to call these people <em>veterans</em>/<em>experts</em>/<em>experienced</em>/<em>seniors</em>, amongst other words of praise and respect.</p>\n\n<p>This post is not directed towards a specific group of individuals, as the overarching message applies to everyone. It is common to find large visible gaps with respect to skills and/or experience. For example, within a workplace environment a more experienced colleague might have customized an","link":"https://techblog.thescore.com/2015/05/01/share-your-bag-of-tricks/","owner":"Teespring"}]