[{"title":"Install The LAMP Stack On A Debian Linux VPS","description":"\n                    <p>So you’re at a time in your life where you want to manage your own web server. Maybe you are currently on a shared hosting plan and it isn’t giving you the performance you need because your web application is getting crazy amounts of traffic or maybe you just want to play the role of DevOps. My blog (the one you’re on now) is on a virtual private server (VPS). The LAMP (Linux, Apache, MySQL, PHP) stack sits on top of this server which allows me to serve web applications or support software like WordPress.</p>\n<p>My VPS is hosted on a <a href=\"https://www.digitalocean.com/?refcode=ee4903914bb4\">Digital Ocean</a> Droplet with the Debian Linux distribution. Reading further will show you how to set up the LAMP stack on your own Debian Linux instance.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/10/install-the-lamp-stack-on-a-debian-linux-vps/'>Install The LAMP Stack On A Debian Linux V","link":"https://www.thepolyglotdeveloper.com/2015/10/install-the-lamp-stack-on-a-debian-linux-vps/","owner":"Nic Raboy"},{"title":"Quickcheck for Core","description":"<p>Automated testing is a powerful tool for finding bugs and specifying correctness\nproperties of code. Haskell’s Quickcheck library is the most well-known\nautomated testing library, based on over 15 years of research into how to write\nproperty-base tests, generate useful sources of inputs, and report manageable\ncounterexamples. Jane Street’s Core library has not had anything comparable up\nuntil now; version 113.00 of Core finally has a version of Quickcheck,\nintegrating automated testing with our other facilities like s-expression\nreporting for counterexample values, and support for asynchronous tests using\nAsync.</p>\n\n","link":"https://blog.janestreet.com/quickcheck-for-core/","owner":"Jane Street"},{"title":"Valley Riff Podcast - Andrew Chapin on Launching benjamin and being featured on Product Hunt","description":"<figure class=\"avatar--circle  text-center\">\n<img src=\"/images/blog/valley-riff/andrew_chapin.jpg\" alt=\"Andrew Chapin\">\n<p><i>Andrew Chapin, Co-Founder and CEO at benjamin</i></p>\n</figure>\n\n<p class=\"poet-read-more\"><a href=\"/blog/benjamin-founder-on-launching-and-product-hunt\" title=\"Read more of Valley Riff Podcast - Andrew Chapin on Launching benjamin and being featured on Product Hunt\">Continue reading</a></p>","link":"https://mixmax.com/blog/benjamin-founder-on-launching-and-product-hunt","owner":"Mixmax"}]