[{"title":"Easy Browser Compatibility Testing","description":"\n","link":"http://engineering.shapesecurity.com/2015/04/easy-browser-compatibility-testing.html","owner":"Shape Security"},{"title":"Evaluate A Reverse Polish Notation Equation With JavaScript","description":"\n                    <p>Previously, I demonstrated how to convert an <a href=\"https://www.thepolyglotdeveloper.com/2015/03/parse-with-the-shunting-yard-algorithm-using-javascript/\">Infix Notation expression into Reverse Polish Notation</a> using JavaScript, but I never explained how to evaluate the expression.</p>\n<p>Reverse Polish Notation via <a href=\"http://en.wikipedia.org/wiki/Reverse_Polish_notation\">Wikipedia</a>:</p>\n<blockquote>\n<p>A mathematical notation in which every operator follows all of its operands, in contrast to Polish notation, which puts the operator in the prefix position. It is also known as postfix notation and is parenthesis-free as long as operator arities are fixed.</p>\n</blockquote>\n<p>In this phase two article, we’re going to look at how to solve a mathematical expression that has been parsed into Reverse Polish Notation (RPN).</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/04/e","link":"https://www.thepolyglotdeveloper.com/2015/04/evaluate-a-reverse-polish-notation-equation-with-javascript/","owner":"Nic Raboy"},{"title":"Running Tests on a Pull Request","description":"<p>We all know that testing is important and that manual testing can be repetitive and boring.  At Wattpad we decided to write automation tests instead of manual testing. So we started to ramp up our automation tests and now we have a whole bunch of them. Now we have to decide what to do with them.<br/></p><p>When we started to build out application coverage we broke our testing up into two separate efforts api tests and web desktop/mobile tests.  We then started to run them against master as pull requests were merged in.  There is major flaw in this however, if the merged code is broken then it is already in master. The way that we have started to combat this is to run the tests on a pull request.  Our overall workflow is as follows:</p><figure data-orig-width=\"263\" data-orig-height=\"477\"><img src=\"https://64.media.tumblr.com/10cc6cc9a9d4a6810dd9be680becfc5c/tumblr_inline_nm4z43ix1m1tplzdc_540.png\" alt=\"image\" data-orig-width=\"263\" data-orig-height=\"477\"/></figure><p>The “Run applicat","link":"https://engineering.wattpad.com/post/115218126707","owner":"Wattpad"},{"title":"Xcode Continuous Integration: “Server encountered an error with Apple Developer”","description":"If you get this message when you are adding your server to a team to implement continuous integration using Xcode bots and OS X server: Server encountered an error with Apple Developer. Please try again later. If the problem persists, contact Apple Developer Technical Support for help. It could be a red herring. There’s a […]","link":"http://www.cimgf.com/2015/04/01/xcode-continuous-integration-server-encountered-an-error-with-apple-developer/","owner":"Cocoa Is My Girlfriend"}]