[{"title":"Mesos at Opentable","description":null,"link":"https://tech.opentable.com/mesos-at-opentable/","owner":"OpenTable"},{"title":"The New Stack: Meet CockroachDB, the Resilient SQL Database","description":"Editor’s Note: Since this post was originally published on The New Stack in 2015, CockroachDB has grown into a $2B evaluation and can publicly claimcustomers like DoorDash, Bose, SpaceX, Comcast and many others. For an up to date description of how CockroachDB compares to incumbent database products check out this short video:\nThe goal of CockroachDB is to make data easy. If you could take all the energy wasted wrestling with database shortcomings, and invest that time, money and engineering into making your company stronger and your product better, everyone would be better off.","link":"https://www.cockroachlabs.com/blog/the-new-stack-meet-cockroachdb-the-resilient-sql-database/","owner":"CockroachDB"},{"title":"Using Routes In An Angular TypeScript Application","description":"\n                    <p>With <a href=\"https://angular.io/\">Angular</a> development happening in full force, I figured it was time to take a break from Angular 1 and start thinking about what it takes to make the switch over to Angular. Like with most JavaScript powered applications you will have a single page composed of partial routes and views. I previously wrote about how to navigate with the <a href=\"https://www.thepolyglotdeveloper.com/2014/12/using-nested-states-angularjs-ui-router/\">AngularJS UI-Router</a>, but in Angular things are pretty different.</p>\n<p>Here we’re going to take a look at using routes and views to navigate within our Angular <a href=\"http://www.typescriptlang.org/\">TypeScript</a> application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2015/10/using-routes-in-an-angular-2-typescript-application/'>Using Routes In An Angular TypeScript Application</a> appeared first on <a rel='nofollo","link":"https://www.thepolyglotdeveloper.com/2015/10/using-routes-in-an-angular-2-typescript-application/","owner":"Nic Raboy"}]