[{"title":"Customer Spotlight: Matt Walters, Managing Director at Runway","description":"<figure class=\"avatar--circle  text-center\">\n<img src=\"/images/blog/customer-spotlight/matt_walters.jpg\" alt=\"Matt Walters\">\n<p><i>Matt Walters, Managing Director at Runway.</i></p>\n</figure>\n\n<p class=\"poet-read-more\"><a href=\"/blog/customer-spotlight-matt-walters-managing-director-at-runway\" title=\"Read more of Customer Spotlight: Matt Walters, Managing Director at Runway\">Continue reading</a></p>","link":"https://mixmax.com/blog/customer-spotlight-matt-walters-managing-director-at-runway","owner":"Microsoft Python Engineering"},{"title":"For Those About To Code <br>(We Salute You)","description":"<p>As programmers, a large portion of our job is to stay aware of, research, and assess new technologies in an industry that evolves at breakneck speed. Being continually bombarded with such information it can seem like an uphill struggle to process this information in a memorable fashion.</p>\n\n<p>How we cope with this varies on an individual basis, and my method for learning, exploring, and (crucially) remembering a new programming language has been pointed out to be somewhat unconventional, yet strangely effective - perhaps it could be for you too?</p>\n\n<h3 id=\"this-is-major-tom-to-ground-control\">This is Major Tom To Ground Control</h3>\n\n<p>The ubiquitous “Hello World” scenario - whereby you are shown the code necessary to output the words “Hello World” - has long been the defacto introduction to a new language. While this is extremely useful as an indicator of complexity and verbosity, it is soooooo immeasurably dull that it is almost instantly forgettable. The fact that there are ","link":"http://engineering.intenthq.com/2015/06/for-those-about-to-code-we-salute-you/","owner":"Intel"},{"title":"New playlist representations","description":"Requests for playlists have always included the full track objects contained\nwithin. This representation may be convenient for playlists…","link":"https://developers.soundcloud.com/blog/new_playlist_representations","owner":"Soshace"}]