[{"title":"Roper game prototype","description":"<p>For a few days last week, I went to the reading room at the Wellcome Trust and worked on a game prototype.</p>\n\n<div class=\"video-container\"><iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/ndbka06mkc0?rel=0\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n\n<p>(Cinematography and set design by Lauren Karchmer, my wife.)</p>\n\n<p>Sam, my friend and colleague at Makers Academy told me about the reading room.  It’s great.  There are lots of interesting books there, comfy seats and a palatial staircase covered in throw pillows.</p>\n\n<p>I had a few goals with the prototype.  First, to try out a Bionic Commando slash Spiderman roping mechanic that I’d had in my head.  I wanted to use Box2D for the rope physics. I wanted the player to not be constrained to special roping points or angles.   Second, I wanted to keep to a discipline of prototyping an idea and then setting it aside, rather than letting it potter along as a project that eventually ran out of steam.</p>\n\n<p","link":"https://maryrosecook.com/blog/post/roper-game-prototype","owner":"Martin Fowler"},{"title":"Use Mozilla’s LocalForage For Key-Value Storage In Ionic Framework","description":"\n                    <p>A few years ago I wrote an article called <a href=\"https://www.thepolyglotdeveloper.com/2014/12/use-ngstorage-angularjs-local-storage-needs/\">Use ngStorage for all Your AngularJS Local Storage Needs</a>, which was intended to be for AngularJS in general. However, I understand many readers were using it in their hybrid Apache Cordova or Ionic Framework applications. There is nothing wrong with this. However, ngStorage is a wrapper for HTML5 local storage which is known to have compatibility issues under certain circumstances. That said, came across <a href=\"https://github.com/localForage/localForage\">localForage</a>, a library by Mozilla, which claims to be a wrapper for local storage, WebSQL, and IndexedDB, offering maximum compatibility.</p>\n<p>We’re going to take a look at including localForage in an <a href=\"https://www.ionicframework.com/\">Ionic Framework</a> Android and iOS application for storing data.</p>\n                    \n                        <p>Th","link":"https://www.thepolyglotdeveloper.com/2016/08/use-mozillas-localforage-library-key-value-storage-ionic-framework/","owner":"Nelson Elhage"}]