[{"title":"Building an Application With CockroachDB and SQLAlchemy","description":"CockroachDB&#x2019;s support for SQLAlchemy is currently in beta, but we&#x2019;re actively developing new features to improve the integration. You can find the documentation here.\nOne of the great things about CockroachDB&#x2019;s support for SQL is the wide variety of frameworks and tools for working with SQL data. Today, we&#x2019;ll demonstrate this by building a simple application in Python, using SQLAlchemy and Flask.\nAdapting SQLAlchemy to CockroachDB Every SQL database is a little bit different, so a library like SQLAlchemy requires some code (called a dialect) to adapt its interface to the database in use.","link":"https://www.cockroachlabs.com/blog/building-application-cockroachdb-sqlalchemy-2/","owner":"CockroachDB"},{"title":"Change your Mac OS X hostname for a better looking terminal prompt","description":"","link":"https://firstdoit.com/change-your-mac-os-x-hostname-for-a-better-looking-terminal-prompt-6aff5246c56d?source=rss----92a9d6520edc---4","owner":"Guilherme Rodrigues"},{"title":"Data pipelines with Apache Crunch and Java 8","description":"With Java 8 now in the mainstream, Scala and Clojure are no longer the only choices to develop readable, functional code for big data technology on the JVM. In this post we see how SoundCloud is leveraging Apache Crunch and the new Crunch Lambda module to do the high-volume data processing tasks which are essential at early stages in our batch data pipeline efficiently, robustly and simply in Java 8.","link":"https://developers.soundcloud.com/blog/data-pipelines-apache-crunch-java-8","owner":"Soundcloud"},{"title":"Good News, Bad News, and Ugly News\n","description":"The good news is that I'm officially restarting work on The Complete Friday Q&amp;A: Volume II. I got partway into it a while ago and ran out of steam. The restarted edition includes all posts made since then, making it pretty massive. I can't commit to a specific timeframe, but I hope that it will be a few months at most before I have it out. There may be opportunities for reader involvement in checking and polishing it, so watch this space.<br><a href=\"http://www.mikeash.com/pyblog/good-news-bad-news-and-ugly-news.html\">(Read More)</a>","link":"http://www.mikeash.com/pyblog/good-news-bad-news-and-ugly-news.html","owner":"Mike Ash"},{"title":"Introducing Sequences","description":"<p>We just released a truly game-changing improvement to our Mail Merge feature which we call “Sequences”. As soon as you get new leads, you can now immediately add them to any existing campaign, with automated follow-ups.</p><p class=\"poet-read-more\"><a href=\"/blog/sequences-add-recipients-on-the-fly\" title=\"Read more of Introducing Sequences\">Continue reading</a></p>","link":"https://mixmax.com/blog/sequences-add-recipients-on-the-fly","owner":"Mixmax"},{"title":"Lead by example or don’t lead at all","description":"","link":"https://firstdoit.com/lead-by-example-or-dont-lead-at-all-6213aa1c8dea?source=rss----92a9d6520edc---4","owner":"Guilherme Rodrigues"}]