[{"title":"Adventures in Performance Debugging","description":"As we&#x2019;ve built CockroachDB, correctness has been our primary concern. But as we&#x2019;ve drawn closer to our beta launch, we&#x2019;ve had to start paying significantly more attention to performance. The design of CockroachDB always kept performance and scalability in mind, but when you start measuring performance, there are inevitably surprises. This is the story of the detection, investigation, and fix of just one performance bug.\nFirst, a little context about CockroachDB for those new to the project.","link":"https://www.cockroachlabs.com/blog/adventures-performance-debugging/","owner":"Cloudflare"},{"title":"Implement Social Media Sharing In A NativeScript App","description":"\n                    <p>Every app lately has some social media aspect to it. Most commonly, apps will allow you to share some kind of data, whether it be an image or text, to social media networks such as Facebook or Twitter. Sharing via email or SMS message still is classified as social sharing. When building NativeScript Android and iOS applications, sharing data isn’t complicated.</p>\n<p>We’re going to see how to share image data and text data on social media networks via a <a href=\"https://www.nativescript.org/\">Telerik NativeScript</a> Android and iOS mobile application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/03/implement-social-media-sharing-nativescript-app/'>Implement Social Media Sharing In A NativeScript App</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/03/implement-social-media-sharing-nativescript-app/","owner":"Nelson Elhage"},{"title":"Web archeology - itblog","description":"","link":"https://idea.popcount.org/2016-03-11-web-archeology---itblog","owner":"Marco Pivetta"}]