[{"title":"A mythical beast called JIT","description":"<h1 id=\"a-mythical-beast-called-jit\">A mythical beast called <code class=\"highlighter-rouge\">JIT</code></h1>\n\n<p>I have recently bumped into one of those articles which title sounds rather like <a href=\"https://top.fse.guru/nodejs-a-quick-optimization-advice-7353b820c92e\">“one weird trick”</a> ad. Guiding just from it, you can imagine how small amount of information is contained there, and by actually going through that link there you will definitely make sure that it has some knowledge, but no real explanations are in place.</p>\n\n<p>Of course, a final explanation is indeed really simple - <code class=\"highlighter-rouge\">Function.prototype.toString()</code> returns everything even the comments inside the function body, size of that string is a feature that allows the optimizing compiler inside <em>V8</em> to make a decision to inline that particular function or not. There is even a command line switch which to use to modify a limit and a default value. Simple enough? Not really.</p>\n\n<","link":"http://www.afronski.pl/2016/04/08/a-mythical-beast-called-jit.html","owner":"William Kennedy"},{"title":"The Developer Community Gives Back","description":"\n                    <p>I’ve been writing developer related content for a few years now, most of which I distribute for free. Sure I have some donation requests around this blog, but I never demand any and I try not to force it on you. I enjoy helping the developer community, and more, I enjoy creating a healthy developer community that helps each other.</p>\n<p>This is a short story on how the developer community that I created, heard my request for help, and offered to lend me their skills.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/04/developer-community-gives-back/'>The Developer Community Gives Back</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/04/developer-community-gives-back/","owner":"Nelson Elhage"},{"title":"Working with Rails, Webpack and Heroku","description":"Note: This Rails version targeted in the post is one before webpacker got added. The folder structure and procedure might differ if you&rsquo;re using a newer version of Rails. But the context does help.\nDeployment of a Rails app that uses Webpack to Heroku is tricky because it requires both Node.js and Ruby. After various unsuccessful attempts, I had a solution that worked without customizing Heroku buildpacks. If you know how Heroku buildpacks work, skip to the summary for the TL;DR version.","link":"https://crypt.codemancers.com/posts/2016-03-18-rails-webpack-heroku/","owner":"Codelitt"}]