[{"title":"Alter The Ionic 2 Gulp Script To Include Browser JavaScript Files","description":"\n                    <p>Recently I found myself needing to add a JavaScript library to an Ionic 2 TypeScript project. Now you’ll probably recall that I’ve written two different articles regarding using JavaScript libraries in TypeScript project. I wrote about <a href=\"http://x-team.com/2016/06/include-javascript-libraries-in-an-ionic-2-typescript-project/\">including a JavaScript library in an Ionic 2 app</a> in a guest post I did, but the scenario had the JavaScript library coming from the Node Package Manager (NPM). I also wrote about <a href=\"https://www.thepolyglotdeveloper.com/2016/01/include-external-javascript-libraries-in-an-angular-2-typescript-project/\">including a JavaScript library in an Angular app</a>, but the project structure is a little more web friendly in that scenario.</p>\n<p>My new scenario is including a JavaScript file, rather than NPM package. The project structure in an Ionic 2 application is a bit different than others. We can’t just include JavaScript files wh","link":"https://www.thepolyglotdeveloper.com/2016/06/alter-ionic-2-gulp-script-include-browser-javascript-files/","owner":"Nelson Elhage"},{"title":"How We Open Sourced Our First iOS Project","description":"","link":"https://crowdfire.engineering/how-we-open-sourced-our-first-ios-project-133772c430c0?source=rss----212c5945ed6c---4","owner":"Criteo"},{"title":"Time-Travel Queries: SELECT witty_subtitle FROM THE FUTURE","description":"Update as of July 10, 2019\nSince publishing this post back in 2016, we have added two new features that make time travel queries far easier to use.\nYou can now specify relative times. For example, select * from t as of system time &apos;-10s&apos; will select from 10s ago. When this post was written in 2016, a user had to specify a full timestamp. You can now specify the AOST time in a BEGIN.","link":"https://www.cockroachlabs.com/blog/time-travel-queries-select-witty_subtitle-the_future/","owner":"Cloudflare"}]