[{"title":"Debug like never before","description":"","link":"https://crowdfire.engineering/debug-like-never-before-4d2c4eae7487?source=rss----212c5945ed6c---4","owner":"Criteo"},{"title":"Enigma - Building a DoS mitigation pipeline","description":"","link":"https://idea.popcount.org/2016-02-01-enigma---building-a-dos-mitigation-pipeline","owner":"Marco Pivetta"},{"title":"Profiling django views for SQL queries","description":"\n<p>We at HackerEarth regularly conduct 24-hours internal hackathons usually once a\nmonth to boost ourselves to get familiar with new technologies and to come up\nwith great ideas and hacks to increase our productivity. A hackathon project\ncan be anything from creating a new product to creating some tools which helps\nour own devlopment. In the hakathon in Dec 2015, I came up with the idea to\ncreate a profiler which could tell which code inside django views causes SQL\nqueries so that we can optimize them easily.</p>\n\n<h2 id=\"initial-thoughts\">Initial thoughts</h2>\n\n<p>There are already many good django packages to profile views for SQL queries.\nOne of them is\n<a href=\"https://github.com/django-debug-toolbar/django-debug-toolbar\">django-toolbar</a>\nwhich we already use. Django-toolbar is great but it shows all raw SQL queries\nwhich are happening inside a view and you have to analyze each query, see\nthe whole traceback and figure out which line of code inside the view is triggering\nthe que","link":"http://engineering.hackerearth.com/2016/02/01/profiling-django-views/","owner":"Gusto"},{"title":"Use Your Raspberry Pi As A Headless System Without A Monitor","description":"\n                    <p>I have a few <a href=\"https://www.raspberrypi.org/\">Raspberry Pi</a> computers all doing different things around my home. With the exception of my RetroPie, which I’ll talk about in a different article, they were all configured and running as a headless system. So what exactly is a headless system?</p>\n<p>Headless Systems via <a href=\"http://internetofthingsagenda.techtarget.com/definition/headless-system\">IoT Agenda</a>:</p>\n<blockquote>\n<p>A headless system is a computer that operates without a monitor, graphical user interface (GUI) or peripheral devices, such as keyboard and mouse.</p>\n</blockquote>\n<p>I use an iMac and my TV has all HDMI ports in use making it a hassle to switch them around. This means I needed to configure and use my Raspberry Pi in a different manner.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/02/use-your-raspberry-pi-as-a-headless-system-without-a-monitor","link":"https://www.thepolyglotdeveloper.com/2016/02/use-your-raspberry-pi-as-a-headless-system-without-a-monitor/","owner":"Nelson Elhage"}]