[{"title":"Common DNS configuration issues","description":null,"link":"http://thelazylog.com/common-dns-configuration-issues/","owner":"Chien Tran"},{"title":"Stack Overflow: The Hardware - 2016 Edition","description":"<blockquote>\n  <p>This is #2 in a <a href=\"/blog/2016/02/03/stack-overflow-a-technical-deconstruction/\">very long series of posts</a> on Stack Overflow’s architecture.<br />\nPrevious post (#1): <a href=\"/blog/2016/02/17/stack-overflow-the-architecture-2016-edition/\">Stack Overflow: The Architecture - 2016 Edition</a><br />\nNext post (#3): <a href=\"/blog/2016/05/03/stack-overflow-how-we-do-deployment-2016-edition/\">Stack Overflow: How We Do Deployment - 2016 Edition</a></p>\n</blockquote>\n\n<p>Who loves hardware? Well, I do and this is my blog so I win. If you <em>don’t</em> love hardware then I’d go ahead and close the browser.</p>\n\n<p>Still here? Awesome. Or your browser is crazy slow, in which case you should think about some new hardware.</p>\n\n<p>I’ve repeated many, <em>many</em> times: <strong><a href=\"https://blog.codinghorror.com/performance-is-a-feature/\">performance is a feature</a></strong>. Since your code is only as fast as the hardware it runs on, the hardware definitely matt","link":"https://nickcraver.com/blog/2016/03/29/stack-overflow-the-hardware-2016-edition/","owner":"Nick Craver"},{"title":"Upgrade Elasticsearch Cluster Software and Hardware Seamlessly","description":"<h2>Cluster Upgrades</h2>\n<p>Our decision to begin using Elasticsearch came from a fairly typical use case for the popular distributed data store. We had hundreds of millions of pieces of content, and we wanted to support text search across them. As we set out to migrate our architecture from a relatively simple Postgres setup to include indexing all of our documents into Elasticsearch, we did what everyone does: we played around with Elasticsearch and made some educated guesses about the hardware we would need to support our needs. And, as so often happens, we underestimated.</p>\n<p>Our biggest problem was with disk space usage. Indexing our dataset took up far more space than we had anticipated, and we needed to increase the size of the attached AWS EBS volumes on our instances. Somewhat less pressing than our disk usage was our heap usage, which made us want to increase the memory of each node so that we could allocate more heap space (friendly reminder that it's <a href=\"https://ww","link":"http://engineroom.trackmaven.com/blog/upgrade-es-seamlessly/","owner":"TrackMaven"},{"title":"Writing custom modules for Ansible","description":"<h1 id=\"writing-custom-modules-for-ansible\">Writing custom modules for Ansible</h1>\n\n<h2 id=\"introduction\">Introduction</h2>\n\n<h3 id=\"what-is-ansible-and-what-is-a-module\">What is Ansible and what is a <code class=\"highlighter-rouge\">module</code>?</h3>\n\n<p>If you are a big fan of <em>automation</em>, if you are focused on spreading and building software in line with <em>DevOps</em> culture, tools related with automation / configuration management like <em>Chef</em> or <em>Ansible</em> are probably well known to you. From the other hand that what differentiates those tools is a topic for a next blog post. Without diving into those differences, let’s briefly zoom into details for those people which do not know what <em>Ansible</em> and <em>modules</em> are.</p>\n\n<p><em>Ansible</em> is a free-software platform for configuring and managing machines. It combines deployment, ad-hoc tasks execution and configuration management. This tool uses <em>YAML</em> and declarative way of defining ste","link":"http://www.afronski.pl/2016/03/28/writing-custom-modules-for-ansible.html","owner":"Wojtek Gawroński"}]