[{"title":"CockroachDB Stability Post-Mortem: From 1 Node to 100 Nodes","description":"In August, we published a blog post entitled &#x201C;Why Can&#x2019;t I Run a 100-Node CockroachDB Cluster?&#x201D;. The post outlined difficulties we encountered stabilizing CockroachDB. CockroachDB stability (or the lack of) had become significant enough that we designated it a &#x201C;code yellow&#x201D; issue, a concept borrowed from Google that means a problem is so pressing that it merits promotion to a primary concern of the company. For us, the code yellow was more than warranted; a database program isn&#x2019;t worth the bytes to store its binary if it lacks stability.","link":"https://www.cockroachlabs.com/blog/cockroachdb-stability-from-1-node-to-100-nodes/","owner":"Cloudflare"},{"title":"Send Emails With Mailgun Using NativeScript And Angular","description":"\n                    <p>Sending emails from your mobile application is often a critical aspect. For example, what if you want to be able to collect user feedback, wouldn’t email be one of the better solutions?  Now let’s add to this scenario and say that the user doesn’t have email configured on their mobile device. How does the user send emails to you from your application?  This is where the Mailgun API comes into play.</p>\n<p>The <a href=\"http://www.mailgun.com/\">Mailgun</a> API is a service, which includes a free tier, for sending emails via a RESTful API. No need for users to configure their email client and no need to maintain an email inbox. It is great for getting the job done.</p>\n<p>Not too long ago I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2016/04/send-emails-nativescript-app-via-mailgun-api/\">using the Mailgun API in a vanilla NativeScript application</a>. One of my subscribers recently requested information on how to accomplish this task using Angular in ","link":"https://www.thepolyglotdeveloper.com/2016/11/send-emails-mailgun-using-nativescript-angular-2/","owner":"Nelson Elhage"}]