[{"title":"Build A Password Manager For Android And iOS Using Ionic 2","description":"\n                    <p>Have you ever wanted to build your own password manager?  Maybe you don’t trust the password management tools that already exist, or maybe you just want the experience. I personally use the tool <a href=\"https://1password.com/\">1Password</a>, but many of my friends don’t trust the applications that exist on the market. It is a valid concern that they have. What if the password managers that exist are using an ancient or obsolete DES specification or similar, rather than the modern AES?  What if the master passwords are not being hashed with a strong Bcrypt algorithm?</p>\n<p>Not too long ago we created <a href=\"https://www.thepolyglotdeveloper.com/2016/06/build-a-password-manager-for-ios-and-android-using-nativescript/\">a password manager using the NativeScript framework</a>, but what if we wanted to build one with a different technology.</p>\n<p>We’re going to see how to build a password manager that makes use of the AES specification using Ionic 2 and Angular. T","link":"https://www.thepolyglotdeveloper.com/2016/07/build-a-password-manager-for-android-and-ios-using-ionic-2/","owner":"Nelson Elhage"},{"title":"Consensus, Made Thrive","description":"When you write data to CockroachDB (for example, if you insert a row into a table through the SQL client), we take care of replication for you. To do this, we use a consensus protocol &#x2013; an algorithm which makes sure that your data is safely stored on multiple machines, and that those machines agree on the current state even if some of them are temporarily disconnected.\nIn this post, I will give an overview of common implementation concerns and how we address these concerns in CockroachDB.","link":"https://www.cockroachlabs.com/blog/consensus-made-thrive/","owner":"Cloudflare"},{"title":"How we Automate Mobile and Web Projects at Shyp with CircleCI","description":"","link":"https://medium.com/shyp-engineering/how-we-automate-mobile-and-web-projects-at-shyp-with-circleci-1219eb9467a3?source=rss----6513e7cf74b---4","owner":"ShowMax"}]