[{"title":"[community post] Handling NULL Values in CockroachDB","description":"CockroachDB contributor Paul Steffensen (aka uptimeDBA) has analyzed CockroachDB&#x2019;s handling of NULL values as compared to the SQL standard and other SQL implementations. He shares his analysis in his blog post &#x201C;I&#x2019;ve got nothing. NULL handing in CockroachDB.&#x201D; You can read the full post here.","link":"https://www.cockroachlabs.com/blog/community-post-handling-null-values-cockroachdb/","owner":"Cloudflare"},{"title":"Chain your solutions with Underscore","description":"","link":"https://firstdoit.com/chain-your-solutions-with-underscore-513fba67ec1f?source=rss----92a9d6520edc---4","owner":"Guido van Rossum"},{"title":"Clone A Raspberry Pi SD Card For Quick Storage Upgrades","description":"\n                    <p>I recently found myself needing to switch micro SD cards in my Raspberry Pi 3, not necessarily because it needed a storage upgrade, but more because I had a different device that needed the exact memory card that the Raspberry Pi was using. The problem was that I had already done a lot of work on the Raspberry Pi that I didn’t necessarily want to have to do again. This made me wonder. Could I just clone the micro SD card and be good to go?  The answer was yes, and it really wasn’t difficult to do.</p>\n<p>We’re going to take a look at how to clone or copy a Raspberry Pi memory card to a new one with potentially more space than the previous.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/05/clone-raspberry-pi-sd-card-quick-storage-upgrades/'>Clone A Raspberry Pi SD Card For Quick Storage Upgrades</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Po","link":"https://www.thepolyglotdeveloper.com/2016/05/clone-raspberry-pi-sd-card-quick-storage-upgrades/","owner":"Nelson Elhage"},{"title":"Spotify Engineering Culture — Lessons on Autonomy and Alignment","description":"","link":"https://firstdoit.com/spotify-engineering-culture-lessons-on-autonomy-and-alignment-e86abe5ebca7?source=rss----92a9d6520edc---4","owner":"Guido van Rossum"}]