[{"title":"Analyzing submissions in real time for social media updates","description":"\n<h3 id=\"objective\">Objective</h3>\n<p>In Jan 2015, HackerEarth conducted nearly 10-12 hiring challenges, 5-6 coding challenges and numerous college challenges.\nHackerEarth has a decent social media presence and we wanted to inform our followers about the events at HackerEarth.\nOne of the main objectives of this project was to provide flexibility to the marketing team to automate simple jobs and to focus on sophisticated campaigns.</p>\n\n<h3 id=\"design-goals\">Design Goals</h3>\n<p>As a first step, we decided to post about our events and their highlights on twitter.\nWe covered event reminders, start/end of contests, who scored first AC and leaderboard updates at the end of a contest.\nWe chose to do it by reading from the biggest and the meanest table of our database of Submissions.</p>\n\n<h3 id=\"challenges\">Challenges</h3>\n<p>The submissions table is a very large table. An additional query on the submissions table during peak hours was not favourable. Hence, we did not count the submissions","link":"http://engineering.hackerearth.com/2016/02/02/analyzing-submissions-realtime-for-social-media-updates/","owner":"HackerEarth"},{"title":"Beautiful Math Symbols","description":"\n<h3 id=\"introduction\">Introduction:</h3>\n\n<p>By nature HackerEarth has so many programming puzzles. These puzzles bound to have mathematical equations, statements and symbols. Problem Setters often requested us to add support for Latex.</p>\n\n<h3 id=\"implementation\">Implementation:</h3>\n<p>The obvious and easy solution for this is to implement Latex support for individual pages. But that’s not scalable and maintainable. Then we came with up with a solution where we didn’t have to write custom code for every page. We examined the site and figured out three type of rendering that happens in the browser. Before going to solutions case by case, let’s first understand how MathJax, the library we use for <a href=\"https://en.wikipedia.org/wiki/Typesetting\">typesetting</a> Latex, works.</p>\n\n<p>Everything in MathJax works asynchronously. After initializing MathJax, it executes a set of tasks and then typesets the queued content. Everything in MathJax works asynchronously using queues. Mathjax ","link":"http://engineering.hackerearth.com/2016/02/02/latex-support-using-MathJax/","owner":"HackerEarth"},{"title":"The weekly snippet-server: open-sourced","description":"","link":"http://engineering.khanacademy.org/posts/snippet-server.htm","owner":"Khan Academy"}]