[{"title":"A brief history of select(2)","description":"","link":"https://idea.popcount.org/2016-11-01-a-brief-history-of-select2","owner":"Marco Pivetta"},{"title":"First steps in mitigating Software Complexity","description":"<p>You are leading a software development team of more than 10 developers. Your code base has grown so complex that shipping features takes longer than it used to. In that case, along the lines of famous <a href=\"https://plus.google.com/+RipRowan/posts/eVeouesvaVX\">mandate</a> by Jeff Bezos, this is the mandate I propose you issue to your team.</p>\n\n<ol>\n  <li>\n    <p>No one talks with anyone else in the team.</p>\n  </li>\n  <li>\n    <p>When someone starts to work on a feature, they should also start documenting it. When the feature is pushed, the reviewer should read the documentation before reviewing the code.</p>\n  </li>\n  <li>\n    <p>When reviewing any code, the reviewer should make sure there are enough comments in the code that explain</p>\n\n    <p>a. <strong>Why</strong> a module is written and why it is written the way it is written</p>\n\n    <p>b. Tradeoffs and odd choices that are made</p>\n\n    <p>c. Assumptions made</p>\n\n    <p>d. Tricky pieces</p>\n\n    <p>e. Things new develop","link":"http://sudhagar.com/software-development/2016/11/01/complexity-first-steps.html","owner":"Steve Yegge"},{"title":"How to Survive a Hackathon as a Sponsor","description":"Surviving a hackathon as a sponsor without becoming a complete zombie is no joke. To start, you&#x2019;ll have plenty of practical, technical concerns that have to be sorted (How do you get people to try your product? Will the hackers be familiar with your application&#x2019;s language?). But once you&#x2019;ve got the technical issues taken care of, you&#x2019;ll likely have nearly as many questions about how to keep your team as sane and functional as possible&#x2013;&#x2013;despite running on limited sleep, consuming excessive caffeine, and likely being completely out of their comfort zones.","link":"https://www.cockroachlabs.com/blog/surviving-a-hackathon-as-a-sponsor/","owner":"Cloudflare"}]