[{"title":"Auto Attaching USB Storage To A Raspberry Pi Running Linux","description":"\n                    <p>I’ve written a few articles about how I’m using my many Raspberry Pi units. Recently I wrote about using a Raspberry Pi as an <a href=\"https://www.thepolyglotdeveloper.com/2016/02/create-raspberry-pi-automatic-network-backup-server/\">automatic network backup server</a>, but I didn’t talk about expanding the storage beyond the micro or standard sized SD card. What if you want to utilize a much larger USB hard drive or thumb drive?  By default Linux won’t mount the drive, and heck, it may not even be in the correct format.</p>\n<p>We’re going to see how to format a USB drive, mount it on a Raspberry Pi, and then auto mount it every time the Raspberry Pi reboots.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/07/auto-attaching-usb-storage-raspberry-pi-running-linux/'>Auto Attaching USB Storage To A Raspberry Pi Running Linux</a> appeared first on <a rel='nofollow' href='https://www.thepo","link":"https://www.thepolyglotdeveloper.com/2016/07/auto-attaching-usb-storage-raspberry-pi-running-linux/","owner":"Nelson Elhage"},{"title":"Continuous Deployment using Docker Cloud","description":"One good thing about dockerizing all your services is the ability to choose from a plethora of orchestration tools to deploy those docker images in different ways for different needs, like:\nBootstrapping your multi-tiered app on developer boxes Creating ad-hoc disposable staging environments for testing pull requests Deploying, scaling and monitoring services in production There are so many tools out there which help you run docker containers on the cloud","link":"https://crypt.codemancers.com/posts/2016-07-25-continuous-deployment-using-docker-cloud/","owner":"Codelitt"},{"title":"Twitter/Instagram Like Date Format In Angular","description":"<p>I started learning “proper” angular recently. I love it so far.</p>\n\n<p>I was building a little job posting app. When displaying jobs and comments, I had to show the time since it was posted. Doing it in a controller or a service doesn’t make sense as this is something you need throughout your app.</p>\n\n<p>“Ah, what a oppurtunity to create a custom directive”, I thought.</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-javascript\" data-lang=\"javascript\"><span class=\"s1\">'use strict'</span><span class=\"p\">;</span>\n\n<span class=\"nx\">angular</span><span class=\"p\">.</span><span class=\"nx\">module</span><span class=\"p\">(</span><span class=\"s1\">'moduleName'</span><span class=\"p\">)</span>\n  <span class=\"p\">.</span><span class=\"nx\">directive</span><span class=\"p\">(</span><span class=\"s1\">'timeAgo'</span><span class=\"p\">,</span> <span class=\"kd\">function</span> <span class=\"p\">()</span> <span class=\"p\">{</span>\n    <span class=\"k\">return</span> <span class=\"p\">{</span>\n      <span cl","link":"http://sudhagar.com/javascript/angular/2016/07/25/angular-custom-directive-for-date.html","owner":"Steve Yegge"},{"title":"Why you can't ping a specific port","description":"<p>Most of us when a service or a website is down, we try pinging it. If that service or website is running on a specific port and we try pinging it with that port number, we will get an error.</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-html\" data-lang=\"html\">root@spark:~# ping -c3 159.203.216.179:80\nping: unknown host 159.203.216.179:80</code></pre></figure>\n\n<p>The reason for this is, ping is nothing but a ICMP <code class=\"highlighter-rouge\">echo request</code> and <code class=\"highlighter-rouge\">echo reply</code> and there is no concept of port numbers in ICMP.</p>\n\n<p>ICMP protocol is a part of Internet layer of the Internet Protocol Suite. HTTP is at the top layer, i.e. application layer, while TCP and UDP form the transport layer.</p>\n\n<p><img src=\"http://sudhagar.com/assets/images/internet_layers.png\" alt=\"Internet Protocol layers\" /></p>\n\n<p>TCP deals with the actual data exchange on the internet. UDP also does data exchange but does it fast without the handshak","link":"http://sudhagar.com/computer-network/2016/07/25/ping-specific-port-error.html","owner":"Steve Yegge"}]