[{"title":"A Modern Network Operation","description":"When Apple introduced the NSURLSession API, the landscape of network operations changed. In some ways, the new API made things worse as the block API that was added tempts developers to become very sloppy with network calls. The block API makes it trivial to add network calls anywhere in an application. Very little thought or […]","link":"http://www.cimgf.com/2016/01/28/a-modern-network-operation/","owner":"Clay McLeod"},{"title":"A/B testing using Django","description":"\n<p>Whenever we roll out an improvement on our platform, we at HackerEarth love to conduct A/B tests on the improvement to understand which iteration helps our users more in using the platform in a better way. Since the available third party libraries did not quite meet our needs, we wrote our own A/B testing framework in Django. In this post we will share a few insights as to how we accomplished this.</p>\n\n<h3 id=\"the-basics\">The basics</h3>\n\n<p>A lot of products, especially on web, use a method called <strong>A/B testing</strong> or <em>split testing</em> to quantify how well a new page or layout performs as compared to the old one. The crux of the method is to show layout ‘A’ to a certain set or bucket of users and layout ‘B’ to another set of users. The next step is to track user actions leading to certain milestones, which would provide critical data regarding the ‘effectiveness’ of both the pages or layouts.</p>\n\n<p>Before we began writing code for the framework, we made a list o","link":"http://engineering.hackerearth.com/2016/01/29/ab-testing-using-django/","owner":"Gusto"},{"title":"Fill Empty Space With UI Elements Using The NativeScript GridLayout","description":"\n                    <p>So recently I found myself needing to create a screen in a NativeScript Android and iOS app that had a <code>ListView</code> that sat below, or above, a <code>Label</code> UI element. The problem I faced was that there were issues with element sizing. On my first attempt I ended up with a <code>Label</code> and <code>ListView</code> that only took up a small portion of the screen, when I wanted the <code>ListView</code> to take up all remaining space. This is where the <code>GridLayout</code> comes in with its ability to have custom row and column sizing.</p>\n<p>Using a <code>GridLayout</code> you can specify how rows and columns are fit around the screen.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/01/fill-empty-space-with-ui-elements-using-the-nativescript-gridlayout/'>Fill Empty Space With UI Elements Using The NativeScript GridLayout</a> appeared first on <a rel='nofollow' hre","link":"https://www.thepolyglotdeveloper.com/2016/01/fill-empty-space-with-ui-elements-using-the-nativescript-gridlayout/","owner":"Nelson Elhage"},{"title":"Logging Javascript errors in production","description":"\n<p>We had implemented a javascript logger to capture the pesky issues our users faced and had problems when using the site. When we came up with the idea, we thought it would be just a five minute job where we would just have to add a snippet and would be done, but as it is well know, nothing is simple when it comes to real world production issues.</p>\n\n<p>After analyzing a lot of loggers, we decided to use <strong>errorception</strong> as our javascript logger. It was simple in its approach and it provided the data we needed. This was the easy part, next came the part of integration, and yes there was a snippet which we just had to paste in our base javascript file, but one thing we had forgotten, CORS.</p>\n\n<p>We host our static files on S3 and they are served via fastly, because of which they are delivered through another domain. The error tracking snippet could not log the errors because ‘window.onerror’ would not return the necessary stack trace and information.</p>\n\n<p>Many of y","link":"http://engineering.hackerearth.com/2016/01/29/hackerearth-logging-javascript-errors-production/","owner":"Gusto"},{"title":"Managing roles and access control in a web application","description":"\n<p><a href=\"https://www.hackerearth.com/recruit/\" target=\"_blank\">HackerEarth Recruit</a>, is a platform for technical recruitment. Many companies use this platform for candidate assessments and interviewing.\nThere can be multiple admins for a company account. As teams grow in size, access control is a special concern for applications that deal with financial and privacy data. Access control is concerned with determining the allowed activities of legitimate users, but we required more sophisticated and complex control mediating every attempt by a user to access a resource in the application based on the sensitivity level of various features.</p>\n\n<p><strong><em>A state of access control is said to be safe if no permission can be leaked to an unauthorized or uninvited principal.</em></strong></p>\n\n<p>We figured that the simpliest solution to restrict access was to use ACL.</p>\n\n<h4 id=\"what-is-acl-\">What is ACL ?</h4>\n<p>An access control list (ACL), with respect to a computer file sys","link":"http://engineering.hackerearth.com/2016/01/29/managing-roles-and-access-control/","owner":"Gusto"},{"title":"Smart suggestions with Django, Elasticsearch and Haystack","description":"<h3 id=\"introduction\">Introduction</h3>\n\n<p>One of the primary issues when gathering information from users is suggesting the right options that they are looking for. At HackerEarth, we gather information from all our developers which help\nus provide them a better experience. So there came a time when we had to suggest very smartly to our users! :D</p>\n\n<p>When humongous amounts of data has to be indexed and suggested intelligently, one of the efficient ways to do it is by using an inverted index. An inverted index basically is a map of words that\nappear in documents to a list of documents the word is found in. Popular Lucene based search servers like Elasticsearch and Solr are tools to maintain large inverted indexes and provide an efficient means to look up documents.</p>\n\n<p>Here is an example from the profiles page on HackerEarth.</p>\n\n<p><img src=\"/images/suggestion.png\" alt=\"suggestion_pic\" /></p>\n\n<p>We use Elasticsearch to index millions of documents with various fields. Two hu","link":"http://engineering.hackerearth.com/2016/01/29/smart-sugesstions-with-elasticsearch/","owner":"Gusto"}]