[{"title":"Chocolatey Has a New Logo!!!","description":"A designer started a conversation with us in December 2014 and we’ve recently come to a decision point on Chocolatey – a new logo (and soon a new website)! A special thanks goes out to Julian Krispel-Samsel!","link":"http://feedproxy.google.com/~r/CodeBetter/~3/ImOC-Q5Y4ws/","owner":"Code Better"},{"title":"Deploy A NativeScript App With A Pre-Filled SQLite Database","description":"\n                    <p>Recently I wrote an article regarding how to <a href=\"https://www.thepolyglotdeveloper.com/2016/04/use-sqlite-save-data-telerik-nativescript-app/\">use SQLite in a NativeScript</a> Android and iOS mobile application. In my previous tutorial the assumption was that the database would be created fresh. However, what if you want to ship a pre-filled SQLite database with your application?  Maybe you have 10,000 records that you prefer not to have to download from a remote web server, or maybe there is another reason. Having a pre-populated database is fair game.</p>\n<p>We’re going to take a look at what it takes to ship a <a href=\"https://www.nativescript.org/\">NativeScript</a> application with a SQLite database that already contains data.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/04/deploy-nativescript-app-pre-filled-sqlite-database/'>Deploy A NativeScript App With A Pre-Filled SQLi","link":"https://www.thepolyglotdeveloper.com/2016/04/deploy-nativescript-app-pre-filled-sqlite-database/","owner":"Nic Raboy"},{"title":"Maker Days 2016 Q1","description":"Wait, what? Maker Days is what you get when you take a team of 20 or so developers, feed them sugar and a pseudo-scientifically regulated amount of beer and sit them down at a computer for an extended period of time: An in-house hackathon arranged a couple of times a year here at SpeedLedger. We […]","link":"http://engineering.speedledger.com/maker-days-2016-q1/","owner":"Speedledger"}]