[{"title":"Efficient Documentation Using SQL Grammar Diagrams","description":"As CockroachDB approaches beta, user documentation has become increasingly important, and one of the meatiest requirements is documentation of our SQL implementation. For inspiration, I researched how other databases have documented SQL. The most effective example I found was SQLite&#x2019;s grammar diagrams.\nFigure 1: Example of the alter table statement in SQLite&#x2019;s grammar diagrams. These diagrams feature easy-to-understand railroad diagrams showing the possible options for a SQL statement. Compared to a text representation, these visual diagrams give users an intuitive way to explore the grammar and discover features.","link":"https://www.cockroachlabs.com/blog/efficient-documentation-using-sql-grammar-diagrams/","owner":"Cloudflare"},{"title":"Monetize With Google Admob In A NativeScript Mobile App","description":"\n                    <p>So you just made a fancy new <a href=\"https://www.nativescript.org/\">NativeScript</a> Android and iOS application and you’re looking to earn a little cash. There are many solutions out there, for example you could include InAppBilling or list your application as a paid application. You can also include advertisements in your application using various ad networks such as Google Admob.</p>\n<p>We’re going to take a look at how to include <a href=\"https://www.admob.com/\">Google Admob</a> in a NativeScript iOS and Android mobile application with the intent of earning a little extra money. Now this is going to use vanilla NativeScript. If you’re looking for instructions on how to do this with Angular, check out the guide I wrote <a href=\"https://www.thepolyglotdeveloper.com/2016/11/google-admob-nativescript-angular-2/\">here</a>.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/03/monetize-wi","link":"https://www.thepolyglotdeveloper.com/2016/03/monetize-with-google-admob-in-a-nativescript-mobile-app/","owner":"Nelson Elhage"}]