[{"title":".NET Fringe is back!","description":"And we’re back! Yes it’s true, .NET Fringe is back! We’re gathering back in Portland from July 10th through 12th for 3 days of unadulterated .NET OSS awesomeness. Last year we had a magical event, and we heard you tell … ","link":"http://feedproxy.google.com/~r/CodeBetter/~3/IMGQmqvqsBU/","owner":"CockroachDB"},{"title":"Connect to a Raspberry Pi Zero with a USB Cable and SSH","description":"\n                    <p>As some of you may know, I have a hoarding problem. I am hoarding <a href=\"https://www.raspberrypi.org/\">Raspberry Pi</a> microcomputers. In my personal collection I have one from each generation, making four standard units. Well, I recently picked up another unit, but this time a Raspberry Pi Zero. These things are about the size of a nine volt battery, but pack some serious punch. The problem is they are incredibly rare because they retail for only $5.00.</p>\n<p>Unlike the standard Raspberry Pi units, these do not have WiFi, ethernet, or standard sized USB ports. This changes things when it comes to connecting. We’re going to take a look at getting set up with one of these Pi Zero IoT devices and be on your way towards some cool hack projects.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/06/connect-raspberry-pi-zero-usb-cable-ssh/'>Connect to a Raspberry Pi Zero with a USB Cable ","link":"https://www.thepolyglotdeveloper.com/2016/06/connect-raspberry-pi-zero-usb-cable-ssh/","owner":"Nelson Elhage"},{"title":"WebUI Security Vulnerability Resolved in uTorrent/BitTorrent","description":"On Feb 1, 2016 we were informed about a DLL planting[1] vulnerability in uTorrent/BitTorrent by the team behind The Zero Day Initiative[2]. All versions of uTorrent prior to 3.4.7.42330 and BitTorrent 7.9.7.42331 are affected. Older versions of uTorrent/BitTorrent would “pin” netprofm.dll at startup in an attempt to mitigate a (an old) crash due to premature […]","link":"https://engineering.bittorrent.com/2016/06/16/webui-security-vulnerability-resolved-in-utorrentbittorrent/","owner":"Bitly"}]