[{"title":"Creating a Framework for both iOS and watchOS","description":"The try! Swift app runs on both iOS and watchOS, and I’d like to expand it to support fancy extensions and possibly something with iMessage. While I was ok duplicating the Model layer between the two platforms initially, as more extensions and platforms are something I want to code quickly on, it was time to move that code out into a framework.","link":"https://www.natashatherobot.com/creating-a-framework-for-both-ios-and-watchos/","owner":"Mykhailo Kozik"},{"title":"How to Reuse Paging Interface Controllers in watchOS","description":"I've been trying to figure out how to reuse the same interface controller code for all my interface controllers in a watchOS paging navigation, and finally did. But this solution comes at a price... ","link":"https://www.natashatherobot.com/how-to-reuse-paging-interfacecontrollers-in-watchos/","owner":"Mykhailo Kozik"},{"title":"Scan For Bluetooth Enabled iBeacons Via A Raspberry Pi IoT Device","description":"\n                    <p>Lately I’ve been working a lot with iBeacons and Raspberry Pi Internet of Things (IoT) devices. I’ve been building an office monitor for logging foot traffic around the office. I planted a few <a href=\"https://www.raspberrypi.org/\">Raspberry Pi</a> devices around the office and distributed some <a href=\"https://store.gimbal.com/\">Gimbal iBeacons</a> to a few of my coworkers so I could determine what part of the office experiences the most heat.</p>\n<p>While Raspberry Pi 3 devices come with integrated bluetooth, Raspbian Linux is not configured to support BLE scanning. There are a few packages that must be installed to make BLE scanning possible.</p>\n<p>We’re going to see what is necessary to scan for BLE iBeacons using a Raspberry Pi with Raspbian Linux installed.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/09/scan-bluetooth-enabled-ibeacons-via-raspberry-pi-iot-device/'>Scan For ","link":"https://www.thepolyglotdeveloper.com/2016/09/scan-bluetooth-enabled-ibeacons-via-raspberry-pi-iot-device/","owner":"Nelson Elhage"}]