[{"title":"Native Android 101: A Quickstart to Building Android Apps","description":"\n                    <p>I am pleased to announce that my third full length quickstart course, <strong>Native Android 101: A Quickstart to Building Android Apps</strong>, was published on the learning website <a href=\"https://www.udemy.com/native-android-101/?couponCode=ANDEV10\">Udemy</a>. The course follows in the same direction as my <a href=\"https://www.thepolyglotdeveloper.com/2015/10/ionic-framework-101-a-quickstart-to-building-mobile-apps/\">Ionic Framework 101</a> and <a href=\"https://www.thepolyglotdeveloper.com/2015/11/nativescript-101-a-quickstart-to-building-mobile-apps/\">NativeScript 101</a> quickstart courses, but this time instead of a hybrid technology we’re using the native Android SDK.</p>\n<p>If you’re unfamiliar with the native Android SDK, it is the development kit that Google published for developing Android applications using the Java programming language.</p>\n<p>A little background on what I had hoped to accomplish in this course.</p>\n                    \n          ","link":"https://www.thepolyglotdeveloper.com/2016/01/native-android-101-a-quickstart-to-building-android-apps/","owner":"Nic Raboy"},{"title":"Use ng2-cordova-oauth For All Your Ionic Oauth Needs","description":"\n                    <p>Previously I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2016/01/using-an-oauth-2-0-service-within-an-ionic-2-mobile-app/\">using Oauth within an Ionic 2 mobile application</a>. However, for the typical user that can be a real hassle because it by far isn’t short. This is why I created the library <a href=\"https://github.com/nraboy/ng2-cordova-oauth\">ng2-cordova-oauth</a> on GitHub. This library has numerous web service providers bundled in, making the authentication flow as short as three lines of code.</p>\n<p>Now some of you might be familiar with the <a href=\"https://github.com/nraboy/ng-cordova-oauth\">ng-cordova-oauth</a> library that I wrote for Ionic Framework 1. That library was designed to work with Apache Cordova and AngularJS. This time around I did the same thing for Angular and Apache Cordova.</p>\n<p>Let’s take a look at how easy this new library really is.</p>\n                    \n                        <p>The post <a rel='nofollow' hr","link":"https://www.thepolyglotdeveloper.com/2016/01/use-ng2-cordova-oauth-for-all-your-ionic-2-oauth-needs/","owner":"Nic Raboy"}]