[{"title":"Putting ariejan.net on a diet: a 69% reduction","description":"You may have recently read Website Obesity by Maciej Cegłowski, as featured on Hacker News. There&rsquo;s a lot of great stuff in that article. The most obivous and striking thing is that there is a lot of bloat on the web. Examples include a tweet (140 characters) that is served as a 900kB website. How to optimize a website and remove bloat is a topic in and of itself. I can highly recommend the article mentioned above.","link":"https://www.devroom.io/2016/01/06/putting-ariejan-net-on-a-diet-a-69-percent-reduction/","owner":"Antirez"},{"title":"Running Apache Flink on Amazon Elastic Mapreduce","description":"<p>I love really <a href=\"https://aws.amazon.com/elasticmapreduce/\">Amazon EMR</a>.  Over the years it’s grown from being “Hadoop on-demand” to a full-fledged cluster management system for running OSS big-data apps (Hadoop MR of course, but also Spark, Hue, Hive, Pig, Oozie and more).</p>\n\n<p>While Hadoop out of the box supports reading from S3, EMR has a proprietary implementation called EMRFS that has some nice features.  For those reasons, it’s really the best Hadoop cluster to use if you’re storing your data in S3.</p>\n\n<p>Lately I’ve been experimenting a lot with <a href=\"http://flink.apache.org/\">Apache Flink</a> to replace MR as the excution fabric.  At work, we have many, many jobs written in Scalding.  <a href=\"/scala/hadoop/hdfs/sclading/flink/streaming/realtime/2015/12/20/running-scalding-jobs-on-apache-flink/\">Flink can execute Scalding jobs with some very simple modifications</a> which was a great way to move our jobs from MR to a more memory-centric data processing model.","link":"http://themodernlife.net/scala/hadoop/hdfs/sclading/flink/streaming/realtime/emr/aws/2016/01/06/running-apache-flink-on-amazon-elastic-mapreduce/","owner":"Hypriot"},{"title":"Show Native Toast Notifications In An Ionic Mobile App","description":"\n                    <p>A popular way to display notifications within a mobile app is through Toast notifications. Previously I demonstrated how to display these <a href=\"https://www.thepolyglotdeveloper.com/2014/09/show-native-toast-notifications-using-ionic-framework/\">notifications using Ionic Framework 1</a>, but with Ionic 2 being all the rage, I figured it would make sense to demonstrate how to do this again.</p>\n<p>iOS has no true concept of a Toast notification like Android does, but using the great <a href=\"https://github.com/EddyVerbruggen/Toast-PhoneGap-Plugin\">plugin by Eddy Verbruggen</a>, we can make it possible in iOS. This is the same plugin we make use of in the Ionic Framework 1 tutorial.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/01/show-native-toast-notifications-in-an-ionic-2-mobile-app/'>Show Native Toast Notifications In An Ionic Mobile App</a> appeared first on <a rel='nofollow' ","link":"https://www.thepolyglotdeveloper.com/2016/01/show-native-toast-notifications-in-an-ionic-2-mobile-app/","owner":"Nelson Elhage"}]