[{"title":"\nIs Redlock safe?\n","description":"Martin Kleppmann, a distributed systems researcher, yesterday published an analysis of Redlock (http://redis.io/topics/distlock), that you can find here: http://martin.kleppmann.com/2016/02/08/how-to-do-distributed-locking.html\n","link":"\nhttp://antirez.com/news/101\n","owner":"Andrey Akinshin"},{"title":"Create An iOS Or Android Device Screencast","description":"\n                    <p>When you release your mobile Android or iOS application to the various app stores you’ll be asked to submit a video for your app. Although optional, it is a great idea to do one in order to boost your app store optimization (ASO). So how do you get a video demo of your app?  Using tools you probably already have installed you can create a screencast of your iOS or Android application.</p>\n<p>We’re going to see how to create a screencast for both platforms.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/02/create-an-ios-or-android-device-screencast/'>Create An iOS Or Android Device Screencast</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/02/create-an-ios-or-android-device-screencast/","owner":"Nelson Elhage"},{"title":"Interactive Playgrounds","description":" Xcode 7.3 beta 3 adds interactive iOS and OS X playgrounds that allow you to click, drag, type, and otherwise interact with the user interfaces you code into your playground. These interfaces react just as they would within a full application. Interactive playgrounds help you to quickly prototype and build your applications, and simply provide another great way to interact with your code.  Any view or view controller that is assigned to the  liveView  property of the  XCPlaygroundPage  is automatically made interactive, and since it runs within a playground you get all the usual playground results. You can experiment with gesture recognizers, see how  UITableView  creates and dequeues cells as you scroll, or interact with a complex 3D scene in SceneKit.  Sample playground  Below is an iOS playground that uses UIKit Dynamics to create a fully-interactive and customizable  Newton’s Cradle , perfect for your desktop.    ","link":"https://developer.apple.com/swift/blog/?id=35","owner":"Sketch"}]