[{"title":"How do Native Extensions Manage Memory? Part 1: Ruby (MRI)","description":"<p>One of the most interesting design challenges in a\nprogramming language interpreter or VM is what kind of\nmemory management API to offer to native extensions.</p>\n\n<p>This issue is more or less invisible unless you’re writing a\nnative extension.  When you are simply writing a program in\nRuby, Python, Lua, etc., you don’t usually care how the\nmemory management is implemented.  You only care is that you\ncan create objects with reckless abandon and that they will\nget cleaned up for you, somehow.  The people who write the\nVM get a lot of latitude in how to actually implement this\ncleanup because the implementation is so hidden from user\nprograms.  Different VMs can use completely different\nstrategies, even for the same language!  For example,\nCPython uses reference counting whereas PyPy uses tracing,\neven though both are VMs for Python.</p>\n\n<p>But when the VM offers a C/C++ API for native extensions, it\nusually exposes more implementation details.  Memory\nmanagement tasks that would be","link":"https://blog.reverberate.org/2016/06/12/native-extensions-memory-management-part1-ruby-mri.html","owner":"Jonathan Snook"},{"title":"Premium Members Only Content Is Coming To The Polyglot Developer","description":"\n                    <p>Back in 2014 I started blogging on The Polyglot Developer which was previously known as Nic Raboy’s Code Blog. Since then I’ve published more than 250 blog articles, more than 100 video tutorials, and even three premium courses. The Polyglot Developer is evolving again, this time with premium members only content in addition to the free content I plan to continue to produce.</p>\n<p>Here we’re going to see about what is coming on this blog and how it can benefit you, the awesome developer and loyal subscriber to my content.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2016/06/premium-members-content-coming-polyglot-developer/'>Premium Members Only Content Is Coming To The Polyglot Developer</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2016/06/premium-members-content-coming-polyglot-developer/","owner":"Nelson Elhage"}]