[{"title":"DockerCon 2017 Demo: Monitoring Docker Swarm with LED's","description":"<p>At DockerCon 2017 in Austin I gave a presentation of a Raspberry Pi cluster mixed with some UP boards. The audience really liked the visual effects of the Docker Swarm scaling a service up and down. So I show you some background details what you need to run that demo on your Raspberry Pi cluster as well.</p>\n\n<p><img src=\"https://blog.hypriot.com/images/dockercon2017/stage2.jpg\" alt=\"PiCloud at DockerCon Austin\" /></p>\n\n<p></p>\n\n<p>All the effort played off to build that cluster, to find out how to drive LED&rsquo;s in swarm mode, to put it into my bag and go through customs on my flight from Germany to Austin, Texas. It really was fun to show this the audience and everybody liked it.</p>\n\n<p>To enable you to replay the demo with some Pimoroni Blinkt! LED&rsquo;s and Raspberry Pi - regardless if you only have Pi Zeros I want to show you the Docker images I used and the commands to show the scaling demo.</p>\n\n<p>The Docker image <a href=\"https://hub.docker.com/r/stefanscherer/monitor","link":"https://blog.hypriot.com/post/dockerconaustin2017/","owner":"Huon Wilson"},{"title":"Using The Docker Client With A Remote Machine Or Virtual Private Server","description":"\n                    <p>Not too long ago I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2017/03/nginx-reverse-proxy-containerized-docker-applications/\">containerizing a bunch of web applications</a> and putting them behind an NGINX reverse proxy. This is because I’ve been exploring the possibility of taking all my personal applications and turning them into <a href=\"https://www.docker.com/\">Docker</a> containers for easy maintenance and portability. I currently use <a href=\"https://www.digitalocean.com/?refcode=ee4903914bb4\">Digital Ocean</a> and if I had to guess, I’m going to be using it for a lot longer as it is a great service. So what does it take to get containerized applications on Digital Ocean or any other remote machine?</p>\n<p>We’re going to take a look at creating and defining a remote machine in Docker and deploying containers on it.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/0","link":"https://www.thepolyglotdeveloper.com/2017/04/docker-client-remote-machine-virtual-private-server/","owner":"Nelson Elhage"},{"title":"Writing an effective bug report","description":"<p>When we write bug reports, most of the time we have a clear vision of what just happened or what steps were taken in order to reach to a situation where something not expected happened. It is obvious to us at the moment, so we communicate it with very few notes because it’s very obvious, paste a screenshot and that should make it obvious to the developer what went wrong, right?</p>\n<p class=\"poet-read-more\"><a href=\"/blog/writing-an-effective-bug-report\" title=\"Read more of Writing an effective bug report\">Continue reading</a></p>","link":"https://mixmax.com/blog/writing-an-effective-bug-report","owner":"Microsoft Python Engineering"}]