[{"title":"CockroachDB Beta Passes Jepsen Testing","description":"Almost a year ago, we wrote about our use of Jepsen in testing CockroachDB. As we prepare for CockroachDB 1.0, we wanted to get independent verification of our findings, so last fall we hired Kyle Kingsbury, the author of Jepsen, to review our tests and add more of his own. Last week, Kyle published his results.\nKyle&#x2019;s testing found two new bugs: one in CockroachDB&#x2019;s timestamp cache which could allow inconsistencies whenever two transactions are assigned the same timestamp, and one in which certain transactions could be applied twice due to internal retries.","link":"https://www.cockroachlabs.com/blog/cockroachdb-beta-passes-jepsen-testing/","owner":"CockroachDB"},{"title":"Page object pattern for javascript components testing","description":"\n<p><a href=\"http://www.seleniumhq.org/docs/06_test_design_considerations.jsp#page-object-design-pattern\">Page object\npattern</a>\nis common practice when writing automated tests using <a href=\"http://www.seleniumhq.org/\">selenium</a>. It\nallows to gather all possible operations on the page in one place and hide page implementation\ndetails from test case. Page object pattern can be used in the same way for angular directives,\nreact and [put framework name here] components.</p>\n<p><a href=\"https://blog.pchudzik.com/201702/page-object-for-components-testing/\">Read more</a></p>","link":"https://blog.pchudzik.com/201702/page-object-for-components-testing/","owner":"Paweł Chudzik"},{"title":"Socket API thoughts","description":"","link":"https://idea.popcount.org/2017-02-23-socket-api-thoughts","owner":"Marek Majkowski"},{"title":"Solar Flare For Cloudflare Released On Android And iOS","description":"\n                    <p>I am pleased to announce that Solar Flare for Cloudflare, my first mobile development project in a long time, has been published to the iTunes App Store and Google Play!</p>\n<p>So what is Solar Flare and who is it designed for?  This is a free application for managing data stored in Cloudflare on <a href=\"https://itunes.apple.com/us/app/solar-flare-for-cloudflare/id1207700575\">iOS</a> and <a href=\"https://play.google.com/store/apps/details?id=com.nraboy.solarflare\">Android</a>. If you’re unfamiliar, <a href=\"https://www.cloudflare.com/\">Cloudflare</a> is an amazing service that acts as a content delivery network (CDN), among other things related to web performance and security.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/02/solar-flare-cloudflare-released-android-ios/'>Solar Flare For Cloudflare Released On Android And iOS</a> appeared first on <a rel='nofollow' href='https://www.","link":"https://www.thepolyglotdeveloper.com/2017/02/solar-flare-cloudflare-released-android-ios/","owner":"Nic Raboy"},{"title":"Using custom rkt stage1 images to test against various kernel versions","description":"Introduction When writing software that is tightly coupled with the Linux kernel, it is necessary to test on multiple versions of the kernel. This is relatively easy to do locally with VMs, but when working on open-source code hosted on Github, one wants to make these tests a part of the project’s continuous integration (CI) system to ensure that each pull request runs the tests and passes before merging.\nMost CI systems run tests inside containers and, very sensibly, use various security mechanisms to restrict what the code being tested can access.","link":"/blog/2017/02/using-custom-rkt-stage1-images-to-test-against-various-kernel-versions/","owner":"Kinvolk"}]