[{"title":"Events in spring","description":"\n<div class=\"paragraph\">\n<p>With spring 4.2 (released more than one year ago) serious improvements regarding embedded events\nwere made. You probably already know it, but I&#8217;ve never had a chance to properly investigate it.\nLately, when digging into code base of the system I&#8217;m currently working on I got an opportunity to\nsee it in action and after quick glimpse, I decided to investigate it a bit further.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201708/spring-events/\">Read more</a></p>","link":"https://blog.pchudzik.com/201708/spring-events/","owner":"Paul Lewis"},{"title":"How We Did It: Building \"Game of Unknowns\" on VanityFair.com","description":"From wireframes to the game","link":"https://technology.condenast.com/story/vanity-fair-game-of-unknowns","owner":"Commercetools"},{"title":"Reflecting on performance testing","description":"<p>Performance is an important feature for many projects.\nUnfortunately, it&rsquo;s an all too common situation when a developer accidentally spoils the performance adding some new code.\nAfter a series of such incidents, people often start to think about performance regression testing.</p>\n<p>As developers, we write unit tests all the time.\nThese tests check that our business logic work as designed and that new features don&rsquo;t break existing code.\nIt looks like a good idea to write some perf tests as well, which will verify that we don&rsquo;t have any performance regressions.</p>\n<p>Turns out this is harder than it sounds.\nA lot of developers don&rsquo;t write perf tests at all.\nSome teams write perf tests, but almost all of them use their own infrastructure for analysis\n(which is not a bad thing in general because it&rsquo;s usually designed for specific projects and requirements).\nThere are a lot of books about test-driven development (TDD),\nbut there are no books about perform","link":"https://aakinshin.net/posts/reflecting-on-performance-testing/","owner":"Andrew Ray"},{"title":"Tasks in your sequences","description":"<p>You know that sending email isn’t enough to connect with prospects: you’re calling, sending InMails, tweeting, writing letters, and more. Creativity wins. </p><p class=\"poet-read-more\"><a href=\"/blog/sequences-tasks\" title=\"Read more of Tasks in your sequences\">Continue reading</a></p>","link":"https://mixmax.com/blog/sequences-tasks","owner":"Microsoft Python Engineering"},{"title":"Website performance monitoring tool","description":"Monitoring systems allow you to monitor changes to your front-end code base over time, catching any regression issues and monitoring the ongoing effects of any performance optimisation changes. Easy to use dashboards are a must when it comes to monitoring the state of your web apps. Companies like Calibre or SpeedCurve offer this as a… ","link":"https://blog.fedecarg.com/2017/08/01/website-performance-monitoring-open-source-tool/","owner":"Fabrizio Branca"}]