[{"title":"CSS System Font Stack Monospace v1","description":"Right now, most browsers use something like Courier for their default monospace font. This isn&#39;t very useful and not acceptable for code or programming samples.\nFortunately, it’s not hard to create a CSS-based system font stack with great monospace fonts. This expands on the work in System Shock Mono that originally described making a monospace CSS system font stack.\nCSS Below is a high-quality, monospace stack, that works on most modern (last eight years) systems.","link":"https://www.client9.com/css-system-font-stack-monospace-v1/","owner":"Nick Galbreath"},{"title":"CSS System Font Stack Sans Serif v1","description":"This is best for buttons and other UI elements on the page, but it also works for body text.\nThe CSS /* 1: Safari/Mac special, BlinkMac is the current * Chrome method for using the macOS system font * 2: Recent windows * 3: Older Macs, * 4: system default, */ font-family: /* 1 */ -apple-system, BlinkMacSystemFont, /* 2 */ &#34;Segoe UI&#34;, /* 3 */ Helvetica Neue, /* 4 */ sans-serif; This is what it looks like on your browser:","link":"https://www.client9.com/css-system-font-stack-sans-serif-v1/","owner":"Nick Galbreath"},{"title":"CSS System Font Stack Serif Charter v1","description":"It was originally designed in 1987 for print. In 1987 that meant 300 dpi laser printers. That&#39;s very close to what we call retina or HiDPI for screens today. They are not exactly the same but Charter holds up well on today&#39;s screens.\nMacOS and iOS now make Charter available as a system font, so it&#39;s great choice. It&#39;s also a free font, and so likely installed on many linux and Windows systems as well.","link":"https://www.client9.com/css-system-font-stack-serif-charter-v1/","owner":"Nick Galbreath"},{"title":"CSS System Font Stack Serif Large v1","description":"The large serif font stack uses a number of more-styled serif system fonts that also have a larger size. While this can be used as body text, they might be best at larger sizes for headlines.\nAll fonts in this stack use old style, proportional numbers making them inappropriate for numeric tables.\nCSS font-family: /* 1 */ &#34;Hoefler Text&#34;, /* 2 */ Constantia, /* 3 */ Georgia, /* 4 */ serif; This is what it looks like on your browser:","link":"https://www.client9.com/css-system-font-stack-serif-large-v1/","owner":"Nick Galbreath"},{"title":"CSS System Font Stack Serif Medium v1","description":"This system font stack is of a medium size, and suitable for body text and larger headlines. The primary fonts are based on variations of Palatino that are similar in size and use similar numeric forms.\nMac users get a nice upgrade from Palatino using Iowan Old Style. For Windows users there is no obvious alternate.\nFor linux and other systems, I let it fall to the default `serif` as it&#39;s unclear what the right thing to is.","link":"https://www.client9.com/css-system-font-stack-serif-medium-v1/","owner":"Nick Galbreath"}]