[{"title":"GIFS: Why do They Look Like That?","description":"Here at GIPHY we work with GIFs every day. Sometimes, however, it pays to stop and ask “What exactly is a GIF?”. Since the format is over thirty years old, it has some real limitations, so it is worth asking: “What are they? What does it do well? And what can’t it do?\r\n\r\nThe GIF format has a distinctive look, one that we at GIPHY are familiar with. Watch this talk to learn more about how we examine why GIFs look the way they do and a lot more….","link":"https://engineering.giphy.com/gifs-why-do-they-look-like-that/","owner":"Gilt"},{"title":"Helpful: Adding Contextual Help to Emacs","description":"<p>I’ve just released <a href=\"https://github.com/Wilfred/helpful\">Helpful</a>, a\nnew way of getting help in Emacs!</p>\n\n<p><img src=\"/assets/helpful.png\" /></p>\n\n<p>The <code class=\"highlighter-rouge\">*Help*</code> built-in to Emacs is already pretty good. Helpful\ngoes a step further and includes lots of contextual info. Let’s take a\nlook.</p>\n\n<p>Have you ever wondered which major modes have a keybinding for a\nfunction? Helpful reports keybindings in all keymaps!</p>\n\n<p><img src=\"/assets/helpful_bindings.png\" /></p>\n\n<p>When you’re hacking on some new code, you might end up with old\nfunction aliases after renaming a function. Helpful provides\ndiscoverable debug buttons, so you don’t need to remember\n<code class=\"highlighter-rouge\">fmakunbound</code>.</p>\n\n<p><img src=\"/assets/helpful_tools.png\" /></p>\n\n<p>Helpful also has strong opinions on viewing docstrings. Summaries\nare given focus, and text is fontified. We solve the\n<code class=\"highlighter-rouge\">text-quoting-style</code> deb","link":"http://www.wilfred.me.uk/blog/2017/08/30/helpful-adding-contextual-help-to-emacs/","owner":"Vlad Mihalcea"},{"title":"restic cryptography","description":"kg-card-begin: markdown","link":"https://blog.filippo.io/restic-cryptography/","owner":"Federico Tomassetti"},{"title":"Team Rookie 2017","description":"<h1 id=\"who-we-are\">Who We Are</h1>\n\n<p align=\"center\">\n<img src=\"/assets/images/team-rookie-2017/team.png\" width=\"940\" />\n</p>\n\n<p>Team-Rookie-2017, as we pride ourselves with being the most awesome team ever, has spent the summer improving the browsing experience for Gilt users as well as to collect data for our personalization team. The end result of our project included the crafted front-end user experience and a back-end service for data processing.</p>\n\n<h1 id=\"project-ideation\">Project Ideation</h1>\n<p>The final project idea rose to the top through countless meetings and discussions with various teams in the organization. With the initially decided problem-solution proven to be unexecutable, our team, along with all of our mentors, took efforts to come up with a new solution to solve the given problem with the limited resources we had. This immersive process, in the very beginning of the program, ensured the understanding of the engineering problem and established the success of","link":"http://tech.gilt.com/internship/2017/08/30/team-rookie","owner":"Geoblink"},{"title":"The Cross-Cloud Migration","description":"As a CockroachDB Tech Writer, when I document a new feature, generally, I first try to learn the business value behind it, then I test the feature thoroughly, and then I try to write up concise, informative guidance for users. Sometimes, the business value and usage aren&#x2019;t unique to CockroachDB (it&#x2019;s a SQL database, after all, and SQL has been around for a while). Other times, I get to document capabilities so novel and powerful that straight-up user documentation just doesn&#x2019;t seem enough.","link":"https://www.cockroachlabs.com/blog/cross-cloud-migration/","owner":"Cloudflare"}]