[{"title":"AWS Elastic Beanstalk and Private Docker Hub Repos","description":"","link":"https://developers.500px.com/aws-elastic-beanstalk-and-private-docker-hub-repos-8ba823813642?source=rss----5d9282daaaa1---4","owner":"Engineering Blogs"},{"title":"From boiling lead and black art: An essay on the history of mathematical typography","description":"<p><img src=\"/img/1-over-nsquared.png\" alt=\"\" title=\"Math fonts from six different type systems\" />\n<em>Math fonts from six different type systems, courtesy <a href=\"http://chalkdustmagazine.com/blog/is-there-a-perfect-maths-font/\">Chalkdust</a></em></p>\n\n<p>I’ve always felt like constructing printed math was much more of an art form than regular typesetting. Someone typesetting mathematics is less a “typist” and more an artist attempting to render abstract data on a two-dimensional surface. Mathematical symbols are themselves a language, but they are fundamentally a <em>visual representation</em> of human-conceived knowledge—knowledge that would be too inefficient to convey through verbal explanations. This brings the typesetting of mathematics closer to a form of data visualization than regular printed text.</p>\n\n<p>No matter how hard it’s ever been to create printed text, creating printed math has <em>always</em> been even harder. In pre-digital times, equation-laden texts were know","link":"http://www.practicallyefficient.com/2017/10/13/from-boiling-lead-and-black-art.html","owner":"Drew DeVault"},{"title":"Running Kubernetes on Travis CI with minikube","description":"It is not easily possible to run Kubernetes on Travis CI , as most methods of setting up a cluster need to create resources on AWS, or another cloud provider. And setting up VMs is also not possible as Travis CI doesn&rsquo;t allow nested virtualization. This post explains how to use minikube without additional resources, with a few simple steps.\nOur use case As we are currently working with Chef on a project to integrate Habitat with Kubernetes( Habitat Operator ), we needed a way to run the end-to-end tests on every pull request.","link":"/blog/2017/10/running-kubernetes-on-travis-ci-with-minikube/","owner":"King"}]