[{"title":"CockroachDB for Windows Users","description":"For the first two years of CockroachDB&#x2019;s existence, the Windows installation instructions read like this:\nInstall Docker. Get the latest CockroachDB Docker image: docker pull cockroachdb/cockroach The instructions were deceptively short, considering that they amounted to downloading a supported operating system (Linux), booting it in a hypervisor, and running CockroachDB inside of that virtual machine.\nThe layers of indirection in this scheme caused no shortage of problems. Docker containers excel at isolating a process from the outside world, but a distributed database like CockroachDB needs just the opposite: each node needs to communicate over the network with other nodes in the cluster and write persistent data to the filesystem.","link":"https://www.cockroachlabs.com/blog/windows-binary/","owner":"Cloudflare"},{"title":"How good are decisions?","description":"\n\n<p>A statement I commonly hear in tech-utopian circles is that some seeming inefficiency can’t actually be inefficient because the market is efficient and inefficiencies will quickly be eliminated. A contentious example of this is <a href=\"//danluu.com/tech-discrimination/\">the claim that companies can’t be discriminating because the market is too competitive to tolerate discrimination</a>. A less contentious example is that when you see a big company doing something that seems bizarrely inefficient, maybe it’s not inefficient and you just lack the information necessary to understand why the decision was efficient.</p>\n\n<p>Unfortunately, arguments like this are difficult to settle because, even in retrospect, it’s usually not possible to get enough information to determine the precise “value” of a decision. Even in cases where the decision led to an unambiguous success or failure, there are so many factors that led to the result that it’s difficult to figure out precisely why somethi","link":"https://danluu.com/bad-decisions/","owner":"Daily Tech Video"},{"title":"Repair: Denon AVR-4520","description":"This unit sold from 2012-2015 as the top-of-the line AV Network Receiver from Denon. I got my hands on a unit with power protection issues. Here&rsquo;s the repair log the Denon AVR-4520.","link":"https://www.devroom.io/projects/repair-denon-avr-4520/","owner":"Antirez"},{"title":"Team outbox: See all of your team’s outgoing messages","description":"I’m excited to share the new team outbox. Now you have complete visibility into your team’s communication<p class=\"poet-read-more\"><a href=\"/blog/team-outbox\" title=\"Read more of Team outbox: See all of your team’s outgoing messages\">Continue reading</a></p>","link":"https://mixmax.com/blog/team-outbox","owner":"Microsoft Python Engineering"}]