[{"title":"Connect To A Raspberry Pi And Pi Zero With A USB To TTL Serial Cable","description":"\n                    <p>When it comes to configuring a Raspberry Pi for the first time, there are a few options, many of which can be a pain. This includes configuration of a Raspberry Pi and the smaller Pi Zero. Previously I had written about <a href=\"https://www.thepolyglotdeveloper.com/2016/02/use-your-raspberry-pi-as-a-headless-system-without-a-monitor/\">using a Raspberry Pi as a headless unit</a>, but in that tutorial there was an ethernet requirement. Recently I had written about <a href=\"https://www.thepolyglotdeveloper.com/2016/06/connect-raspberry-pi-zero-usb-cable-ssh/\">connecting to a Pi Zero through a standard micro USB cable and SSH</a>, which wasn’t difficult, but it required a few potentially time consuming steps.</p>\n<p>Is there a better way to connect to and configure these Internet of Things (IoT) devices?</p>\n<p>I wouldn’t necessarily call it a better way, but more of another option towards Raspberry Pi configuration. You can actually connect to the Raspberry Pi and ","link":"https://www.thepolyglotdeveloper.com/2017/02/connect-raspberry-pi-pi-zero-usb-ttl-serial-cable/","owner":"Nelson Elhage"},{"title":"NuGet2 and a DirectorySeparatorChar bug","description":"<p>In <a href=\"https://www.jetbrains.com/rider/\">Rider</a>, we care a lot about performance.\nI like to improve the application responsiveness and do interesting optimizations all the time.\nRider is already well-optimized, and it&rsquo;s often hard to make significant performance improvements, so usually I do micro-optimizations which do not have a very big impact on the whole application.\nHowever, sometimes it&rsquo;s possible to improve the speed of a feature 100 times with just a few lines of code.</p>\n<p>Rider is based on <a href=\"https://www.jetbrains.com/resharper/\">ReSharper</a>, so we have a lot of cool features out of the box.\nOne of these features is <a href=\"https://www.jetbrains.com/help/resharper/2016.3/Code_Analysis__Solution-Wide_Analysis.html\">Solution-Wide Analysis</a>\nwhich lets you constantly keep track of issues in your solution.\nSometimes, solution-wide analysis takes a lot of time to run because there are many files which should be analyzed.\nOf course, it works sup","link":"https://aakinshin.net/posts/nuget2-and-directoryseparatorchar/","owner":"Andrew Ray"},{"title":"Teamwork Gets a New Home","description":"","link":"https://engineroom.teamwork.com/teamwork-gets-a-new-home-2931a27a1346?source=rss----cea4eecd5960---4","owner":"TaskRabbit"}]