[{"title":"Mixmax Advent 2017","description":"<p>We at Mixmax are excited to introduce our second annual Engineering Blog Advent Calendar!\n<a href=\"/blog/mixmax-eng-advent-2016\">Last year</a>, we ushered in the holidays with twelve\none per day blog posts. That went over so well, we’ve decided to make it an annual tradition! </p>\n<p class=\"poet-read-more\"><a href=\"/blog/mixmax-eng-advent-2017\" title=\"Read more of Mixmax Advent 2017\">Continue reading</a></p>","link":"https://mixmax.com/blog/mixmax-eng-advent-2017","owner":"Microsoft Python Engineering"},{"title":"Repair: Hewlet Packard 34401A Bench Multimeter","description":"After watching The Signal Path for some I decided to treat myself to a classic 34401A 6½ digit multimeter.","link":"https://www.devroom.io/projects/repair-hp-34401a-bench-multimeter/","owner":"Antirez"},{"title":"Send Emails With Mailgun Using Golang","description":"\n                    <p>When building an application of any kind, there may be a need to have it send emails. For example, let&rsquo;s say you&rsquo;re building a script and that script needs to send a report through email when it has completed. Or another example is a web application with a form for collecting user feedback. There are many more application scenarios beyond the two listed.</p>\n<p>Now let&rsquo;s say that you don&rsquo;t have your own email server for sending emails.</p>\n<p>Sending emails without a server is easy when you use a transactional email service like the <a href=\"https://www.mailgun.com/\">Mailgun</a> API. Through HTTP, emails can be sent from any application and for a very affordable price. We&rsquo;re going to see how to send emails using Mailgun with Golang.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/12/send-emails-mailgun-using-golang/'>Send Emails With Mailgun Using Golang<","link":"https://www.thepolyglotdeveloper.com/2017/12/send-emails-mailgun-using-golang/","owner":"Nelson Elhage"},{"title":"The Making of a GIF Music Video","description":"When singer/songwriter Cassandra Kubinski recently visited the GIPHY office, she got inspired and thought of the idea to create a music video made entirely of GIFs. We weren’t sure if this had ever been done before, but it didn’t really matter – it sounded too fun not to try it ourselves. Cassandra has a great […]","link":"https://engineering.giphy.com/the-making-of-a-gif-music-video/","owner":"Gilt"},{"title":"Twitch invites you to take on the ICME 2018 Grand Challenge","description":"","link":"https://medium.com/twitch-news/twitch-invites-you-to-take-on-the-icme-2018-grand-challenge-2b3824d3537b?source=rss----3ae745429979--engineering","owner":"Twitter"}]