[{"title":"Bot-Building With launch-vehicle-fbm","description":"A guided tour of Condé Nast's Facebook Messenger SDK for chat bots","link":"https://technology.condenast.com/story/bot-building-with-launch-vehicle-fbm","owner":"Condé Nast"},{"title":"JavaScript Libraries In A TypeScript Application, Revisited","description":"\n                    <p>If you haven’t already gotten involved with it, you’ll probably know that TypeScript is becoming increasingly popular. Being able to use a superset of JavaScript in a typed language that compiles down to JavaScript is a great thing. However, if you’ve ever played around with TypeScript and tried to use JavaScript libraries, you’ll probably know that sometimes it can be a real pain. Often JavaScript libraries do not ship with type definitions which are critical when it comes to playing nice with TypeScript.</p>\n<p>If you’ve been keeping up with The Polyglot Developer you’ll probably remember two posts that were created. Previously I had written about <a href=\"https://www.thepolyglotdeveloper.com/2016/01/include-external-javascript-libraries-in-an-angular-2-typescript-project/\">including external JavaScript libraries in an Angular application</a> as well as <a href=\"https://www.thepolyglotdeveloper.com/2016/05/add-type-definitions-external-javascript-library-types","link":"https://www.thepolyglotdeveloper.com/2017/03/javascript-libraries-in-a-typescript-application-revisited/","owner":"Nic Raboy"},{"title":"Stormpath Joins Forces With Okta","description":null,"link":"https://stormpath.com/blog/stormpaths-new-path","owner":"Stormpath"},{"title":"The Diverse React Navigation Ecosystem","description":"<p>The routing ecosystem around React and React Native is quite different. One is characterized by a strong incumbent, and the other is plagued by rapid change.</p>\n\n<!--more-->\n\n<h3 id=\"react-js\">React JS</h3>\n\n<p>No question about it, React Router (<a href=\"https://github.com/ReactTraining/react-router\">ReactTraining/react-router</a>) is king here. They have the benefit of several years of active development, along with an active community submitting PR’s, fixes, etc. Supplement that with myriad tutorials and how-to’s and you end up with a well-supported, stable product. To be fair, React Router has suffered some major API upsets, and is nearly the poster-child for javascript fatigue but the maintainers have declared their lasting support for a few specific versions, which means you can plop down with V3 and be good to go for the next 12 to 24 months.</p>\n\n<h3 id=\"react-native\">React Native</h3>\n\n<p>Ok, this is where things start to get really, really crazy. The most important thing ","link":"https://reactjsnews.com/the-diverse-react-navigation-ecosystem","owner":"ReactJS News"}]