[{"title":"Automated Exploratory Test Fixtures","description":"This is part 3 in my series about  BDD and MicroServices. You may want to read part 1, and part 2 first.   As I have blogged about earlier, I have been spending some time exploring BDD/executable examples in a MicroServices environment, and how we can benefit from executable examples (SBE, Specification By Example) here at SpeedLedger. […]","link":"http://engineering.speedledger.com/automated-exploratory-test-fixtures/","owner":"Soundcloud"},{"title":"Calendar Meeting Types","description":"<p>Imagine if your calendar knew when, where and with whom you wanted meetings to happen.</p><p class=\"poet-read-more\"><a href=\"/blog/calendar-meeting-types\" title=\"Read more of Calendar Meeting Types\">Continue reading</a></p>","link":"https://mixmax.com/blog/calendar-meeting-types","owner":"Microsoft Python Engineering"},{"title":"GIPHY + Wharton NY Startup Trek","description":"GIPHY hosted students from The Wharton School of UPenn interested in emerging tech startups at the GIPHY office. We gave them an office tour, followed by a Q&A with a few GIPHY employees. This included some folks from all departments including Ops, Partnerships, Finance, Business Development, & Editorial.","link":"https://engineering.giphy.com/wharton-ny-startup-trek-giphy/","owner":"Gilt"},{"title":"Open Sourcing Daytona: A Framework For Automated and Application-agnostic Performance Analysis","description":"<p>By Sapan Panigrahi and Deepesh Mittal<b><br/></b></p><p>Today, we are pleased to offer <a href=\"https://github.com/yahoo/daytona\">Daytona</a>, an open-source framework for automated performance testing and analysis, to the community. Daytona is an application-agnostic framework to conduct integrated performance testing and analysis with repeatable test execution, standardized reporting, and built-in profiling support.</p><p>Daytona gives you the capability to build a customized test harness in a single, unified framework to test and analyze the performance of any application. You’ll get easy repeatability, consistent reporting, and the ability to capture trends. Daytona’s UI accepts a performance testing script that can run on a command line. This includes websites, databases, networks, or any workload you need to test and tune for performance. You can submit tests to the scheduler queue from the Daytona UI or from your CI/CD tool. You can deploy Daytona as a hosted service in your ","link":"https://yahooeng.tumblr.com/post/160987779296","owner":"Xmartlabs"},{"title":"Stack Overflow: Helping One Million Developers Exit Vim","description":null,"link":"https://stackoverflow.blog/2017/05/23/stack-overflow-helping-one-million-developers-exit-vim/","owner":"Squarespace"}]