[{"title":"Backup WordPress Database And Filesystem Data On Linux With Scripts","description":"\n                    <p>If you’re like me, you run a WordPress blog and are terrified of the thought of something going wrong. With core updates, theme updates, plugin updates, and server component updates, there is a lot of room for error. This is where a WordPress backup could help ease your mind.</p>\n<p>WordPress recommends taking a backup of your blog before any of these are done and there are even some popular plugins that will do this for you. For example, you could use the popular <a href=\"https://updraftplus.com/\">UpdraftPlus</a> or similar, but I believe there is room for error in those as well. While I could be wrong, I think WordPress must be in good shape for backup plugins to be successful.</p>\n<p>The alternative would be to create your own backup scripts that run on a cron schedule. We’re going to see how to do this for WordPress instances running on a Linux machine.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolygl","link":"https://www.thepolyglotdeveloper.com/2017/01/backup-wordpress-data-linux/","owner":"Nelson Elhage"},{"title":"On Goal Setting","description":"<blockquote>\n  <p>“You can get anything you want in life if you help enough other people get what they want.”</p>\n</blockquote>\n\n<p>When I started my career as a software developer, I wanted to be the best developer I can be. I thought the way to go about that was by learning a lot. Hence I would learn everything about the programming languages I was working with.</p>\n\n<p>I would read all famous tech blogs. I would catch up on hacker news front page. I would Google “must read books for software developers”, download the books, start reading them and would lose interest halfway through. I would participate in language, editor and framework wars online with so much enthusiasm.</p>\n\n<p>Whatever was the hot topic among the developers, I wanted to learn it. Big data, HTML 5, Clojure, R, Javascript frameworks, TDD. Once I learnt the modern frameworks I would loathe the decade old tools that I would have had to use at work. I would have conversations with colleagues on how a new piece of tech","link":"http://sudhagar.com/software-development/2017/01/02/on-goal-setting.html","owner":"Steve Yegge"}]