[{"title":"Look but don't type","description":"<p>Even though Gabe and I sometimes have slightly differing views on the iPad’s productivity value compared to the Mac, with his <a href=\"http://www.macdrifter.com/2017/06/the-last-mile-for-the-ipad.html\">latest post</a>, I think we are completely in sync—metaphorical Chris Farley falls and all.</p>\n\n<p>In particular, he nails a massive friction point for me with the iPad:</p>\n\n<blockquote>\n  <p>I can type more comfortably on my iPhone than I can with my iPad Pro on the couch, in bed, or even just reclined in the backyard. I’m sure there’s a good case out there that will solve this problem, but I’d rather see Apple solve it.</p>\n</blockquote>\n\n<p>I’ve tried using various keyboards for my 13” iPad Pro, but I’ve never found one that let me comfortably type while sitting away from a flat table or desk. This has been a huge failure point from a practical perspective for me because the iPad, by design, begs to be used away from conventional “work stations.” So the irony is that the only tim","link":"http://www.practicallyefficient.com/2017/06/24/look-but-dont-type.html","owner":"Drew DeVault"},{"title":"Machine learning applied to showers in the OPERA","description":"<p>\n\t<i>\n\tAbstract: in this post I explain how Machine Learning tools can be applied to particle physics. \n\tI'll discuss what is a particle shower, and when it appears in the OPERA and how clustering and classification \n\ttechniques can help fundamental research.\n\t</i>\n</p>\n<img src='/images/opera/post/opera-step1.png' style='margin: 20px 0px;'/>\n<p>\n\tThis post is based on the research I've done for the OPERA experiment.\n</p>\n<h2>\n\tWhat are particle showers?\n</h2>\n<p>\n\t\t<img src=\"/images/opera/post/cosmic-rays.jpg\" alt=\"\"><br />\n\t\t<small>\n\t\t\t\tIllustration from <a href=\"http://www.ep.ph.bham.ac.uk/DiscoveringParticles/detection/cosmic-rays/\">University of Birmingham</a>\n\t\t\t</small>\n</p>\n<p>\n\tWhen a charged particle (I'll consider an electron as an example) with extremely high energy passes through an atmosphere\n\tor material, it collides with atoms and produces new particles (converting its energy into mass of new particles). These\n\tnewly-born particles also have high energy and also prod","link":"https://arogozhnikov.github.io/2017/06/24/opera.html","owner":"Alan Storm"}]