[{"title":"Advanced Swift Workshop in New York City\n","description":"I will be holding another one-day workshop on advanced Swift programming in New York City on May 4th. This will be much the same as my previous one in Washington in December, in a new location and with various tweaks and improvements. If you enjoy my articles and want to sharpen your Swift skills, <a href=\"https://www.eventbrite.com/e/advanced-swift-with-mike-ash-full-day-workshop-tickets-29051962201\">check it out</a>.<br><a href=\"http://www.mikeash.com/pyblog/advanced-swift-workshop-in-new-york-city.html\">(Read More)</a>","link":"http://www.mikeash.com/pyblog/advanced-swift-workshop-in-new-york-city.html","owner":"Mike Ash"},{"title":"Announcing the First CockroachDB User Groups in NYC and SF","description":"Calling all database and infrastructure experts: get ready to nerd out with the best CockroachDB devs in your city! A year after our Beta release and a shortly before CockroachDB 1.0 becomes available for download, we are excited to announce the newly minted CockroachDB User Groups. We are kicking off our user groups April 4th and 5th, with inaugural events in New York City and San Francisco respectively.\nSpencer Kimball, Co-Founder and CEO at Cockroach Labs, will discuss the inspiration and technology behind CockroachDB.","link":"https://www.cockroachlabs.com/blog/announcing-the-first-cockroachdb-user-groups-in-nyc-and-sf/","owner":"CockroachDB"},{"title":"Handling Data Breaches, Or: The Art of Fixing and Saying “Sorry”","description":null,"link":"https://fullstack.info/handling-data-breaches-fixing-and-saying-sorry/","owner":"Ofer Zelig"},{"title":"Jumping between languages","description":"","link":"https://crowdfire.engineering/jumping-between-languages-d1463fe03b85?source=rss----212c5945ed6c---4","owner":"Crowdfire"},{"title":"Parse CSV Data Using The Go Programming Language","description":"\n                    <p>Ever found yourself working with comma separated value (CSV) data from a file or other source?  This format is easy to generate if you’re working with spreadsheet applications like Google Sheets or Microsoft Excel, and RDBMS applications. So how do we load this data and work with it in an application?  More specifically an application built with the Go programming language?</p>\n<p>We’re going to see how to take a CSV file and load it into a custom data structure to eventually be printed as JSON within the application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/03/parse-csv-data-go-programming-language/'>Parse CSV Data Using The Go Programming Language</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2017/03/parse-csv-data-go-programming-language/","owner":"Nic Raboy"},{"title":"Swift: Alternative to Default Implementations in Protocols","description":"I recently wrote about why I prefer not to use default implementations in Swift protocols. Here is how you can still optimize using a default implementation without the unintended side-effects...","link":"https://www.natashatherobot.com/swift-alternative-to-default-implementations-in-protocols/","owner":"Natasha Murashev"}]