[{"title":"Avoid Vendor Lock-in Risk with Multi-cloud Deployments","description":"As businesses outsource their infrastructure to public cloud providers they are in turn taking on major risks. In a recent piece by Financial News (gated), senior executives at Goldman Sachs and Standard Chartered warned that an overreliance on a small band of cloud service providers could result in a major hack or outage wreaking havoc on the global banking system.\nLock-in is a global issue: Bain&#x2019;s Cloud Computing Survey noted that the share of respondents citing vendor lock-in as a &#x201C;top three concern&#x201D; grew from 7% to 23% from 2012 to 2015.","link":"https://www.cockroachlabs.com/blog/gs-response/","owner":"Cloudflare"},{"title":"Investing in CS4All: One Year Later","description":"When a couple of New York City high school teachers partnered with MongoDB \r\nto teach computer science, did they succeed? Their curriculum was untested, \r\nand they were teaching in difficult districts where most students are from \r\npoor and minority families. I talked with these two teachers, Jeremy \r\nMellema and Timothy Chen, back in September, when they had completed a \r\nsummer fellowship at MongoDB and had just started teaching their \r\ncurriculum; at the end of the academic year this spring, I visited Jeremy \r\nand Tim again to find out the result.\r\n\r\nTheir successes were sparse and partial. They discovered that their \r\nstudents' poor reading skills were a barrier to learning to code, and that \r\nteaching new coders how to solve problems is, itself, an unsolved problem. \r\nWith a coarse unit of iteration—a school semester—it is painfully slow to \r\nexperiment and find teaching methods that work. But even partial wins make \r\na difference for individual kids, and the support of profession","link":"https://engineering.mongodb.com/post/investing-in-cs4all-one-year-later","owner":"Mixpanel"},{"title":"Property-Based Testing Is Fuzzing","description":"&ldquo;Property-based testing&rdquo; refers to the idea of writing statements that should be true of your code (&ldquo;properties&rdquo;), and then using automated tooling to generate test inputs (typically, randomly-generated inputs of an appropriate type), and observe whether the properties hold for that input. If an input violates a property, you&rsquo;ve demonstrated a bug, as well as a convenient example that demonstrates it.\nA classic example of property-based testing is testing a sort function:","link":"https://blog.nelhage.com/post/property-testing-is-fuzzing/","owner":"Natasha Murashev"},{"title":"Send on behalf of your teammates","description":"<p>Do you wish you could create and send campaigns on behalf of someone else? Today, delegated sending in sequences lets you reach clients, prospects or candidates on behalf of other teammates.</p><p class=\"poet-read-more\"><a href=\"/blog/delegated-sending\" title=\"Read more of Send on behalf of your teammates\">Continue reading</a></p>","link":"https://mixmax.com/blog/delegated-sending","owner":"Microsoft Python Engineering"},{"title":"The First Wingify DevFest","description":"\"What is the most resilient parasite? Bacteria? A virus? An intestinal worm? An idea. Resilient... highly contagious. Once an idea has taken…","link":"https://engineering.wingify.com//posts/the-first-wingify-devfest/","owner":"Wimdu"},{"title":"Working Remotely","description":"","link":"http://engineering.khanacademy.org/posts/working-remotely.htm","owner":"Just Eat"}]