[{"title":"Detecting Trustworthy Domains","description":"<p>High quality, truthful, diverse and informative content is Flipboard’s #1 priority. Hand-picking trusted sources guarantees quality, but is very time consuming, and can potentially miss out on the multitude of excellent but smaller publishers. To address this problem, we’ve developed a machine learning (ML) system called the <em>Domain Ranker</em>. Its goal is to automatically distinguish authoritative domains from plagiarists, spammers and other low quality sources. It learns to predict how our editorial team would label a domain by analyzing the content and the signals generated by our users. The <em>Domain Ranker</em> scales our editorial thinking to a much larger amount of content than we could handle manually, ensuring high quality across all topics.<!--break--></p>\n\n<h2 id=\"overview\">Overview</h2>\n\n<p>Flipboard has indexed hundreds of millions of articles in the last year alone. In addition to the constant stream of articles from our trusted partners, any user can add any web ","link":"http://engineering.flipboard.com//2017/04/domainranking","owner":"Flipboard"},{"title":"Tour Of Heroes As A NativeScript With Angular Android And iOS Application","description":"\n                    <p>When it comes to learning Angular, the go-to example is the <a href=\"https://angular.io/docs/ts/latest/tutorial/\">Tour of Heroes</a> tutorial that is found in the official Angular documentation. This is a great tutorial because it covers a lot of topics, however, it is a web application tutorial. What if we wanted to build a mobile application from it, or more specifically, a native mobile application with Android and iOS support?</p>\n<p>We’re going to see how to build a Tour of Heroes inspired iOS and Android mobile application using <a href=\"https://angular.io/\">Angular</a> and <a href=\"https://www.nativescript.org/\">NativeScript</a>.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/04/tour-heroes-nativescript-angular-android-ios-application/'>Tour Of Heroes As A NativeScript With Angular Android And iOS Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglo","link":"https://www.thepolyglotdeveloper.com/2017/04/tour-heroes-nativescript-angular-android-ios-application/","owner":"Nic Raboy"}]