[{"title":"\nRedis on the Raspberry Pi: adventures in unaligned lands\n","description":"After 10 million of units sold, and practically an endless set of different applications and auxiliary devices, like sensors and displays, I think it’s deserved to say that the Raspberry Pi is not just a success, it also became one of the preferred platforms for programmers to experiment in the embedded space. Probably with things like the Pi zero, it is also becoming the platform in order to create hardware products, without incurring all the risks and costs of designing, building, and writing software for vertical devices.\n","link":"\nhttp://antirez.com/news/111\n","owner":"Antirez"},{"title":"Building Our Robot Future","description":"How Condé Nast is getting its feet wet with the next wave in user experience: conversational interfaces and the chatbot.","link":"https://technology.condenast.com/story/building-our-robot-future","owner":"Condé Nast"},{"title":"Package Oriented Design","description":"Updated on February 28th, 2017\nPrelude This post is part of a series of posts designed to make you think about your own design philosophy on different topics. If you haven’t read these posts yet, please do so first:\nDevelop Your Design Philosophy\nDesign Philosophy On Packaging\nIntroduction Package Oriented Design allows a developer to identify where a package belongs inside a Go project and the design guidelines the package must respect.","link":"https://www.ardanlabs.com/blog/2017/02/package-oriented-design.html","owner":"William Kennedy"},{"title":"Progressive Web Applications with Angular, Spring Boot, and Stormpath","description":null,"link":"https://stormpath.com/blog/progressive-web-applications-angular-spring-boot-stormpath","owner":"Stormpath"},{"title":"Use Social Media Sharing Prompts In A NativeScript Angular Application","description":"\n                    <p>Social media can be huge towards building your brand and promoting your mobile application. It can also make a difference in the user experience of your application. Allowing users to share text and media on their own social media profiles could be huge, no matter how you look at it. A while back I had demonstrated <a href=\"https://www.thepolyglotdeveloper.com/2016/03/implement-social-media-sharing-nativescript-app/\">social media sharing in a vanilla NativeScript application</a> for iOS and Android. While vanilla NativeScript is still a very valid option, I’ve been going the route of Angular lately, so I figured this topic could be revisited.</p>\n<p>We’re going to see how to implement social media sharing features in a <a href=\"https://www.nativescript.org/\">NativeScript</a> mobile application build with Angular.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/02/social-media-sharing-","link":"https://www.thepolyglotdeveloper.com/2017/02/social-media-sharing-prompts-nativescript-angular-application/","owner":"Nic Raboy"}]