[{"title":"A brief trip through Spacetime","description":"<p>Spacetime is a new memory profiling facility for OCaml to help find space leaks\nand unwanted allocations. Whilst still a little rough around the edges, we’ve\nfound it to be a very useful tool. Since there’s not much documentation for\nusing spacetime beyond <a href=\"https://github.com/lpw25/prof_spacetime/blob/master/Readme.md\">this\nreadme</a>, I’ve\nwritten a little intro to give people an idea of how to use it.</p>\n\n","link":"https://blog.janestreet.com/a-brief-trip-through-spacetime/","owner":"InVision"},{"title":"Communicate With Websockets In A NativeScript Angular Application","description":"\n                    <p>I’ve been playing around with sockets and websockets recently. Not too long ago I wrote about <a href=\"https://www.thepolyglotdeveloper.com/2016/12/create-real-time-chat-app-golang-angular-2-websockets/\">creating a real-time chat application using Golang and Angular</a> that made use of websockets. In that example we created a chat server using the Go programming language and a client facing web application using Angular. The communication between the two used websockets to keep things real-time.</p>\n<p>What if we wanted to create a native mobile application for Android and iOS that communicated via websockets to our server or any other websocket server?  Using <a href=\"https://www.nativescript.org/\">NativeScript</a>, it is very possible to create a mobile client that works with the Golang with Angular example as seen previously.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/01/comm","link":"https://www.thepolyglotdeveloper.com/2017/01/communicate-with-websockets-in-a-nativescript-angular-application/","owner":"Nelson Elhage"},{"title":"Measuring Capacity Through Utilization","description":"(This post is cross-posted from Honeycomb&rsquo;s instrumentation series).\nOne of my favorite concepts when thinking about instrumenting a system to understand its overall performance and capacity is what I call &ldquo;time utilization&rdquo;.\nBy this I mean: If you look at the behavior of a thread over some window of time, what fraction of its time is spent in each &ldquo;kind&rdquo; of work that it does?\nLet&rsquo;s make this notion concrete by examining a toy example.","link":"https://blog.nelhage.com/post/utilization/","owner":"Natasha Murashev"}]