[{"title":"#BBG @ GIPHY","description":"GIPHY hosted a some of the girls who are involved in the #builtbygirls after school program to come to the office and learn more about GIPHY. The girls also participated in a small focus group with our mobile team. Our Director of Mobile Products did an overview of the GIPHY Mobile App and then had girls participate in a brainstorm session and develop fun features that they think added value to the app - it was a great time!","link":"https://engineering.giphy.com/bbg-giphy-hq/","owner":"Gilt"},{"title":"A Dive Into Stack Overflow Jobs Search","description":null,"link":"https://stackoverflow.blog/2017/05/24/dive-stack-overflow-jobs-search/","owner":"Squarespace"},{"title":"Add Two-Factor Authentication To A Golang RESTful API","description":"\n                    <p>When it comes to authenticating users for making use of your API, it is a good idea to add an extra step beyond standard username and password. This is called two-factor authentication (2FA) and it acts as a second layer of security for users making use of your application.</p>\n<p>Not too long ago I had written about <a href=\"https://www.thepolyglotdeveloper.com/2017/05/implement-2fa-time-based-one-time-passwords-node-js-api/\">adding 2FA to a RESTful API created with Node.js and Express Framework</a>, but what if we wanted to do it in Golang? The logic isn’t any different, just a new syntax for a new language.</p>\n<p>We’re going to see how to add two-factor authentication to a Golang API that makes use of Json Web Tokens (JWT).</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/05/add-two-factor-authentication-golang-restful-api/'>Add Two-Factor Authentication To A Golang RESTful API</a>","link":"https://www.thepolyglotdeveloper.com/2017/05/add-two-factor-authentication-golang-restful-api/","owner":"Nelson Elhage"},{"title":"Out In Tech Spring Social","description":"Out in Tech unites the LGBTQ+ tech community, they empower aspiring tech leaders to improve our world by showcasing accomplished speakers, producing timely and thought-provoking events, and connecting their members to new opportunities and each other. They provide resources and mentorship to ensure career access for the next generation of LGBTQ youth.","link":"https://engineering.giphy.com/out-in-tech-spring-social/","owner":"Gilt"}]