[{"title":"Kindred Futures and Cockroach Labs Partner to Build Next Generation Global Online Gaming Platform","description":"We are excited to announce a partnership with Kindred Futures to build the next generation global online gaming platform for their parent company Kindred Group plc. Kindred is a rapidly growing, global business with strict data privacy and technical requirements. Their ambitious project to build a global online gaming platform with multiple active data centers that span continents is an exciting opportunity for our team. Furthermore, the close collaboration between our engineering teams is helping to shape the development of CockroachDB, starting with a design partnership for a geo-partitioning feature planned for the 1.","link":"https://www.cockroachlabs.com/blog/cockroachdb-kindred-partnership/","owner":"Cloudflare"},{"title":"Leveraging frameworks to speed up our development on iOS - Part 1","description":"Growth in code bases come with exciting scalability challenges. As the size of our iOS codebase and team at SoundCloud grew, we faced challenges: long compile times and conflicts. Our productivity started to suffer as a result. We took inspiration from the work done in the backend (Building Products at SoundCloud) and applied it to mobile development. The main goal was to get back to a state where development is fun, fast, and would scale as the number of contributors grew. We modularized our iOS project by splitting it up into modules with well-defined responsibilities and public interfaces that interconnect them.","link":"https://developers.soundcloud.com/blog/leveraging-frameworks-to-speed-up-our-development-on-ios-part-1","owner":"Soshace"},{"title":"Poor's man domain events","description":"\nWhile investigating @EventListeners in spring I&#8217;ve noticed very interesting annotation - @DomainEvents. In this post I&#8217;m going to check what can be achieved using @DomainEvents annotation and how to effectively use it with old good JPA.\nLet&#8217;s start with short introduction to domain event idea if you are not yet familiar with it. Now let&#8217;s go back to the @DomainEvents annotation in spring-data. Spring-data by default provides support for this annotation and it&#8217;s complementary annotation @AfterDomainEventPublication.\n<p><a href=\"https://blog.pchudzik.com/201710/domain-events/\">Read more</a></p>","link":"https://blog.pchudzik.com/201710/domain-events/","owner":"Paul Lewis"},{"title":"The best time to send sequences","description":"<p>If you send email campaigns, you often wonder when the best time is to send. Today, we’re excited to announce that Mixmax can automatically send sequence messages at the optimal time for each specific recipient. No more guessing!</p><p class=\"poet-read-more\"><a href=\"/blog/the-best-time-to-send-sequences\" title=\"Read more of The best time to send sequences\">Continue reading</a></p>","link":"https://mixmax.com/blog/the-best-time-to-send-sequences","owner":"Microsoft Python Engineering"},{"title":"These Weeks in Remacs III","description":"<p>Time for another Remacs update: lots of contributions, a wide range of\nfeatures, and even a logo!</p>\n\n<h2 id=\"contributing\">Contributing</h2>\n\n<p>Since the <a href=\"/blog/2017/07/15/these-weeks-in-remacs-ii/\">last update</a>,\nwe’ve seen contributions from lots of new people. We’ve added\n@brotzeit and @shanavas786, bringing us to seven wonderful people who\ncan approve your PRs.</p>\n\n<p>Speaking of PRs, we’ve merged an amazing 64 pull requests since the\nlast update!</p>\n\n<p>If you’re looking for a good feature for your first contribution,\n@brotzeit has been regularly adding\n<a href=\"https://github.com/Wilfred/remacs/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22\">new suggestions under the ‘good first issue’ label</a>.</p>\n\n<h2 id=\"features\">Features</h2>\n\n<p>Many Emacs features have now been ported to Rust, with new Rust APIs\nfor accessing elisp datastructures.</p>\n\n<p>Here’s an overview of the features that have landed.</p>\n\n<p><strong>Arithmetic</strong>:\n<a href=\"htt","link":"http://www.wilfred.me.uk/blog/2017/10/16/these-weeks-in-remacs-iii/","owner":"Vlad Mihalcea"}]