[{"title":"\nDoing the FizzleFade effect using a Feistel network\n","description":"Today I read an interesting article about how the Wolfenstein 3D game implemented a fade effect using a Linear Feedback Shift Register. Every pixel of the screen is set red in a pseudo random way, till all the screen turns red (or other colors depending on the event happening in the game). The blog post describing the implementation is here and is a nice read: http://fabiensanglard.net/fizzlefade/index.php\n","link":"\nhttp://antirez.com/news/113\n","owner":"Andrey Akinshin"},{"title":"Code reviews","description":"\n<div class=\"paragraph\">\n<p>Code review is a great process which gradually improves code quality. It is a system you can\nimplement in many ways. In this post I&#8217;m going to grumble about one particular way of performing\ncode reviews - when there is only one person responsible for doing code reviews and\nsuggesting/accepting/rejecting changes.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201708/on-code-reviews/\">Read more</a></p>","link":"https://blog.pchudzik.com/201708/on-code-reviews/","owner":"Paul Lewis"},{"title":"Effective team culture: Five Whys & Stop-the-line","description":"kg-card-begin: markdown","link":"https://eaf4.com/five-whys/","owner":"Edgar Aroutiounian"},{"title":"Farewell, Solaris","description":"[Update 8/29/17 3:45pm: edited to contain more specifics regarding Solaris \r\ndownloads and security patches.]\r\n\r\nSolaris was the first “real operating system” I ever used.\r\n\r\nThe Brown University Computer Science Department was a Sun Microsystems \r\nshop when I was an undergraduate there in the late 90s. When I took the \r\noperating systems lab class, CS-169, we implemented a toy version of Sun’s \r\nresearch operating system Spring OS. Several of my contemporaries in the CS \r\nDepartment went on to work at Sun, and developed or advanced many of the \r\ntechnologies that made Solaris great, like ZFS, dtrace, libumem, mdb, \r\ndoors, and zones. The Solaris Linkers and Libraries Guide remains one of \r\nthe best ways to develop an understanding of shared library internals. The \r\nfirst startup I worked for developed on Solaris x86, because the team knew \r\nSolaris well. Today, many of my co-workers on the server engineering team \r\nhere at MongoDB share that formative experience with Solaris. We have ","link":"https://engineering.mongodb.com/post/farewell-solaris","owner":"Mixpanel"},{"title":"The Why and How of Google AMP at Condé Nast","description":"Google AMP aims to provide a better experience for the mobile web. Let’s explore the motivations, technology, and outcomes of the AMP implementation at Condé Nast.","link":"https://technology.condenast.com/story/the-why-and-how-of-google-amp-at-conde-nast","owner":"Commercetools"}]