[{"title":"Announcing the Initial Release of rktlet, the rkt CRI Implementation","description":"We are happy to announce the initial release of rktlet , the rkt implementation of the Kubernetes Container Runtime Interface . This is a preview release, and is not meant for production workloads.\nWhen using rktlet, all container workloads are run with the rkt container runtime.\nAbout rkt The rkt container runtime is unique amongst container runtimes in that, once rkt is finished setting up the pod and starting the application, no rkt code is left running.","link":"/blog/2017/11/announcing-the-initial-release-of-rktlet-the-rkt-cri-implementation/","owner":"Kinvolk"},{"title":"Kotlin first impressions","description":"\n<div class=\"paragraph\">\n<p>Recently while starting work on a project we&#8217;ve (team of two ;)) decided to try something new and\nuse Kotlin. The project is far from ready and still under active development, but after writing some\ncode in Kotlin I&#8217;ve got few observations I&#8217;d like to share.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201711/kotlin-first-impressions/\">Read more</a></p>","link":"https://blog.pchudzik.com/201711/kotlin-first-impressions/","owner":"Paweł Chudzik"},{"title":"Navigate Nested Child Routes In A Vue.js Web Application","description":"\n                    <p>Not too long ago I had written a few tutorials around navigation in a Vue.js web application. I had written about <a href=\"https://www.thepolyglotdeveloper.com/2017/11/router-navigate-pages-vuejs-application/\">navigating between routes</a> as well as <a href=\"https://www.thepolyglotdeveloper.com/2017/11/pass-data-between-routes-vuejs-web-application/\">passing data between routes in the form of route parameters and query parameters</a>.</p>\n<p>When developing a web application with a successful user interface, you&rsquo;re going to want to recycle as many features as possible. Using Vue.js, it is possible to create a multiple level UI by assigning child routes to a parent route within the application. This opens the door to new possibilities in navigation.</p>\n<p>We&rsquo;re going to see how to use nested routes in a <a href=\"https://vuejs.org\">Vue.js</a> web application by assigning child routes and views.</p>\n                    \n                        <p>The ","link":"https://www.thepolyglotdeveloper.com/2017/11/navigate-nested-child-routes-vuejs-web-application/","owner":"Nic Raboy"}]