[{"title":"One-off shell script execution in BBEdit","description":"<p>I’ve been meaning to talk more about my “Sublime Text <em>and</em> BBEdit” workflow, and this is a powerful (if mundane) example.</p>\n\n<p>I don’t write a ton of scripts on my Mac and generally don’t spend much time in Terminal. But when I need a script, <em>I really need a script</em>. My work is very file-heavy. I juggle large numbers of <code class=\"highlighter-rouge\">.tex</code> (LaTeX) files across several large folder structures. Every so often I need to copy a subset of files within one folder to another folder so that I can do things to them.</p>\n\n<p>In most cases, I have a list of the files in a plain text <code class=\"highlighter-rouge\">.tex</code> file, and I just need to do some file operations on them. Selecting them individually in Finder is tedious and error-prone, so the solution is usually a simple bash script with a bunch of <code class=\"highlighter-rouge\">cp</code> commands.</p>\n\n<p>The main friction with bash scripting for folks like me that don’t live in Terminal","link":"http://www.practicallyefficient.com/2017/06/14/shell-scripts-in-bbedit.html","owner":"Drew DeVault"},{"title":"TPDP Episode #14: Object Storage for Application Developers","description":"\n                    <p>I am pleased to announce that the latest episode of The Polyglot Developer Podcast is now available to download from all the popular podcasting networks. In this episode titled, <strong>Object Storage for Application Developers</strong>, I’m joined by <a href=\"https://twitter.com/krishnatweets\">Krishna Srinivas</a> from <a href=\"https://minio.io/\">Minio</a> to talk about what object storage is and the various solutions that are available.</p>\n<p>Episode #14 can be downloaded for free from <a href=\"https://itunes.apple.com/us/podcast/polyglot-developer-podcast/id1070975158\">iTunes</a>, <a href=\"http://pca.st/qXBc\">Pocket Casts</a>, and every other popular network, but it can also be heard below.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/06/tpdp-episode-14-object-storage-application-developers/'>TPDP Episode #14: Object Storage for Application Developers</a> appeared first on <a r","link":"https://www.thepolyglotdeveloper.com/2017/06/tpdp-episode-14-object-storage-application-developers/","owner":"Nelson Elhage"}]