[{"title":"Calendar Tetris is an antipattern","description":"<p>It's time that we took back our work day from our calendars and Calendar Tetris is the first thing that has got to go. Calendars are a tool and like every tool they should be used appropriately.</p>\n\n<h2 id=\"whatiscalendartetris\">What is \"Calendar Tetris\"?</h2>\n\n<p>Does your calendar look like a Jackson Pollack painting?</p>","link":"https://jack.ofspades.com/calendar-tetris-is-an-antipattern/","owner":"Ivan Ursul"},{"title":"Handle Google Play Services Conflicts In NativeScript Mobile Applications","description":"\n                    <p>I’ve been developing with NativeScript for a few years now, but only recently have I started working with the various services offered by Google Play. Using a single Google Play service such as Google Analytics works great, but as soon as you start adding more, you’ll start noticing Android conflicts during the build process.</p>\n<p>Different plugins have different requirements on the underlying library versions. For example, one plugin might expect version 9, while another version 10, creating a versioning conflict.</p>\n<p>We’re going to see how to get around these common problems that expand beyond <a href=\"https://www.nativescript.org/\">NativeScript</a> and into other development frameworks such as Apache Cordova and Ionic Framework.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2017/06/handle-google-play-services-conflicts-in-nativescript-mobile-applications/'>Handle Google Play Serv","link":"https://www.thepolyglotdeveloper.com/2017/06/handle-google-play-services-conflicts-in-nativescript-mobile-applications/","owner":"Nelson Elhage"},{"title":"Hudson's Bay Company at QCon","description":"\n","link":"http://tech.gilt.com/conferences/2017/06/12/hbc-at-qcon","owner":"Geoblink"},{"title":"Is Yarn still a thing?","description":"","link":"https://medium.com/wemake-services/is-yarn-still-a-thing-3c6886410c83?source=rss----3ac85505f67d---4","owner":"WebEngage"},{"title":"Two Perspectives on the End-to-End Principle","description":"Back when I was an undergraduate, as part of a class called &ldquo;Computer Systems Engineering&rdquo;, we read numerous classic papers of systems design. I enjoyed and learned a great deal from many of these papers, but one that paper that has stuck with me in particular was Saltzer et al&rsquo;s &ldquo;End-to-End Arguments in Systems Design&rdquo;. The paper is a very general tract on systems design &ndash; it does explore several examples of concrete systems or applications, but it ultimately expounds upon the end-to-end principle as a perspective or design heuristic that can apply to virtually any system design.","link":"https://blog.nelhage.com/post/end-to-end-principle/","owner":"Natasha Murashev"}]