[{"title":"But I already paid for it?!?!","description":"<p>Subscription-based app pricing is a thorny issue that’s far from resolved, but one of the <em>very worst</em> arguments I hear whenever a company like Ulysses switches to a subscription model goes something like this:</p>\n\n<p><em>“Why do I have to pay (again) for software I’ve already purchased?”</em></p>\n\n<p>This is a flat out lie that people usually create for themselves to help support their negative reaction to a perceived price increase. The lie basically says, “if I want to keep using this app, I need to pay for it again.” In many cases, including the case with Ulysses, this is completely false. Ulysses <a href=\"https://ulyssesapp.com/blog/\">clearly addresses</a> this on their site:</p>\n\n<blockquote>\n  <p>The previous, single-purchase versions of Ulysses have both been removed from sale. They remain fully functional, of course, and we have even updated both versions for High Sierra and iOS 11 respectively. So, if you decide to keep using the “old” Ulysses, you should not encou","link":"http://www.practicallyefficient.com/2017/08/15/but-i-already-paid.html","owner":"Drew DeVault"},{"title":"Developer Interview: Vlad Kliatchko, Global Head of Engineering at Bloomberg","description":null,"link":"https://stackoverflow.blog/2017/08/15/developer-interview-vlad-kliatchko-global-head-of-engineering-at-bloomberg/","owner":"Squarespace"},{"title":"Inheritance gone wrong","description":"\n<div class=\"paragraph\">\n<p>We all know how inheritance works and implemented some kind of class hierarchy at least few times\nduring our career. Some of us know already that inheritance is not the silver bullet. Some of us\nknow that inheritance must not be overused and considered with caution. Now I&#8217;m going to show you\nhow choosing the quick win might cost you some unexpected troubles in the future.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201708/inheritance-gone-wrong/\">Read more</a></p>","link":"https://blog.pchudzik.com/201708/inheritance-gone-wrong/","owner":"Paul Lewis"},{"title":"Why We’re Betting on GraphQL","description":"","link":"https://engineering.universe.com/why-were-betting-on-graphql-233ddf1a0779?source=rss----a1cd8e0d60b2---4","owner":"Uber"},{"title":"Your team’s performance at-a-glance","description":"<p>Starting today, you can share team reports in Mixmax. With shared reports, you can get detailed insights for all your teams. It’s a quick and powerful way to track the performance of your teams at a glance.</p> <p class=\"poet-read-more\"><a href=\"/blog/team-performance\" title=\"Read more of Your team’s performance at-a-glance\">Continue reading</a></p>","link":"https://mixmax.com/blog/team-performance","owner":"Microsoft Python Engineering"}]