[{"title":"Building Infrastructure in Parallel","description":"<p>In the early days of <a href=\"https://github.com/remind101/stacker\">stacker</a> at Remind, the number of stacks that we were managing was just a handful. CloudFormation stacks were updated sequentially, without any parallelism, and everyone was happy.</p>\n\n<p>Today, stacker manages 153 CloudFormation stacks that build out all of the AWS infrastructure that makes <a href=\"https://remind.com/\">remind.com</a> work. As you can imagine, attempting to update 153 stacks without any parallelism takes a long time, about 10 minutes to be precise. When you consider that most stacks don’t ever change, 10 minutes feels like an eternity, and prevents a quick feedback loop.</p>\n\n<p>Over the last couple of weeks, I took it upon myself to refactor the core issues in stacker that made implementing parallelism difficult, and dropped our total execution time from 10 minutes, to under 1.5 minutes. This work is now included in <a href=\"https://github.com/remind101/stacker/releases/tag/1.2.0\">stacker 1.2<","link":"http://engineering.remind.com/building-infrastructure-in-parallel/","owner":"Red Hat"},{"title":"Client Side Git Hooks - Part 2","description":"Improving your version control workflow","link":"/2018/03/05/using-client-side-git-hooks-2/","owner":"MongoDB"},{"title":"Connect To A Raspberry Pi Zero With A PiUART Module","description":"\n                    <p>As you&rsquo;re probably well aware from my <a href=\"https://www.thepolyglotdeveloper.com/tags/raspberry-pi/\">previous Raspberry Pi articles</a>, I&rsquo;m a hoarder. I have several Raspberry Pi Zero as well as the wireless edition and various attachments that go with them.</p>\n<p>When I was first getting started with the original <a href=\"https://www.amazon.com/gp/product/B01L3IU6XS/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B01L3IU6XS&amp;linkCode=as2&amp;tag=nraboy-20&amp;linkId=f298036c6fa0773dda84450a5e301825\">Pi Zero</a>, I had a tough time trying to figure out how to connect to it. I mean, how do you connect to something that doesn&rsquo;t have some kind of internet connect?</p>\n<p>I had written two articles previously for connecting to a Raspberry Pi Zero. The first titled, <a href=\"https://www.thepolyglotdeveloper.com/2016/06/connect-raspberry-pi-zero-usb-cable-ssh/\">Connect to a Raspberry Pi Zero with a USB Cable and SSH</a>,","link":"https://www.thepolyglotdeveloper.com/2018/03/connect-raspberry-pi-zero-piuart-module/","owner":"Nelson Elhage"},{"title":"Invest in yourself. Be searchable!","description":"Being really good in your field is important, but more important than that is to seem to be good. Invest in yourself. Be searchable! How many times did you search your name on Google? How many times did you search some keywords related to you? Did you like the results you got? Can them be … ","link":"https://blog.jgrossi.com/2018/invest-in-yourself-be-searchable/?utm_source=rss&utm_medium=rss&utm_campaign=invest-in-yourself-be-searchable","owner":"Julia Evans"}]