[{"title":"Analyzing distribution of Mono GC collections","description":"<p>Sometimes I want to understand the GC performance impact on an application quickly.\nI know that there are many powerful diagnostic tools and approaches,\nbut I&rsquo;m a fan of the &ldquo;right tool for the job&rdquo; idea.\nIn simple cases, I prefer simple noninvasive approaches which provide a quick way\nto get an overview of the current situation\n(if everything is terrible, I always can switch to an advanced approach).\nToday I want to share with you my favorite way to quickly get statistics\nof GC pauses in Mono and generate nice plots like this:</p>\n<div class=\"row\">\n<div class=\"mx-auto\">\n<a href=\"https://aakinshin.net/posts/mono-gc-collects/img/plot-64.png\" target=\"_blank\" alt=\"plot-64\">\n<img\nclass=\"mx-auto d-block img-fluid\"\nwidth='800'\nsrc=\"https://aakinshin.net/posts/mono-gc-collects/img/plot-64.png\" />\n</a>\n</div>\n</div>\n<br />","link":"https://aakinshin.net/posts/mono-gc-collects/","owner":"Andrew Ray"},{"title":"Embracing Radical DevOps","description":"<h2 id=\"embracing-radical-devops\">Embracing Radical DevOps</h2>\n<p>Over the past twelve years, RightScale has continually worked to embrace modern development\npractices including agile, continuous delivery and DevOps. When we implemented each of these\npractices, we did so with the goal of delivering features to customers more quickly and more\nreliably. Recently we’ve taken a significant new step that has transformed the way RightScale is\ndelivering software. We reorganized our engineering organization into fully self-contained teams\nthat are empowered to make all the decisions needed to build software, from working with customers\nto define the features to be delivered all the way to running and supporting services in production.\nThis change has brought many significant benefits — some expected and some not. We’ll share our path\nto success and the challenges we had to overcome along the way.</p>\n\n<p>In October 2017, we needed to tackle a strategic project with an aggressive deadline. We","link":"http://eng.rightscale.com/2018/02/20/radical-devops.html","owner":"RetailMeNot"},{"title":"Focus On Being Precise","description":"Introduction I was guided for many years to write functions that are generalized and to create layers upon layers of abstraction so things don’t break as business requirements change. That the cost of breaking a function signature, for example, is expensive and something that should be avoided. Therefore, write functions that take more generic parameters or hide things in a receiver or context to be less prone to breakage.","link":"https://www.ardanlabs.com/blog/2018/02/focus-on-being-precise.html","owner":"Wilfred Hughes"},{"title":"Timing issues when using BPF with virtual CPUs","description":"Introduction After implementing the collecting of TCP connections using eBPF in Weave Scope (see our post on the Weaveworks blog) we faced an interesting bug that happened only in virtualized environments like AWS, but not on bare metal. The events retrieved via eBPF seemed to be received in the wrong chronological order. We are going to use this bug as an opportunity to discuss some interesting aspects of BPF and virtual CPUs (vCPUs).","link":"/blog/2018/02/timing-issues-when-using-bpf-with-virtual-cpus/","owner":"King"},{"title":"TPDP Episode #17: Going FaaS On Serverless With OpenWhisk","description":"\n                    <p>I am pleased to announce that the latest episode of The Polyglot Developer Podcast is now available for download. The episode titled, <strong>Going FaaS on Serverless with OpenWhisk</strong> focuses on the development and deployment of functions to be deployed on a serverless cloud platform.</p>\n<p>In this episode I&rsquo;m joined by <a href=\"https://twitter.com/csantanapr\">Carlos Santana</a> who is part of the Cloud Functions team at IBM. While Apache OpenWhisk will have an emphasis in this episode, other cloud services are mentioned as well, including AWS Lambda and Azure Functions.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/02/tpdp-episode-17-faas-serverless-openwhisk/'>TPDP Episode #17: Going FaaS On Serverless With OpenWhisk</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n               ","link":"https://www.thepolyglotdeveloper.com/2018/02/tpdp-episode-17-faas-serverless-openwhisk/","owner":"Nelson Elhage"}]