[{"title":"Debug a slow Wordpress site","description":null,"link":"http://thelazylog.com/debug-a-slow-wordpress-site/","owner":"Chen Hui Jing"},{"title":"Giphy Android App and Fresco","description":"GIPHY’s Android team recently released our third major version of the GIPHY app. In the latest release, we focused on delivering new features, redesigning the home page to support GIPHY Stories, and improving our app’s performance. We also delivered an entirely  new set of GIF creation tools! Behind these front-facing features for our users, we […]","link":"https://engineering.giphy.com/giphy-android-app-and-fresco/","owner":"Gilt"},{"title":"Scheduling In Go : Part II - Go Scheduler","description":"Prelude This is the second post in a three part series that will provide an understanding of the mechanics and semantics behind the scheduler in Go. This post focuses on the Go scheduler.\nIndex of the three part series:\n1) Scheduling In Go : Part I - OS Scheduler\n2) Scheduling In Go : Part II - Go Scheduler\n3) Scheduling In Go : Part III - Concurrency\nIntroduction In the first part of this scheduling series, I explained aspects of the operating-system scheduler that I believe are important in understanding and appreciating the semantics of the Go scheduler.","link":"https://www.ardanlabs.com/blog/2018/08/scheduling-in-go-part2.html","owner":"Wilfred Hughes"},{"title":"sqlfmt: A SQL formatter for writing prettier SQL","description":"sqlfmt is an online SQL formatter. It is pronounced sequel fumpt. Its purpose is to beautifully format SQL statements. I built sqlfmt with my Cockroach Labs colleague Raphael &#x201C;knz&#x201D; Poss. Here I will describe how to use it and its features. In addition, I will argue for its need in light of the existing SQL formatters and describe its somewhat interesting implementation. As we are dealing with code formatting here, there is much opinion, and here I will discuss mine.","link":"https://www.cockroachlabs.com/blog/sql-fmt-online-sql-formatter/","owner":"Cloudflare"}]