[{"title":"A Pragmatic Approach to Tech Debt Reduction","description":"Almost every company accumulates tech debt as time goes on. Tight deadlines, changing requirements, scaling issues, poor or short-sighted system designs, knowledge silos, inconsistent coding practices, turnover of key staff — these things all happen and can contribute to tech debt. So what can be done about it once it’s there?","link":"https://developers.soundcloud.com/blog/a-pragmatic-approach-to-tech-debt-reduction","owner":"Soshace"},{"title":"All Hands on Deck - Kubernetes Hackday  (Part 1)","description":"On the 5th of November 2018, the IT team at Kogan.com started another \r\nhackday. This time, we set our goal on learning Kubernetes. We wanted to \r\nanswer the question; how exactly can we leverage container orchestration to \r\nmake our deployment process faster and more efficient?\r\n\r\nIn order to achieve our goal, we set out to deploy one of our major apps \r\nthat controls customer subscription preferences with Kubernetes on two \r\ndifferent cloud providers, Google Cloud Platform (GCP GKE) and Amazon Web \r\nServices (AWS EKS). By doing this, we hoped we could understand the pros \r\nand cons of each platform, while learning the intricacies of Kubernetes \r\ndeployment at the same time.\r\n\r\nThis will be a two part blog series. The first part will be a short \r\noverview of our motivation, goals, as well as how the day actually \r\nunfolded. The second part will be more technical, focus on the approaches \r\nof the two teams, and discuss the pros and cons of each platform.","link":"https://devblog.kogan.com/blog/all-hands-on-deck-kubernetes-hackday-part-1","owner":"Kinvolk"},{"title":"Every 7.8us your memory has a hiccup","description":"","link":"https://idea.popcount.org/2018-11-23-every-78us-your-memory-has-a-hiccup","owner":"Marco Pivetta"},{"title":"Integration Testing for Memory Leaks","description":"We write a lot of unit tests while working on the SoundCloud iOS application. Unit tests are obviously great. They’re short, they’re…","link":"https://developers.soundcloud.com/blog/integration-testing-for-memory-leaks","owner":"Soshace"}]