[{"title":"Access And Change Parent Variables From A Child Component With Vue.js","description":"\n                    <p>When working with single page web applications (SPA), chances are you&rsquo;re going to be using a router or some kind of parent and child component structure. In these scenarios, the parent components probably hold their own functions and variables that may at some point in time need to be accessed by the child component. Take for example an application that has authentication. The parent component might manage the authentication state while the child component might be a login form, secure content, or something else. When logging in, you might need to change the authentication state of the parent. This is just one of many possible examples where the child and parent need to interact.</p>\n<p>We&rsquo;re going to see how to interact with a parent component from a child component in an application created with the Vue.js JavaScript framework.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/","link":"https://www.thepolyglotdeveloper.com/2018/04/access-change-parent-variables-child-component-vuejs/","owner":"Nelson Elhage"},{"title":"BenchmarkDotNet v0.10.14","description":"<p>BenchmarkDotNet v0.10.14 has been released! This release includes:</p>\n<ul>\n<li><strong>Per-method parameterization</strong> (<a href=\"http://benchmarkdotnet.org/Advanced/Arguments.htm\">Read more</a>)</li>\n<li><strong>Console histograms and multimodal disribution detection</strong> (<a href=\"https://aakinshin.net/posts/dotnet-crossruntime-disasm/\">Read more</a>)</li>\n<li><strong>Many improvements for Mono disassembly support on Windows</strong> (A blog post is coming soon)</li>\n<li><strong>Many bugfixes</strong></li>\n</ul>\n<p>In the <a href=\"https://github.com/dotnet/BenchmarkDotNet/issues?q=milestone:v0.10.14\">v0.10.14</a> scope,\n8 issues were resolved and 11 pull requests where merged.\nThis release includes 47 commits by 8 contributors.</p>","link":"https://aakinshin.net/posts/bdn-v0_10_14/","owner":"Andrew Ray"},{"title":"GIPHY @ DataEngConf","description":"April 17 – 18, 2018 Mission Bay Conference Center – San Francisco, CA DataEngConf is the first technical conference that bridges the gap between data scientists, data engineers and data analysts. Conference talks focus on examples of real-world architectures of data pipelines and platforms, and applied, practical examples of data science. This year in San […]","link":"https://engineering.giphy.com/giphy-dataengconf-2/","owner":"Gilt"}]