[{"title":"\nAn update on Redis Streams development\n","description":"I saw multiple users asking me what is happening with Streams, when they’ll be ready for production uses, and in general what’s the ETA and the plan of the feature. This post will attempt to clarify a bit what comes next.\n","link":"\nhttp://antirez.com/news/116\n","owner":"Andrey Akinshin"},{"title":"DBAs at Baidu Grow the CockroachDB Global Community","description":"The Baidu DBA team has been an active part of our community for quite some time. Starting in 2015 as open source contributors, they became internal evangelists of CockroachDB, ultimately building several production applications. Late last year, the team approached us with an exciting proposition. They wanted to take part in leading, building, and growing the CockroachDB open source community. Given the rapid growth and excitement surrounding CockroachDB in China, Baidu and Cockroach Labs jointly decided to hold a conference that would bring top-tier DBAs and developers together to discuss CockroachDB.","link":"https://www.cockroachlabs.com/blog/baidu-dba-community/","owner":"Cloudflare"},{"title":"How Non-Engineers Test New Features at Mixmax","description":"<p>Mixmax is essential to our customers’ workflows. Because of this, when we deploy new features to production, we want to avoid introducing any regressions that might disrupt our customers’ work.</p>\n<p class=\"poet-read-more\"><a href=\"/blog/how-non-engineers-test-new-features-at-mixmax\" title=\"Read more of How Non-Engineers Test New Features at Mixmax\">Continue reading</a></p>","link":"https://mixmax.com/blog/how-non-engineers-test-new-features-at-mixmax","owner":"Microsoft Python Engineering"},{"title":"Introducing Exploranda, a set of tools for exploring complex systems.","description":"kg-card-begin: markdown","link":"https://eng.localytics.com/introducing-exploranda-a-set-of-tools-for-exploring-complex-systems/","owner":"LiveRamp"},{"title":"Welcome to WordCamp Oslo 2018","description":"On March 2–4 2018, Friday through Sunday, there will be a great chance to meet WordPressers at the conference WordCamp Oslo 2018. WordPressers are all kinds of people who are interested in WordPress – e.g. front- and backend developers, designers, bloggers, hosting companies, writers, webshop owners. WordCamp Oslo 2018, Friday: Contributor and Workshop Day Friday","link":"https://www.bjornjohansen.com/welcome-to-wordcamp-oslo-2018","owner":"Bill the Lizard"},{"title":"Write Blog Articles In Markdown On The Polyglot Developer","description":"\n                    <p>As you may or may not know, The Polyglot Developer is happy to accept guest contributions from the developer community. To find out more, check out the article titled, <a href=\"https://www.thepolyglotdeveloper.com/2017/10/write-guest-articles-polyglot-developer/\">Write Guest Articles on The Polyglot Developer Blog</a>. With that said, I&rsquo;ve been receiving a lot of questions regarding Markdown, the format in which these blog articles are crafted.</p>\n<p>The Polyglot Developer uses Hugo which is similar to Jekyll in the sense that articles are written in Markdown and then built into HTML. Don&rsquo;t worry, Markdown is not bad and you&rsquo;ll see how much more convenient it is than writing in other formats.</p>\n<p>We&rsquo;re going to get a quick look at producing content in Markdown so it can be published on the web.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/01/write-blog-a","link":"https://www.thepolyglotdeveloper.com/2018/01/write-blog-articles-markdown-the-polyglot-developer/","owner":"Nelson Elhage"}]