[{"title":"3 Of The Best Frameworks For Mobile App Development In 2018","description":"\n                    <p>Mobile development is a necessity for every modern business, but there are many ways to get the job done. Many will tell you to go pure native, some will tell you to go hybrid, and others will tell you to use a framework to go cross-platform native.</p>\n<p>We&rsquo;re going to review my top three picks for mobile development frameworks that will thrive in the 2018 year.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/04/3-best-frameworks-mobile-app-development-2018/'>3 Of The Best Frameworks For Mobile App Development In 2018</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2018/04/3-best-frameworks-mobile-app-development-2018/","owner":"Nic Raboy"},{"title":"Flatcar Linux is now open to the public","description":"A few weeks ago we announced Flatcar Linux , our effort to create a commercially supported fork of CoreOS' container Linux . You can find the reasoning for the fork in our FAQ .\nSince then we&rsquo;ve been testing, improving our build process, establishing security procedures, and talking to testers about their experiences. We are now satisfied that Flatcar Linux is a stable and reliable container operating system that can be used in production clusters.","link":"/blog/2018/04/flatcar-linux-is-now-open-to-the-public/","owner":"Kinvolk"},{"title":"Progressive Web Apps - Book Giveaway","description":"\"Progressive Web Apps\" has recently been released, and if you haven't already gotten your hands on a copy, I have 5 free copies to give away to lucky readers.","link":"https://34.220.116.254:80/progressive-web-apps-book-giveaway/","owner":"Dean Hume"},{"title":"Solitary or Sociable? Testing Events and Listeners using Laravel","description":"Testing with Laravel is very easy, but it can be a nightmare when the tests depend on Events and Listeners. In this post I’m gonna show you how you can simplify and improve those tests. Laravel is one of the most popular PHP frameworks nowadays, and I’d say its Event handler is one of the … ","link":"https://blog.jgrossi.com/2018/solitary-or-sociable-testing-events-and-listeners-using-laravel/?utm_source=rss&utm_medium=rss&utm_campaign=solitary-or-sociable-testing-events-and-listeners-using-laravel","owner":"Junior Grossi"}]