[{"title":"A framework for ambitious Chrome Extensions","description":"","link":"https://envoy.engineering/a-framework-for-ambitious-chrome-extensions-b08d1f4b944d?source=rss----d8aa51f79fb---4","owner":"Envato"},{"title":"As You Sow, So Shall you Reap: Corporate Sponsorship of Open Source","description":"The opportunity to sponsor open source software projects is one that should not be overlooked by companies that benefit from said projects. This post details the journey that one Condé Nast software engineer undertook as he advocated for sponsorship of hapi 17, and his experiences upgrading dependent internal projects. There is also some discussion as to the benefits of staying current with this Node.js server framework, and with broader community changes in general.","link":"https://technology.condenast.com/story/corporate-sponsorship-of-open-source","owner":"Commercetools"},{"title":"Building A Hello World Example C++ Application","description":"\n                    <p>I decided to take some time every month to go back to the basics when it comes to development. As you might know, I earned a Computer Science degree from the University of California, Merced, and most of the courses I took involved C++ development. While some of the more modern code schools teach JavaScript, the common university will continue to teach C++ for the foreseeable future.</p>\n<p>Getting started with something like C++ can seem like a daunting task, especially since C++ is such a powerful development language. We&rsquo;re going to see how to write, compile, and run a simple C++ application to help you get started with one of the more seasoned development options.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/08/building-hello-world-example-cpp-application/'>Building A Hello World Example C++ Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglot","link":"https://www.thepolyglotdeveloper.com/2018/08/building-hello-world-example-cpp-application/","owner":"Nelson Elhage"},{"title":"Creating Readable Spark Jobs","description":"Nowadays, it’s rather common to encounter Apache Spark being utilized in a lot of companies that need to process huge amounts of data, and things aren’t any different here at SoundCloud — as one can imagine, we have lots of data to process all the time.","link":"https://developers.soundcloud.com/blog/creating-readable-spark-jobs","owner":"Soshace"},{"title":"Mixmax hosts August SFNode Meetup","description":"<p>Mixmax was proud to host <a href=\"https://www.meetup.com/sfnode/events/245371102/\">SFNode</a> again at our office this past Thursday. This is <a href=\"/blog/sf-nodejs-meetup/\">the second time</a> we've hosted SFNode. We truly enjoy bringing together the community of Javascript developers in San Francisco to learn together. Plus, our office is pretty great, so we hear ;).</p><p class=\"poet-read-more\"><a href=\"/blog/sf-nodejs-meetup-aug-18\" title=\"Read more of Mixmax hosts August SFNode Meetup\">Continue reading</a></p>","link":"https://mixmax.com/blog/sf-nodejs-meetup-aug-18","owner":"Microsoft Python Engineering"},{"title":"Ruby 2.5 adds KeyError#receiver and KeyError#key","description":"Ruby 2.5.0 was recently released.\nEarlier to Ruby 1.9 Hash#fetch method would raise IndexError for an invalid key. An IndexError is raised when the given index value is invalid.\nirb(main):001:0&gt; hash = { &#39;foo&#39; =&gt; &#39;bar&#39; } irb(main):002:0&gt; hash.fetch(&#39;foo&#39;) IndexError: key not found from (irb):2:in `fetch&#39; from (irb):2 from :0 KeyError class was introduced in Ruby 1.9 and it inherits from IndexError class. It is raised when the specified key is not found.","link":"https://crypt.codemancers.com/posts/2018-08-06-ruby-2-6-adds-key-error-receiver-key/","owner":"Codelitt"},{"title":"What the interns have wrought, 2018 edition","description":"<p>Yet again, intern season is coming to a close, and so it’s time to\nlook back at what the interns have achieved in their short time with\nus.  I’m always impressed by what our interns manage to squeeze into\nthe summer, and this year is no different.</p>\n\n","link":"https://blog.janestreet.com/what-the-interns-have-wrought-2018/","owner":"InVision"}]