[{"title":"Considering the Community Effects of Introducing an Official MongoDB Go Driver","description":"What do you do when an open-source project you rely on no longer meets your \r\nneeds?  When your choice affects not just you, but a larger community, what \r\nprinciples guide your decision?\r\n\r\nSubmitting patches is often the first option, but you're at the mercy of \r\nthe maintainer to accept them.  If the changes you need are sweeping, \r\nsubstantial alterations, the odds of acceptance are low.  Eventually, only \r\na few realistic options remain: find an alternative, fork the project, or \r\nwrite your own replacement.  Everyone who depends on open source faces this \r\nconundrum at one time or another.\r\n\r\nAfter relying for years on the community-developed mgo Go driver for \r\nMongoDB, MongoDB has begun work on a brand-new, internally-developed, \r\nopen-source Go driver.  We know that releasing a company-sponsored \r\nalternative to a successful, community-developed project creates tension \r\nand uncertainty for users, so we did not make this decision lightly. We \r\ncarefully considered how our choi","link":"https://engineering.mongodb.com/post/considering-the-community-effects-of-introducing-an-official-golang-mongodb-driver","owner":"Mixpanel"},{"title":"Debugging Memory Leaks in Swift’s Enumerations Data Type","description":"Background We have been working on developing the GIPHY Core SDK for the open source community & 3rd party developers. So, if they’re developing an iOS or macOS app, they can easily integrate GIPHY search, trending topics, trending GIFs, Stickers, etc. directly into their apps without needing to re-invent the wheel. We decided to use […]","link":"https://engineering.giphy.com/debugging-memory-leaks-in-swifts-enum-type/","owner":"Gilt"},{"title":"Introduction to React Native","description":"What is React Native and how does it affect a developers day.","link":"/2018/01/11/react-native-intro/","owner":"MongoDB"},{"title":"Kicking the tires: Automated CockroachDB Test Cluster Deployment in AWS","description":"Today, we&#x2019;re providing an automated way to setup multi-node CockroachDB clusters so developers can easily try out the latest stable and pre-release functionality. To automate test cluster deployment, we combine AWS CloudFormation (Amazon&#x2019;s infrastructure automation product) with Kubernetes to let users spin up self-healing, horizontally scaling test clusters with just a couple clicks.\nAutomated stack creation AWS CloudFormation uses templates, which are instructions that their service can follow to reliably provision services or applications they call &#x201C;stacks.","link":"https://www.cockroachlabs.com/blog/cloud-formation-test-cluster-deployment/","owner":"Cloudflare"},{"title":"The Brutal Lifecycle of JavaScript Frameworks","description":null,"link":"https://stackoverflow.blog/2018/01/11/brutal-lifecycle-javascript-frameworks/","owner":"Squarespace"}]