[{"title":"Cherry Picking with Git","description":"Managing feature branches changes that aren't quite ready for a full merge can be a difficult task. Sometimes you don't want to push a whole branch into another, and only need to pick a few specific commits. This process is called cherry-picking.","link":"https://kolosek.com/cherry-picking-with-git/","owner":"Kogan.com"},{"title":"Forget about Clean Code, let’s embrace Compassionate Code","description":"When your heroes start acting weird, you reexamine their influence on your life. I’ve long been learning, demonstrating and teaching clean code through TDD, patterns and so on. But when I look back, I am now worried that the ideas … ","link":"http://johannesbrodwall.com/2018/06/24/forget-about-clean-code-lets-embrace-compassionate-code/","owner":"Joel Spolsky"},{"title":"Innovating on Authentication Standards","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/175238617378/innovating-on-authentication-standards\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p>By George Fletcher and Lovlesh Chhabra </p>\n<p>When Yahoo and AOL came together a year ago as a part of the new Verizon subsidiary Oath,  we took on the challenge of unifying their identity platforms based on current identity standards. Identity standards have been a critical part of the Internet ecosystem over the last 20+ years. From single-sign-on and identity federation with SAML; to the newer identity protocols including OpenID Connect, OAuth2, JOSE, and SCIM (to name a few); to the explorations of “self-sovereign identity” based on distributed ledger technologies; standards have played a key role in providing a secure identity layer for the Internet.</p>\n<p>As we navigated this journey, we ran across a number of different use cases where there was either no standard or no best practice available for our varied and com","link":"https://yahooeng.tumblr.com/post/175238642656","owner":"Xmartlabs"},{"title":"Take your balance shopping with Venmo Debit Card ","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/venmo-card","owner":"Vena Solutions"}]