[{"title":"DevSum 2018 and the next steps on my journey","description":"I really like conference driven development, where you choose an interesting subject, submit it to a conference and you are forced (in a good way) to get a much deeper understanding of the topic to make it into a interesting session. I presented ‘Scala for Java Developers’ at DevSum 2018 which is based on my […]","link":"http://engineering.speedledger.com/devsum-2018-and-the-next-steps-on-my-journey/","owner":"Soundcloud"},{"title":"Dirty Code Monday!","description":"Lately I’ve been thinking about how easy it is to fall into the trap of not challenging our ideas about the code we’re working on. In order to challenge the default mindset of Clean Code, I recently proposed to institute … ","link":"http://johannesbrodwall.com/2018/07/01/dirty-code-monday/","owner":"Joel Spolsky"},{"title":"Protect GraphQL Properties With JWT In A Node.js Application","description":"\n                    <p>So you started playing around with <a href=\"https://graphql.org/\">GraphQL</a> and Node.js. Did you happen to get up to speed with my previous tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/05/getting-started-graphql-development-nodejs/\">Getting Started with GraphQL Development Using Node.js</a>? Regardless on how you&rsquo;ve jumped into GraphQL, you&rsquo;re probably at a time where you need to figure out how to protect certain queries or pieces of data from the general public through some kind of permissions or roles.</p>\n<p>When building a RESTful API, the common approach to endpoint protection is with JSON web tokens (JWT). In fact, I even wrote a <a href=\"https://www.thepolyglotdeveloper.com/2017/03/jwt-authentication-in-a-node-js-powered-api/\">previous tutorial</a> on the subject, but how does that have relevance to GraphQL?</p>\n<p>We&rsquo;re going to take the common JWT approach and apply it towards protecting queries as well as part","link":"https://www.thepolyglotdeveloper.com/2018/07/protect-graphql-properties-jwt-nodejs-application/","owner":"Nelson Elhage"},{"title":"Step","description":"<p>Use <a href=\"http://step.maryrosecook.com\">Step</a> to get a more precise understanding of how code executes.</p>\n\n<p>You see a code listing.  You click on the part of the code that you think will execute next. Then you click on the part of the code that you think will execute after that.  And so on.</p>\n\n<p>This is just a proof of concept.  You can’t enter your own code, but I plan to change that.</p>\n\n<p><a href=\"http://step.maryrosecook.com\">Try it out</a></p>\n\n<hr />\n\n<p><img src=\"/images/step.png\" alt=\"\" /></p>\n","link":"https://maryrosecook.com/blog/post/step","owner":"Martin Fowler"}]