[{"title":"Engineering Levels at SoundCloud","description":"An absolutely crucial part of the experience of being an engineer at SoundCloud is learning and growing as a person. Pretty much everyone we hire mentions this aspect as one of their main motivations for joining the company. And while retaining highly talented and motivated people and helping them develop is naturally valuable for SoundCloud as a company, it’s also profoundly beneficial for the employees themselves.","link":"https://developers.soundcloud.com/blog/engineering-levels","owner":"Soshace"},{"title":"Gravity Forms personal data exporter and eraser","description":"When WordPress 4.9.6 launched on May 17, 2018 it came with new tools for exporting and erasing personal data that you may have collected (you know, GDPR and all). But Gravity Forms as of version 2.3.2 doesn’t integrate with these tools. Fortunately, it is really easy to write your own exporters and erasers. I wrote","link":"https://www.bjornjohansen.com/gravity-forms-personal-data-exporter-and-eraser","owner":"Bill the Lizard"},{"title":"Override The Android Back Button In A NativeScript With Angular Application","description":"\n                    <p>Have you ever needed to perform a certain action when the user tries to hit the back button or exit out of your application on Android devices? For example, what if the user was able to back out of your application and you wanted to show a dialog. Or what if you have a video application and you wanted to pause the video when they tap the back button?</p>\n<p>Being able to override the functionality of the back button on Android can do great things for your application as long as you don&rsquo;t abuse it.</p>\n<p>We&rsquo;re going to see how to create a mobile application with <a href=\"https://www.nativescript.org/\">NativeScript</a> and <a href=\"https://angular.io/\">Angular</a> that demonstrates overriding the back button on Android, whether that be hardware or software.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/05/override-android-back-button-nativescript-angular-application/'>Ove","link":"https://www.thepolyglotdeveloper.com/2018/05/override-android-back-button-nativescript-angular-application/","owner":"Nelson Elhage"},{"title":"What Write Skew Looks Like","description":"Syndication from What Does Write Skew Look Like by Justin Jaffray\nThis post is about gaining intuition for Write Skew, and, by extension, Snapshot Isolation. Snapshot Isolation is billed as a transaction isolation level that offers a good mix between performance and correctness, but the precise meaning of &quot;correctness&quot; here is often vague. In this post I want to break down and capture exactly when the thing called &quot;write skew&quot; can happen.","link":"https://www.cockroachlabs.com/blog/what-write-skew-looks-like/","owner":"Cloudflare"}]