[{"title":"CSS Georgia Font Stack with Tabular Numbers","description":"Georgia is used as both a primary and fallback typeface in many CSS stacks, as it is available on nearly all macOS and Windows machines. However, by default Georgia uses “old style, proportional numbers” or “text figures.” That is, the numbers have different widths so they don’t align well in tables, and different vertical size and alignment. Many (most?) other typefaces use “tabular, lining numbers” with similar horizontal size and vertical alignment.","link":"https://www.client9.com/css-georgia-font-stack-with-tabular-numbers/","owner":"Nick Desaulniers"},{"title":"CSS System Fonts on Linux 2018","description":"I’ve been working on CSS native font stacks as way of delivering the best reading experience in the shortest amount of page-load time. Apple and Windows are mostly straightforward. But what about Linux? To find out, I fired up the default desktop versions of:\nFedora 28 (pre-release) Ubuntu 18.04 (pre-release) Mint Linux 18.3 Elementary.io (early 2018) and the ran the following and analyzed the results.\nfc-list -f &#39;%{family[0]}\\n&#39; | sort -u What’s Installed These generic fonts were installed on all systems:","link":"https://www.client9.com/css-system-fonts-on-linux-2018/","owner":"Nick Desaulniers"},{"title":"Growing software, in two tweets","description":"Gardening is my preferred metaphor for software. When I grow a new piece of software, there is a very predictable path I go through as I attempt to manage it’s complexity. It is, in fast-forward, the history of programming language design. That process is short enough to capture in about 400 characters, as two tweets. […]","link":"https://www.darkcoding.net/software/growing-software-in-two-tweets/","owner":"Glenn Engstrand"},{"title":"React Native Animations: Part 2","description":"When we build apps for our clients, beautiful designs and interactions are important. But equally important is performance. Without a fast frame rate our fancy animations will stutter to a halt. Without responsive taps and swipes our users will grow impatient and leave. Fortunately the creators of React Native care about performance too. They’ve given […]","link":"/dev/2018/03/react-native-animations-part2/","owner":"Pusher"}]