[{"title":"A Peek Behind the Mail Curtain","description":"<p><b>USE IMAP TO ACCESS SOME UNIQUE FEATURES</b></p><p><i>By Libby Lin, Principal Product Manager</i></p><p>Well, we actually won’t show you how we create the magic in our big OATH consumer mail factory. But nevertheless we wanted to share how interested developers could leverage some of our unique features we offer for our Yahoo and AOL Mail customers. </p><p>To drive experiences like our travel and shopping smart views or message threading, we tag qualified mails with something we call <i>DECOS</i> and <i>THREADID</i>. While we will not indulge in explaining how exactly we use them internally, we wanted to share how they can be used and accessed through IMAP. </p><p>So let’s just look at a sample IMAP command chain. We’ll just assume that you are familiar with the IMAP protocol at this point and you know how to properly talk to an IMAP server. </p><p>So here’s how you would retrieve <i>DECO</i> and <i>THREADID</i>s for specific messages: </p><p><b><i>1. CONNECT</i></b></p><p><b>    ","link":"https://yahooeng.tumblr.com/post/174023151641","owner":"Xmartlabs"},{"title":"Clean code with Java 9 at GeeCON","description":"<p>Last week, I was fortunate enough to attend <a href=\"https://2018.geecon.org/\">GeeCON</a>. GeeCON is a well-known conference in the JVM world and this year marked its 10th anniversary. More than 1200 people came to see over 80 sessions from more than 70 speakers distributed across 4 tracks over 3 days in Krakow, Poland.</p> <p>This was my first time attending GeeCON. In retrospect,...","link":"https://mirocupak.com/clean-code-with-java-9-at-geecon/","owner":"Milosz Galazka"},{"title":"microCPH – The Microservice Conference in Copenhagen","description":"I had the unique opportunity to attend µCPH 2018 in the wonderful city of Copenhagen this year. The relatively small community conference was a great mix of high-level and hands-on talks. Hosting a single track of talks did not jeopardised me to pick from a variety of presentation titles. Instead it felt like the order […]","link":"http://engineering.speedledger.com/%c2%b5cph-microservice-conference-in-copenhagen/","owner":"Soundcloud"},{"title":"The Marvels of Webpack 4","description":"Ensure your code matches your team's expections","link":"/2018/05/18/webpack4/","owner":"MongoDB"}]