[{"title":"Halloween 2018: Crab claws!","description":"Do you need something to cheer you up? You got it: I should explain this costume a little bit. At the US Digital Service, we do a thing called “crab claws.” Crab claws is like visual applause–you pinch your fingers up and down to say “great job” or “congratulations” or “way to go.” We do […]","link":"https://www.mattcutts.com/blog/halloween-costume-crab-claws/","owner":"Matt Aimonetti"},{"title":"Using An Exit Intent Listener To Manage Popups On A Page","description":"\n                    <p>Not too long ago I wrote a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/02/create-email-subscription-popup-jquery/\">Create an Email Subscription Popup with jQuery</a>, that demonstrated how to create popup modals within your web application. In this example the modals were presented on a timer. If you hadn&rsquo;t noticed, and I think most people did, The Polyglot Developer was using those modals for newsletter subscriptions exactly as demonstrated in the tutorial. The problem was that changes to the user experience on a timer felt intrusive no matter how long the timer. This was further validated through user feedback.</p>\n<p>The feedback, which I always take seriously, lead me to changing how the modals were presented. Instead of using a timer, I had switched them to appear based on the users intent to leave the page or site. For clarity, an exit intent happens when the mouse leaves the website to interact with other things on the comput","link":"https://www.thepolyglotdeveloper.com/2018/11/using-exit-intent-listener-manage-popups-page/","owner":"Nelson Elhage"},{"title":"Writing regression tests is (not) hard","description":"<p>Strategies for unit testing in existing codebases</p>\n<p class=\"poet-read-more\"><a href=\"/blog/writing-regression-tests\" title=\"Read more of Writing regression tests is (not) hard\">Continue reading</a></p>","link":"https://mixmax.com/blog/writing-regression-tests","owner":"Microsoft Python Engineering"}]