[{"title":"A few lesser-known but useful Ruby (on Rails) methods: Hash and Enumerable","description":"","link":"https://medium.com/jobteaser-dev-team/a-few-lesser-known-but-useful-ruby-on-rails-methods-hash-and-enumerable-24f2a20bf50?source=rss----bd77d16a0035---4","owner":"Jobandtalent"},{"title":"Apache Pulsar graduates to Top-Level Project","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/178450240238/apache-pulsar-graduates-to-top-level-project\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p>By Joe Francis, Director, Storage &amp; Messaging</p>\n<p>We’re excited to share that The Apache Software Foundation <a href=\"https://s.apache.org/DLL1\">announced today</a> that Apache Pulsar has graduated from the incubator to a Top-Level Project. <a href=\"http://pulsar.apache.org/\">Apache Pulsar</a> is an open-source distributed pub-sub messaging system, created by Yahoo in June 2015 and submitted to the Apache Incubator in June 2017.</p>\n<p>Apache Pulsar is integral to the streaming data pipelines supporting Oath’s core products including Yahoo Mail, Yahoo Finance, Yahoo Sports and Oath Ad Platforms. It handles hundreds of billions of data events each day and is an integral part of our hybrid cloud strategy. It enables us to stream data between our public and private clouds and allows data pipelines to connect acros","link":"https://yahooeng.tumblr.com/post/178450976346","owner":"Xmartlabs"},{"title":"Create a Mixmax slash command using Webtask.io","description":"Out of the box, Mixmax is a powerful tool for making your communication more powerful, compelling, and efficient. Did you know that it’s also an extensible platform that a developer can quickly and easily customize to fit their organization’s specific needs?<p class=\"poet-read-more\"><a href=\"/blog/create-a-mixmax-slash-command-using-webtask-io\" title=\"Read more of Create a Mixmax slash command using Webtask.io\">Continue reading</a></p>","link":"https://mixmax.com/blog/create-a-mixmax-slash-command-using-webtask-io","owner":"Microsoft Python Engineering"},{"title":"GIPHY @ HackNY","description":"September 29 – 30, 2018 NYU – New York, NY GIPHY is a proud sponsor of HackNY’s Fall hackathon! You know the drill, you can find our mentors there handing out GIPHY swag, helping teams with their projects and sharing info on how to use the GIPHY API. See below for information on HackNY’s Hackathon […]","link":"https://engineering.giphy.com/giphy-hackny/","owner":"Gilt"}]