[{"title":"10 Rules for a Better SQL Schema","description":"There are a lot of decisions to make when creating new tables and data warehouses. Some that seem inconsequential at the time end up causing you and your users pain for the life of the database.","link":"https://www.periscopedata.com/blog/better-sql-schema","owner":"Paypal"},{"title":"2X Your Redshift Speed With Sortkeys and Distkeys","description":"Like a lot of folks in the data community, we’ve been impressed with Redshift, Amazon’s new distributed database. Yet at first, we couldn’t figure out why performance was so variable on seemingly-simple queries.","link":"https://www.periscopedata.com/blog/double-your-redshift-performance-with-the-right-sortkeys-and-distkeys","owner":"Paypal"},{"title":"4 Reasons Not To Use MySQL For Analysis","description":"Here at Periscope, we see a lot of databases. Many of them work well for their users and were well-chosen for their specific analysis use case. But there’s one antipattern that frustrates analysts again and again: MySQL.","link":"https://www.periscopedata.com/blog/reasons-not-to-use-mysql","owner":"Paypal"},{"title":"4 Ways to Join Only The First Row in SQL","description":"For today’s daily report, we need a list of users and the most recent widget each user has created.","link":"https://www.periscopedata.com/blog/4-ways-to-join-only-the-first-row-in-sql","owner":"Paypal"},{"title":"Adding Summary Statistics to your SQL Table","description":"At Periscope Data we continuously help people build, diagnose, and update their data. When approaching a table of data for the first time, it helps our understanding to see summarizing statistics.","link":"https://www.periscopedata.com/blog/sql-summary-statistics","owner":"Paypal"},{"title":"Aggregating into Strings without String_agg or Array_agg in Amazon Redshift","description":"From time to time, any analyst will want to know the “top n instances” of something. For example, as the holidays approach, a toy store may want to know who the top customers of certain products are, so they can prepare special marketing for those customers.","link":"https://www.periscopedata.com/blog/aggregating-into-strings-without-string-agg-or-array-agg-in-amazon-redshift","owner":"Paypal"},{"title":"Analyzing Disparate Data with Segment Sources","description":"Collecting data across all the ways your customers interact with your product makes valuable analysis possible. The challenge with performing the analysis is finding a way to query data from multiple sources without a messy and complicated process.","link":"https://www.periscopedata.com/blog/analyzing-disparate-data-with-segment-sources","owner":"Paypal"},{"title":"Analyzing Our Long Term Blog Metrics With SQL","description":"At Periscope, our blog is a key channel for bringing in leads, getting our name out in front of data analysts, and positioning ourselves as experts on SQL.","link":"https://www.periscopedata.com/blog/analyzing-long-term-blog-performance-in-sql","owner":"Paypal"},{"title":"Analyzing Your Olark History with SQL","description":"​ A strong Customer Success team should be highly engaged with customers, which is why we use Olark to enable live chat and email support directly within the product.","link":"https://www.periscopedata.com/blog/analyzing-olark-data-with-sql","owner":"Paypal"},{"title":"Analyzing Your Salesforce Data With SQL","description":"When it comes to customer relationship management software, Salesforce is the undisputed king, so it is no surprise that there are many folks looking to integrate Salesforce data with other sources for a deeper look into performance.","link":"https://www.periscopedata.com/blog/salesforce-analytics-in-sql","owner":"Paypal"},{"title":"ASCII Art Charts in the Terminal","description":"At Periscope we love charts. Chart on dashboards. Charts on TVs. Charts in email. And when we’re at the the command line, charts in the terminal!","link":"https://www.periscopedata.com/blog/ascii-art-charts-in-the-terminal","owner":"Paypal"},{"title":"Beyond Random() — Normal Distributions in SQL","description":"If you’ve ever had to generate sample data in your database, odds are you’ve started with random() or its equivalent. It’s fast and it’s reliable. Unfortunately, it’s also evenly distributed.","link":"https://www.periscopedata.com/blog/beyond-random-normal-distributions-in-sql","owner":"Paypal"},{"title":"Calculating Distance between Data Centers on a Globe","description":"Calculating distance between two points on a flat plane is straightforward thanks to the Pythagorean theorem. However, what if your plane isn’t flat? What if you need to find the distance between two points on a sphere, like the earth?","link":"https://www.periscopedata.com/blog/calculating-distance-between-data-centers-on-a-globe","owner":"Paypal"},{"title":"Calculating Money Growth using PL/pgSQL","description":"PL/pgSQL for-loops are a tool that we like to use at Periscope Data. To demonstrate their use, we’re going to determine the real value of $1000 in our savings account after 15 years.","link":"https://www.periscopedata.com/blog/calculating-money-growth-using-plpgsql","owner":"Paypal"},{"title":"Calculating Year-over-Year Metrics","description":"One of the most common questions analysts ask is “Have our metrics improved over time?”.","link":"https://www.periscopedata.com/blog/calculating-year-over-year-metrics","owner":"Paypal"},{"title":"Cash Flow Modelling in SQL","description":"People love financial modelling in Excel. It’s easy, fast and flexible, and Excel’s functions allow you to quickly tweak your financial model. However, when your data volume starts to get very large, a spreadsheet can quickly break down.","link":"https://www.periscopedata.com/blog/cashflow-modeling-in-sql","owner":"Paypal"},{"title":"Coalesce Down using Correlated Subqueries","description":"Filling in gaps in your dataset usually takes one of two forms. You can interpolate, where intermediate points are generated based on their neighbors, or you can carry values forward.","link":"https://www.periscopedata.com/blog/coalesce-down-using-correlated-subqueries","owner":"Paypal"},{"title":"Cohorted Engagement: 7-day and 30-day Metrics","description":"When tracking user growth, it is helpful to look at multiple time periods. In a previous post, Cohorted Engagement with Comparable Time Windows in SQL, we covered creating charts of the form: “How many times does a user play our game in the first 30 days, and how has this varied for the users that started in January, February, and so","link":"https://www.periscopedata.com/blog/cohorted-engagement-trendlines","owner":"Paypal"},{"title":"Common Salesforce Reports in SQL","description":"At Periscope Data, we depend on our sales team to bring in revenue from the leads our marketing team generates. Like many sales teams, ours uses Salesforce to manage the processes involved in making a sale.","link":"https://www.periscopedata.com/blog/common-salesforce-reports-in-sql","owner":"Paypal"},{"title":"Comparing IP Addresses in SQL","description":"It’s a common practice to store users’ IP addresses when logging actions to an events table. Most warehouses we’ve seen have chosen to store IPs as varchars.","link":"https://www.periscopedata.com/blog/comparing-ip-addresses-in-sql","owner":"Paypal"},{"title":"Connecting Python and Periscope Data","description":"Sometimes you need to step away from reporting and analytics and do some data science. You might want to build a new lead scoring model or use a random forest to look for patterns in your churn, and languages such as R or Python offer the power and flexibility to get that done. Periscope Data is an amazing tool to have available while you code.","link":"https://www.periscopedata.com/blog/python-and-periscope-data","owner":"Paypal"},{"title":"Connecting to a Redshift Cluster with a Private IP","description":"Last week we went through how to set up your Amazon Redshift Cluster. Our instructions covered getting everything set up with a public IP. When your cluster requires a private IP for increased security, the steps for connecting are a little more complicated.","link":"https://www.periscopedata.com/blog/redshift-cluster-setup-private-ip","owner":"Paypal"},{"title":"Counting Comma-Delimited Values in Postgres, MySQL, Amazon Redshift and MS SQL Server.","description":"Every once in a great while, the enterprising SQL analyst is confronted with data that is not relational in nature.","link":"https://www.periscopedata.com/blog/counting-comma-delimited-values-in-postgres-mysql-amazon-redshift-and-ms-sql-server","owner":"Paypal"},{"title":"Creating a Histogram in Redshift","description":"One of the more popular questions our customers ask is how to make histograms in SQL.","link":"https://www.periscopedata.com/blog/creating-histogram-redshift","owner":"Paypal"},{"title":"Creating Ranked Position Time Series with SQL","description":"The Los Angeles Lakers were the top NBA team in 2008 but the last in 2016. We wanted to compare their downfall to the rise of other teams in the league, so we built a comparison of each team’s rank in the standings over the past ten years.","link":"https://www.periscopedata.com/blog/ranked-position-time-series","owner":"Paypal"},{"title":"Cross-Database Joins","description":"It began with the best of intentions: You launched your first web app for your customers, backed by a database full of transactional data to analyze","link":"https://www.periscopedata.com/blog/cross-database-joins","owner":"Paypal"},{"title":"Daily, Weekly and Monthly Charts On The Same Graph","description":"Depending on your data, looking at the same metric with daily, weekly or monthly aggregations can yield startlingly different results.","link":"https://www.periscopedata.com/blog/daily-weekly-and-monthly-charts-on-the-same-graph","owner":"Paypal"},{"title":"Day-Over-Day Changes Without Window Functions","description":"A couple of months ago, we showed you how to compute day-over-day changes using window functions. For high-growth companies, the growth rate is at least as important as the absolute value of any metric, so this technique is very handy.","link":"https://www.periscopedata.com/blog/day-over-day-changes-without-window-functions","owner":"Paypal"},{"title":"Demystifying Redshift — What's Up with My Disks?","description":"Columnar stores like Amazon Redshift achieve high speeds by reading only the columns needed to complete a query. The best speedups are achieved when these columns and the intermediate results fit in RAM. These speedups degrade if the intermediate results exceed the available RAM and get written to disk.","link":"https://www.periscopedata.com/blog/disk-based-temporary-tables","owner":"Paypal"},{"title":"Estimating Conversions with Poisson Distributions","description":"Following up on last week’s post on normal distributions, this week we’re going to show off another common probability distribution.","link":"https://www.periscopedata.com/blog/estimating-conversions-with-poisson-distributions","owner":"Paypal"},{"title":"Exact Row Counts for All Tables in MySQL and Postgres","description":"Keeping track of your row counts can be helpful for budgeting and capacity planning, yet accurate counts are surprisingly hard to get.","link":"https://www.periscopedata.com/blog/exact-row-counts-for-every-database-table","owner":"Paypal"},{"title":"Explain and Other Tools for Query Optimization","description":"As the datasets you work with get larger, queries that were once lightning fast can slow to a crawl. When this happens, it’s time to optimize.","link":"https://www.periscopedata.com/blog/explain-and-other-tools-for-query-optimization","owner":"Paypal"},{"title":"Extrapolating Data with Day-of-Week Effects","description":"At Periscope, we need to plan ahead to make sure we have enough server capacity. This means predicting future server loads.","link":"https://www.periscopedata.com/blog/extrapolating-data-with-day-of-week-effects","owner":"Paypal"},{"title":"Extrapolating to the End of the Month in SQL","description":"Our customers often come to us for help with advanced SQL queries. Recently, two of them asked us how to do an extrapolation in SQL.","link":"https://www.periscopedata.com/blog/extrapolating-to-the-end-of-the-month-in-sql","owner":"Paypal"},{"title":"Faster Django Tests by Disabling Signals","description":null,"link":"https://devblog.kogan.com/blog/disable-signal-receivers-in-your-django-tests","owner":"Kinvolk"},{"title":"Faster Redshift Queries with Materialized Views — Lifetime Daily ARPU","description":"The best way to make your SQL queries run faster is to have them do less work, and a great way to do less work is to query a materialized view that’s already done the heavy lifting.","link":"https://www.periscopedata.com/blog/faster-redshift-queries-with-materialized-views-lifetime-daily-arpu","owner":"Paypal"},{"title":"Finding Nearest Neighbors in SQL","description":"It has been almost twenty years since Major League Baseball added a new team. Now there’s talk of one being added in the West.","link":"https://www.periscopedata.com/blog/finding-nearest-neighbors-in-sql","owner":"Paypal"},{"title":"Funnel Metrics - Step-over-Step Drop Rates","description":"Funnels are an extremely flexible analysis tool that can provide clear and actionable insights. You can apply them to any situation with a notion of linear progression and where per step drop-off is important.","link":"https://www.periscopedata.com/blog/funnel-metrics-step-over-step-drop-rates","owner":"Paypal"},{"title":"Game Revenue Metrics — What Matters, and When","description":"You’ve put a ton of work into your game. Your engaging story, carefully balanced bosses, and beautiful art are paying off and bringing in revenue.","link":"https://www.periscopedata.com/blog/game-revenue-metrics","owner":"Paypal"},{"title":"Generate Series in Redshift and MySQL","description":"‍A lot of the charts and tables made in Periscope are time series, and the queries behind them are often easier when you can join and aggregate against a list of dates.","link":"https://www.periscopedata.com/blog/generate-series-in-redshift-and-mysql","owner":"Paypal"},{"title":"Getting Started with Regular Expressions","description":"Last time we talked about matching strings in SQL, we covered tactics that work well for strings on the simple side. For strings with more complicated patterns, the regular expressions below are a handy tool to have in your belt.","link":"https://www.periscopedata.com/blog/getting-started-with-regular-expressions","owner":"Paypal"},{"title":"Getting the First Row per Group 5X Faster","description":"Previously we’ve written about selecting and joining the first row in each group in the context of analysis queries. While it’s OK for analysis queries to take a few minutes — or a few seconds if you use Periscope’s cache — production queries need to run in tens of milliseconds.","link":"https://www.periscopedata.com/blog/first-row-per-group-5x-faster","owner":"Paypal"},{"title":"Hashing Tables to Ensure Consistency in Postgres, Redshift and MySQL","description":"One of the main things Periscope does to speed up queries is maintain a cache of customer data. The cache is optimized to serve certain kinds of queries, and benefits f","link":"https://www.periscopedata.com/blog/hashing-tables-to-ensure-consistency-in-postgres-redshift-and-mysql","owner":"Paypal"},{"title":"High Availability Without Giving Up Consistency","description":"If you&#x2019;re reading this, you&#x2019;re surely familiar with the arguments for high availability: services are only useful when they&#x2019;re online. Unavailable services not only lose money, but also deteriorate your credibility in customers&#x2019; eyes. This could lead to immeasurable costs to your company in the future.\nGiven that CockroachDB got its name because of its ability to survive failures, we thought we would cover some architectural considerations when building high availability services on top of Cockroach.","link":"https://www.cockroachlabs.com/blog/high-availability-with-consistency/","owner":"Cloudflare"},{"title":"How To Calculate Cohort Retention in SQL","description":"‍Losing users sucks. Losing customers really sucks. If you’re a startup you know that Retention is King.","link":"https://www.periscopedata.com/blog/how-to-calculate-cohort-retention-in-sql","owner":"Paypal"},{"title":"How to Calculate Confidence Intervals in SQL","description":"Imagine you have a small online business. This month 200 users signed up on your website, and 10 of them bought your $800 service. Great! You’ve made $8k of income. How much should you expect to make this year?","link":"https://www.periscopedata.com/blog/how-to-calculate-confidence-intervals-in-sql","owner":"Paypal"},{"title":"How to Format Numbers as Currency in Postgres, MySQL and Redshift","description":"In your venerable orders table, you’re almost certainly storing prices as numbers. Perhaps they’re integer, perhaps they’re numeric, perhaps you’re using Postgres and they’re money, or perhaps you rolled the dice on floating-point rounding errors and went with real.","link":"https://www.periscopedata.com/blog/how-to-format-numbers-as-currency-in-postgres-mysql-and-redshift","owner":"Paypal"},{"title":"How To Optimize Lifetime Distinct Counts Using Window Functions","description":"Lifetime metrics are a great way to get a long-term sense of the health of business. They’re particularly useful for seeing how healthy a segment is by comparing to others over the long term.","link":"https://www.periscopedata.com/blog/calculate-your-lifetime-metrics-in-milliseconds","owner":"Paypal"},{"title":"How To Speed Up Where Clauses By 3,000X","description":"Front and center on my Periscope dashboard is a question I ask all the time: How much usage has there been today?","link":"https://www.periscopedata.com/blog/how-to-speed-up-where-clauses-by-3000x","owner":"Paypal"},{"title":"HyperLogLog in Pure SQL","description":"Earlier we showed how to make count distinct 50x faster with subqueries. Using probabilistic counting we’ll make count distinct even faster, trading a little accuracy for the increase in speed.","link":"https://www.periscopedata.com/blog/hyperloglog-in-pure-sql","owner":"Paypal"},{"title":"Improving Point-Lookup Using Data Block Hash Index","description":"<p>We’ve designed and implemented a <em>data block hash index</em> in RocksDB that has the benefit of both reducing the CPU util and increasing the throughput for point lookup queries with a reasonable and tunable space overhead.</p>\n\n<p>Specifially, we append a compact hash table to the end of the data block for efficient indexing. It is backward compatible with the data base created without this feature. After turned on the hash index feature, existing data will be gradually converted to the hash index format.</p>\n\n<p>Benchmarks with <code class=\"language-plaintext highlighter-rouge\">db_bench</code>  show the CPU utilization of one of the main functions in the point lookup code path, <code class=\"language-plaintext highlighter-rouge\">DataBlockIter::Seek()</code>, is reduced by 21.8%, and the overall RocksDB throughput is increased by 10% under purely cached workloads, at an overhead of 4.6% more space. Shadow testing with Facebook production traffic shows good CPU improvements too.</","link":"http://rocksdb.org/blog/2018/08/23/data-block-hash-index.html","owner":"Red"},{"title":"International Analytics In SQL","description":"As word of Periscope has spread, our international customer base has grown. In order to capture more international customers, we now run marketing campaigns targeting companies outside the U.S.","link":"https://www.periscopedata.com/blog/international-analytics-in-sql","owner":"Paypal"},{"title":"Introducing Periscope Data for Slack","description":"Over the past year our customers have asked us to improve our link sharing functionality in a place where they are increasingly working and communicating more: Slack.","link":"https://www.periscopedata.com/blog/introducing-periscope-data-for-slack","owner":"Paypal"},{"title":"June Product Updates: More Database Support, Management Options, and More","description":"It’s been a busy month at Periscope HQ! Our teams have been hard at work shipping updates that will give users more ways to query and analyze data and new opportunities to manage their Periscope Data instance. ","link":"https://www.periscopedata.com/blog/june-product-updates-more-database-support-management-options-and-more","owner":"Paypal"},{"title":"Medians in SQL","description":"Finding the min, max, and avg price of an order in your purchases table is easy. But what about the median price?","link":"https://www.periscopedata.com/blog/medians-in-sql","owner":"Paypal"},{"title":"One Dimensional Clustering in Postgres","description":"Many events tables contain low level information that isn’t always easy to reason about. In this post we’ll cluster low level delivery event data into trips, making further analysis much easier.","link":"https://www.periscopedata.com/blog/one-dimensional-clustering-in-postgres","owner":"Paypal"},{"title":"Optimizing Your psql","description":"While it’s tempting to use the latest tools, there’s often a powerful enough solution that already exists. For connecting to and querying a PostgreSQL database, that tool is psql.","link":"https://www.periscopedata.com/blog/optimizing-your-psql","owner":"Paypal"},{"title":"Periscope Data’s $25M Series B","description":"We’re excited to announce that we’ve raised $25M in Series B Funding!","link":"https://www.periscopedata.com/blog/periscope-datas-25m-series-b","owner":"Paypal"},{"title":"Predicting Exponential Growth with SQL","description":"SQL is great at grouping and counting the data you already have, and with a little help from regressions, SQL can help you project that data into the future.","link":"https://www.periscopedata.com/blog/predicting-exponential-growth-with-sql","owner":"Paypal"},{"title":"Range joins give you accurate histories","description":"One fine morning, your investor Leo asks you: How many charts are there across all of Periscope? Because he’s an investor, he also wants to know: How fast is that number growing?","link":"https://www.periscopedata.com/blog/range-join-gives-you-accurate-histories","owner":"Paypal"},{"title":"Redshift Maintenance 101","description":"Keeping your Redshift clusters running well requires maintenance. Updating and deleting data creates dead rows that need to be vacuumed, and even append-only tables need to be resorted if the append order is not consistent with the sort key.","link":"https://www.periscopedata.com/blog/redshift-maintenance","owner":"Paypal"},{"title":"Redshift User Defined Functions in Python","description":"Today the Redshift team announced support for User Defined Functions! UDFs allow you to create your own SQL functions, backed by the power and flexibility of Python. Now you can add your favorite functions from other databases, or invent new ones, to make your data analysis much easier.","link":"https://www.periscopedata.com/blog/redshift-user-defined-functions-python","owner":"Paypal"},{"title":"Reuse Calculations in the Same Query with Lateral Joins","description":"Reusing parts of computations has long been a wart in SQL. Let’s say you want to compute confidence intervals for your signup rate. You’ll have to use the standard error calculation twice: once for the upper bound, and once for the lower bound.","link":"https://www.periscopedata.com/blog/reuse-calculations-in-the-same-query-with-lateral-joins","owner":"Paypal"},{"title":"Rolling Averages in MySQL and SQL Server","description":"Previously we discussed how to write rolling averages in Postgres. By popular demand we’re showing you how to do the same in MySQL and SQL Server.","link":"https://www.periscopedata.com/blog/rolling-average","owner":"Paypal"},{"title":"Setting up Your Redshift Cluster","description":"You’ve done your data warehouse research and have settled on Amazon Redshift. Now you just need to get everything set up. We’re heavy users of Redshift, so this is something we have a lot of experience with.","link":"https://www.periscopedata.com/blog/setting-up-redshift-cluster","owner":"Paypal"},{"title":"Solving the Traveling Salesman Problem with Postgres Recursive CTEs","description":"Many SQL implementations don’t have loops, making some kinds of analysis very difficult. Postgres, SQL Server, and several others have the next best thing — recursive CTEs!","link":"https://www.periscopedata.com/blog/postgres-recursive-cte","owner":"Paypal"},{"title":"Splitting Comma-Separated Values In MySQL","description":"Every once in a while, a quick decision is made to store data in a comma-separated fashion, and the SQL analyst is left to pick up the pieces during analysis.","link":"https://www.periscopedata.com/blog/splitting-comma-separated-values-in-mysql","owner":"Paypal"},{"title":"SQL for Marketers","description":"In a break from our usual posts about advanced SQL techniques, we’re bringing it back to the very beginning.","link":"https://www.periscopedata.com/blog/sql-for-marketers","owner":"Paypal"},{"title":"SQL for Marketers — 3 Ways to Slice Your Acquisition Data","description":"Acquisition metrics are a well covered blog topic. It’s easy to figure out the general metrics you should follow. The only issue is that the authors assume you’re using an analytics tool like Google Analytics or Mixpanel.","link":"https://www.periscopedata.com/blog/sql-for-marketers-3-ways-to-slice-your-acquisition-data","owner":"Paypal"},{"title":"SQL for Marketers — Making Where More Powerful","description":"Data analysis is an important part of a marketer’s work. One of the most common data analyses that marketers conduct is filtering data.","link":"https://www.periscopedata.com/blog/sql-for-marketers-comparison-operators","owner":"Paypal"},{"title":"SQL for Marketers — Your Most Profitable Channels","description":"Knowing how your customer acquisition costs compare to your customer lifetime value is a vital part of marketing. When split across channels, this data allows you to decide whether to double down on a channel or take resources away.","link":"https://www.periscopedata.com/blog/sql-for-marketers-profitable-channels","owner":"Paypal"},{"title":"SQL for Marketers Part 2 — Users over the Last 30 Days","description":"Welcome back to SQL for Marketers. Last time we covered basic SQL terms and the SQL commands select, from, where and join.","link":"https://www.periscopedata.com/blog/sql-for-marketers-part-2","owner":"Paypal"},{"title":"SQL for Marketers Part 3 — Our Most Valuable Traffic Source","description":"Another foggy day in San Francisco, another SQL for Marketers post. For round three, we’re going to determine which traffic source has driven the most revenue for us.","link":"https://www.periscopedata.com/blog/sql-for-marketers-part-3","owner":"Paypal"},{"title":"SQL for Marketers Part 4 — Common Analysis Queries","description":"Thanks for tuning in to another SQL for Marketers post! For round four, we’re going to cover a few core SQL queries that can answer many common marketing questions.","link":"https://www.periscopedata.com/blog/sql-for-marketers-part-4-common-analysis-queries","owner":"Paypal"},{"title":"SQL Joins For Data Analysis","description":"It’s rare for one table to have all the information needed for a query. Across all our customers, the average chart joins 4 tables to get its result!","link":"https://www.periscopedata.com/blog/sql-joins-data-analysis","owner":"Paypal"},{"title":"The Lazy Analyst's Guide To Postgres JSON","description":"JSON support is the most interesting new Postgres feature of the last few years. It relaxes the primary constraint of SQL databases — the rigid schema structure — by letting you store semistructured data in your tables alongside other data.","link":"https://www.periscopedata.com/blog/the-lazy-analysts-guide-to-postgres-json","owner":"Paypal"},{"title":"The Top SQL Analysis Errors We See","description":"‍When writing SQL for data analysis there are two kinds of errors: errors that prevent the query from running, and errors that merrily return the wrong data. The second kind of error can be hard to spot, especially when your results are within range of your expectations.","link":"https://www.periscopedata.com/blog/top-sql-analysis-errors","owner":"Paypal"},{"title":"Thinking Critically About Mobile Game Retention","description":"Many of our customers produce mobile games and use Periscope to track their growth metrics. Since a mobile game that doesn’t retain its players will never recoup the costs of getting those players, it’s not surprising that retention is one of their top metrics.","link":"https://www.periscopedata.com/blog/mobile-game-retention","owner":"Paypal"},{"title":"Understanding Distributed Analytics Databases, Part 1: Query Strategies","description":"Distribution and columnar storage are core to high-performance analytics databases like Redshift, CitusDB, and Snowflake. Understanding these features will help you write more efficient, faster queries.","link":"https://www.periscopedata.com/blog/understanding-distributed-analytics-databases-part-1-query-strategies","owner":"Paypal"},{"title":"Understanding Distributed Analytics Databases, Part 2 — Data Distribution","description":"Last week, we talked about query strategies for distributed analytics databases. In Part 2, we’ll explain how to adjust your data storage to take advantage of distributed columnar architectures.","link":"https://www.periscopedata.com/blog/understanding-distributed-analytics-databases-part-2-distribution","owner":"Paypal"},{"title":"Understanding Outliers with Skew and Kurtosis in SQL","description":"When you approach a distribution of data for the first time, it’s often helpful to pull out summary statistics to understand the domain of the data.","link":"https://www.periscopedata.com/blog/understanding-outliers-with-skew-and-kurtosis","owner":"Paypal"},{"title":"Understanding SQL's Null","description":"Tony Hoare invented the null reference in 1965, and he considers it his “billion-dollar mistake” for the amount of trouble it has caused. Even today, SQL’s nullvalue is the cause of several common mistakes.","link":"https://www.periscopedata.com/blog/understanding-sql-null","owner":"Paypal"},{"title":"Use generate_series to get continuous results","description":"When you’re just starting out, chances are you’ll be asking a very simple question: How many widgets did I sell each day?","link":"https://www.periscopedata.com/blog/use-generate-series-to-get-continuous-results","owner":"Paypal"},{"title":"Use Subqueries and Window Functions to Compute Running Averages","description":"By now, we’re all familiar with the ubiquitous Daily Active Users metric. It’s a wonderful, concrete way to get a sense of your engagement.","link":"https://www.periscopedata.com/blog/use-subqueries-and-window-functions-to-compute-running-averages","owner":"Paypal"},{"title":"Use Subqueries to Count Distinct 50X Faster","description":"Count distinct is the bane of SQL analysts, so it was an obvious choice for our first blog post.","link":"https://www.periscopedata.com/blog/use-subqueries-to-count-distinct-50x-faster","owner":"Paypal"},{"title":"Using CTEs and Unions to Compute Running Totals","description":"A common pattern in SQL analysis is to use multiple groupings to show grouped totals over time.","link":"https://www.periscopedata.com/blog/using-ctes-and-unions-to-compute-running-totals","owner":"Paypal"},{"title":"Using Row Numbering And Full Joins To Transpose Wide Tables","description":"Many a MySQL or Postgres DBA, with responsibility for serving a fast and responsive website, will design a schema for a survey that looks like this:","link":"https://www.periscopedata.com/blog/using-row-numbering-and-full-joins-to-transpose-wide-tables","owner":"Paypal"},{"title":"Using Self Joins To Calculate Your Retention, Churn, And Reactivation Metrics","description":"Most sophisticated user analysis looks at repeat usage: How many users come back? How many don’t? How many come back after an extended absence?","link":"https://www.periscopedata.com/blog/use-self-joins-to-calculate-your-retention-churn-and-reactivation-metrics","owner":"Paypal"}]