[{"title":"Doing some work before exiting (Ruby)","description":null,"link":"http://thelazylog.com/doing-some-work-before-exiting-ruby/","owner":"Chien Tran"},{"title":"Java 9 at Java With The Best 2018","description":"<p><a href=\"https://java.withthebest.com/\">Java With The Best</a> is a new Java conference in a <a href=\"http://withthebest.com/\">series of developer conferences</a> powered by <a href=\"http://www.bemyapp.com/\">BeMyApp</a>. There are 2 main properties that differentiate this event from other conferences you may have attended – everything takes place online, without a physical venue, and attendees can book virtual 1-1 sessions with the speakers. The event featured 58...","link":"https://mirocupak.com/java-9-at-java-with-the-best-2018/","owner":"Miro Cupak"},{"title":"Towards unprivileged container builds","description":"Once upon a time, software was built and installed with the classic triptych ./configure, make, make install. The build part with make didn’t need to be run as root, which was, in fact, discouraged.\nLater, software started being distributed through package managers and built with rpm or dpkg-buildpackage. Building packages as root was still unnecessary and discouraged. Since rpm or deb packages are just archive files, there shouldn’t be any need for privileged operations to build them.","link":"/blog/2018/04/towards-unprivileged-container-builds/","owner":"Kinvolk"},{"title":"Using curl in Automation","description":"Often times, in provisioning systems, batch scripts, and CI/CD pipelines, some call to fetch an external (network) resource is required. While it’s best to eliminate as many external dependencies and network calls as possible, sometimes it can’t be helped. In which case the omnipresent curl is useful. However, by default, curl isn’t well optimized for automation. In particular:\nshows a progress meter designed for humans. In CI/CD logs, progress meters add no value and make horrible log output.","link":"https://www.client9.com/using-curl-in-automation/","owner":"Nick Galbreath"}]