[{"title":"Create A Bitcoin Hardware Wallet With Golang And A Raspberry Pi Zero","description":"\n                    <p>Over the past month or so, in my free time, I&rsquo;ve been working towards creating an affordable hardware wallet for various cryptocurrencies such as Bitcoin. Right now many cryptocurrency enthusiasts are using the Ledger Nano S hardware wallet, but those are very expensive and rarely in supply.</p>\n<p>I own several <a href=\"https://www.amazon.com/gp/product/B01L3IU6XS/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B01L3IU6XS&amp;linkCode=as2&amp;tag=nraboy-20&amp;linkId=4271f6f537bcb2dbb33924010a43500d\">Raspberry Pi Zero</a> and thought it would be a perfect opportunity to take what I know about Raspberry Pi and Golang to create a wallet for a fraction of the price as the industry leading wallets.</p>\n<p>We&rsquo;re going to see how to create a hardware wallet, which I&rsquo;m calling the Open Ledger Micro, using Golang and a Raspberry Pi Zero.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://","link":"https://www.thepolyglotdeveloper.com/2018/03/create-bitcoin-hardware-wallet-golang-raspberry-pi-zero/","owner":"Nelson Elhage"},{"title":"How to detect the media remote on Xbox with UWP","description":"If you write an application on Xbox One with UWP, you are forced to support 2 types of controllers: gamepad and media remote. Unfortunately, a lot of applications don’t fully support the second one with 2 common mistakes: – Some features aren’t accessible with the media remote cause using a button not available (for example, a feature only accessible if the user presses trigger R or Y) – UI isn’t updated to display buttons of the media remote. We will...","link":"https://www.rudyhuyn.com/blog/2018/03/26/how-to-detect-the-media-remote-on-xbox-with-uwp/","owner":"Robin Wilson"},{"title":"Managing Unplanned and Support Tasks","description":"One challenge engineering teams often face is dealing with work that doesn’t revolve around developing new features but that still requires the team’s attention and time. The Content Engineering Team here at SoundCloud is no exception, so we iterated on a process to deal with unplanned and support tasks to end up with fewer interruptions and more time to spend on implementing planned features.","link":"https://developers.soundcloud.com/blog/managing-unplanned-and-support-tasks","owner":"Soshace"},{"title":"Open-source is about sharing and giving back. Think about that.","description":"Maintaining an open source project – even a small one – is not an easy task. The open source ecosystem is about sharing and contributing, about giving and receiving. You scratch my back and I will scratch yours. Open-source is not only a free and open software, it’s a lifestyle. Working with open-source is working … ","link":"https://blog.jgrossi.com/2018/open-source-is-about-sharing-and-giving-back-think-about-that/?utm_source=rss&utm_medium=rss&utm_campaign=open-source-is-about-sharing-and-giving-back-think-about-that","owner":"Julia Evans"}]