[{"title":"Birdcage liners","description":"My new year’s resolution was to give up on reading Twitter and Facebook. ","link":"https://www.joelonsoftware.com/2018/01/12/birdcage-liners/","owner":"Joe Nelson"},{"title":"Generate Cold Storage Paper Wallets For Ripple XRP Coins With Angular","description":"\n                    <p>About a week ago I wrote about Ripple in a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/01/build-ripple-xrp-wallet-android-ios-ionic-framework/\">Build a Ripple XRP Wallet for Android and iOS with Ionic Framework</a>, which focused on mobile development as a followup to a cross-platform desktop application that I had written about before that.</p>\n<p>There are many who would advise against storing sensitive wallet information on a computer or anything connected to the internet. As an alternative, people recommend printing your transaction signing information such as private keys and storing them on what&rsquo;s called a paper wallet, destined for a locked safe in your home or the bank.</p>\n<p>We&rsquo;re going to see how to create a paper wallet for <a href=\"https://ripple.com/\">Ripple</a> XRP coins using <a href=\"https://angular.io/\">Angular</a> and some packages provided by the Ripple development team.</p>\n                    \n           ","link":"https://www.thepolyglotdeveloper.com/2018/01/generate-cold-storage-paper-wallets-ripple-xrp-coins-angular/","owner":"Nelson Elhage"},{"title":"iBeacon Bug: Hunting for a needle in a haystack","description":"","link":"https://envoy.engineering/ibeacon-bug-hunting-for-a-needle-in-a-haystack-fc87f6c56b4b?source=rss----d8aa51f79fb---4","owner":"Envato"},{"title":"Join the Kinvolk team at FOSDEM 2018!","description":"FOSDEM, the premier European open source event that takes place in Brussels, is right around the corner! Most of the Kinvolk team is heading there for a collaborative weekend, with three of our engineers giving talks.\nKinvolk Talk Schedule Sunday, February 4, 2018\n  10:00 - 10:25: Zeeshan Ali, &ldquo; Rust memory management &quot;\nZeeshan, software engineer at Kinvolk, will give a quick introduction to memory management concepts of Rust, a system of programming language that focuses on safety and performance simultaneously.","link":"/blog/2018/01/join-the-kinvolk-team-at-fosdem-2018/","owner":"King"}]