[{"title":"7 Reasons to Panic When Writing a Tech Blog Post — and What to Do About It","description":"","link":"https://medium.com/jobteaser-dev-team/being-an-ace-tech-blogger-98e208b2c3f5?source=rss----bd77d16a0035---4","owner":"Jobandtalent"},{"title":"Angular Route Guards For Authorization In A Web And Mobile Application","description":"\n                    <p>You&rsquo;re about to release your new Angular web app. It&rsquo;s a photo sharing site and you want to test it, so you send a link to it to your hacker sister. She&rsquo;s always messing with your stuff and she found out the URL to your admin page you added to your web app. Before you know it, she&rsquo;s flushed your database using a button on that admin page that you didn&rsquo;t restrict access to. Not a problem when using development data - but I&rsquo;m sure your users wouldn&rsquo;t be any too keen on a service where they lost all of their data. Let&rsquo;s fix that</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/07/angular-route-guards-authorization-web-mobile-application/'>Angular Route Guards For Authorization In A Web And Mobile Application</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                   ","link":"https://www.thepolyglotdeveloper.com/2018/07/angular-route-guards-authorization-web-mobile-application/","owner":"Nelson Elhage"},{"title":"Content Categorization at Condé Nast: From Flat Fields to Structured Relationships","description":"Content organization is a challenge for any digital publisher. Here's how we rethought our content classification system to unlock new potential for Condé Nast Traveler.","link":"https://technology.condenast.com/story/content-categorization-at-conde-nast","owner":"Commercetools"},{"title":"Dynamic import() into your Ember app","description":"A screencast where we build an app that loads real data, lazily loads Highcharts on demand, and plots the data using Highcharts.","link":"https://eaf4.com/dynamic-import-into-your-ember-app/","owner":"Edgar Aroutiounian"},{"title":"Flex Fridays: Rebecca Taft Builds a Neural Network Query Optimizer","description":"From the beginning, Flex Fridays have been a part of the Cockroach Labs culture. It&#x2019;s a day where Roachers can make their own schedules: Should I come into the office or WFH? Should I send out these PRs or focus on my side project? Or should I just close my laptop and go on a weekend getaway? Quite frankly, it&#x2019;s up to them. Now, three and half years later, Flex Fridays are still going strong and are a benefit that we can brag about.","link":"https://www.cockroachlabs.com/blog/free-fridays-rebecca-taft/","owner":"Cloudflare"}]