[{"title":"7 Problems With Hybrid Mobile Development And How NativeScript Solves Them","description":"\n                    <p>I&rsquo;ve been a mobile application developer since 2010 and I&rsquo;ve played around with my fair share technologies and frameworks. While I&rsquo;ve developed applications that can be safely classified as vanilla native or core native using Java, I&rsquo;ve spent most of my time developing cross platform applications for Android and iOS using frameworks such as Ionic Framework and NativeScript that support web technologies.</p>\n<p>The convenience of cross platform development with web technologies doesn&rsquo;t come without penalty for certain frameworks. After all, mobile development frameworks can be split into a hybrid web category which act as web applications bundled into a mobile application and a native mobile category which act as web applications compiled into a mobile application. The difference being in my use of bundled vs compiled.</p>\n<p>We&rsquo;re going to see some of the problems that developers face when choosing to use a hybrid development ","link":"https://www.thepolyglotdeveloper.com/2018/07/7-problems-hybrid-mobile-development-how-nativescript-solves-them/","owner":"Nic Raboy"},{"title":"A Guide to Mindful Communication in Code Reviews","description":"","link":"https://kickstarter.engineering/a-guide-to-mindful-communication-in-code-reviews-48aab5282e5e?source=rss----c5ef8826f270---4","owner":"Kickstarter"},{"title":"Amazon Aurora Costs 10x More than CockroachDB for OLTP Workloads","description":"[For CockroachDB&apos;s most up-to-date performance benchmarks, please read our Performance Overview page]\nBack in April of 2018, we ran extensive tests comparing CockroachDB to Amazon Aurora in terms of TPC-C throughput&#x2014;the industry standard for testing real-world transactional throughput (you can check out those findings here).\nNo matter how crucial a component&#x2019;s performance is, though, teams must also consider the price of those numbers&#x2013;&#x2013;an app that consumes more financial resources than it generates is difficult to maintain.","link":"https://www.cockroachlabs.com/blog/aurora-price-vs-cockroachdb/","owner":"CockroachDB"},{"title":"Getting a Team Back on Track","description":"Sometimes, an important team that’s part of an otherwise healthy company culture starts tanking and the people on the team get frustrated and even quit. In this article, I want to share what I learned when I started to manage a team — referred to as the R Team from here on out — that had huge problems when I took over as Engineering Manager, as well as explain how I got it back on track.","link":"https://developers.soundcloud.com/blog/getting-a-team-back-on-track","owner":"Soundcloud"},{"title":"Open VM Tools 10.2.0-3 vSphere Guest Customization Issues","description":"Hey all – I recently went to deploy a solution involving a few Ubuntu 16.04 LTS VMs in my lab to eventually put on AWS.  There are some issues I’ve been having with deploying (updated) Ubuntu 16.04 LTS templates to my vSphere 6.7 cluster (though this seems to not work in 6.5 as well). I […]","link":"https://www.jonkensy.com/open-vm-tools-10-2-0-3-vsphere-guest-customization-issues/","owner":"Jon Kensy"},{"title":"Securing New Products at Clever","description":null,"link":"https://engineering.clever.com/2018/07/24/securing-new-products-at-clever/","owner":"Clever"}]