[{"title":"Scan For BLE iBeacon Devices With Golang On A Raspberry Pi Zero W","description":"\n                    <p>Last year I had worked on an interesting project at my day job, <a href=\"https://www.couchbase.com\">Couchbase</a>, where I scanned for BLE iBeacon devices from a few Raspberry Pi IoT devices and uploaded the information to a remote server for analysis. I wrote about this experiment in an article titled, <a href=\"https://blog.couchbase.com/collecting-ibeacon-data-with-couchbase-and-raspberry-pi-iot-devices/\">Collecting iBeacon Data with Couchbase and Raspberry Pi IoT Devices</a>.</p>\n<p>My first attempt at scanning and analyzing iBeacon data was done with Java and Node.js. The Raspberry Pi devices were using Java, and the data was being offloaded to a Node.js server. The problem with this is that Java is too heavy for the low spec Internet of Things (IoT) devices.</p>\n<p>Fast forward to round two of playing with iBeacon devices and a Raspberry Pi. We&rsquo;re going to see how to use Golang to scan for BLE signals and parse the data to determine if they are iBeaco","link":"https://www.thepolyglotdeveloper.com/2018/02/scan-ble-ibeacon-devices-golang-raspberry-pi-zero-w/","owner":"Nic Raboy"},{"title":"Success at Apache: A Newbie’s Narrative","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/170535967258/success-at-apache-a-newbies-narrative\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<figure data-orig-width=\"4032\" data-orig-height=\"3024\" class=\"tmblr-full\"><img src=\"https://64.media.tumblr.com/99c495bf816c55ec8d23389257331931/tumblr_inline_p3o1m4TqbP1rgj0aw_540.jpg\" data-orig-width=\"4032\" data-orig-height=\"3024\"/></figure><center><address dir=\"ltr\">Kuhu Shukla (bottom center) and team at the 2017 DataWorks Summit</address></center>\n<br/><p>By Kuhu Shukla</p>\n<p><i>This post first appeared <a href=\"https://blogs.apache.org/foundation/entry/success-at-apache-a-newbie\">here</a> on the Apache Software Foundation blog as part of ASF’s “Success at Apache” monthly blog series.</i><br/></p>\n<p>As I sit at my desk on a rather frosty morning with my coffee, looking up new JIRAs from the previous day in the Apache Tez project, I feel rather pleased. The latest community release vote is complete, the bug fixes that we ","link":"https://yahooeng.tumblr.com/post/170536010891","owner":"Yahoo"}]