[{"title":"Frameworkless JavaScript Part 3: One-Way Data Binding","description":"<p><em>This article is one in a series about writing client-focused JavaScript without the help of libraries and frameworks. It's meant to help developers remember that they can write good code on their own using nothing but native APIs and methods. For more, check out the original article on <a href=\"https://jack.ofspades.com/developing-small-javascript-components-without-frameworks/\">writing small</a></em></p>","link":"https://jack.ofspades.com/frameworkless-javascript-part-3-one-way-data-binding/","owner":"Jacopo Tarantino"},{"title":"Generate Cryptocurrency Private Keys And Public Addresses With Golang","description":"\n                    <p>Over the past month or so I&rsquo;ve demonstrated how to generate address information for a variety of cryptocurrency Altcoins using technologies like Node.js, Vue.js, and Angular. The thing about my <a href=\"https://www.thepolyglotdeveloper.com/categories/blockchain-development/\">previous tutorials</a> are that they all used the JavaScript stack in some sense. What if we wanted to adventure into other technologies like Golang?</p>\n<p>The process for generating key and address information for Bitcoin and popular Altcoins is pretty much the same. In reality, the difference is defined by the private key and public key prefix information, typically associated to a network.</p>\n<p>We&rsquo;re going to see how to generate and import private keys for a variety of cryptocurrency coins as well as their addresses using the Go programming language.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/201","link":"https://www.thepolyglotdeveloper.com/2018/02/generate-cryptocurrency-private-keys-public-addresses-golang/","owner":"Nic Raboy"},{"title":"RubySpec for Tracepoint","description":"I like to contribute to opensource projects and learn from them. This post is about what I learned while working on my pull request to Ruby Spec which got merged recently. In Ruby github repository I found that it has a spec folder which has a Readme file and that&rsquo;s how I &amp; learned about Ruby Spec Suite project. Ruby Spec Suite is a test suite which has specs for Ruby methods.","link":"https://crypt.codemancers.com/posts/2018-02-26-rubyspec-for-tracepoint/","owner":"Codemancers"},{"title":"Why you should contribute to open source projects","description":"Open source can change your life. It has changed mine with Corcel, an open source project I started in 2013 that changed who I am, and how I live. The first title I gave to this post was How open source can change your life for the better. That was a good title too, but I … ","link":"https://blog.jgrossi.com/2018/why-you-should-contribute-to-open-source-projects/?utm_source=rss&utm_medium=rss&utm_campaign=why-you-should-contribute-to-open-source-projects","owner":"Junior Grossi"}]