[{"title":"Bør Norge eksportere velferdstjenester? Jeg intervjuer Oslos finansbyråd neste fredag","description":"På grunn av sykdom ble intervjuet med mellom meg og Robert Steen 1. juni flyttet. Du kan istedet se oss live førstkommende fredag 22. juni. Jeg ble først oppmerksom på finansbyråd Robert Steen når vi ba ham om å holde … ","link":"http://johannesbrodwall.com/2018/05/29/bor-norge-eksportere-velferdstjenester-jeg-intervjuer-oslos-finansbyrad-neste-fredag/","owner":"Joel Spolsky"},{"title":"CSS Reset","description":"Maybe this post should be the first of the firsts because it's about how to start your CSS. Then again, you should be able to understand what exactly it is you're doing so I'm not too much late with this.","link":"https://kolosek.com/css-reset/","owner":"Kogan.com"},{"title":"GDPR-compliant email tracking","description":"<p>Last week, the EU’s new privacy law, GDPR, changed the game for cold email and email tracking. Luckily, Mixmax helps you play by the new rules. Today, we’re announcing new features to keep your entire organization compliant, while providing you with actionable insights.</p><p class=\"poet-read-more\"><a href=\"/blog/gdpr-compliant-email-tracking\" title=\"Read more of GDPR-compliant email tracking\">Continue reading</a></p>","link":"https://mixmax.com/blog/gdpr-compliant-email-tracking","owner":"Microsoft Python Engineering"},{"title":"To Yarn and Back (to npm) Again","description":"<p>Last year, <a href=\"/blog/yarn-ifying-mixmax\">we decided to move all of our JavaScript projects from npm to Yarn</a>.</p>\n<p class=\"poet-read-more\"><a href=\"/blog/to-yarn-and-back-again-npm\" title=\"Read more of To Yarn and Back (to npm) Again\">Continue reading</a></p>","link":"https://mixmax.com/blog/to-yarn-and-back-again-npm","owner":"Microsoft Python Engineering"},{"title":"We now accept donations. Buy us a beer!","description":"<p><strong>Many of our users have asked for it for quite a long time. Now, we finally took the time to setup a donation option.</strong></p>\n\n<p>Since we started Hypriot in 2015, we received great attention from a growing community around Docker on ARMed devices. We received numerous &ldquo;kudos&rdquo; and nice words. Even though we greatly appreciate this until today, words do not enable us to pay our infrastructure bills. Now you have the option to support us materialistically.</p>\n\n<p><img src=\"https://blog.hypriot.com/images/donations/liberapay-hypriot.png\" alt=\"Donations Screenshot Liberpay\" /></p>\n\n<p></p>\n\n<h2 id=\"what-we-do-with-your-donation\">What we do with your donation</h2>\n\n<p>Open source software might seem to be &ldquo;free&rdquo; (as in free beer) at first sight - that&rsquo;s a fallacy. Its development, testing, and deployment require a huuuge amount of scarce time, ARMed hardware for testing, costs for service providers that help us throughout the software lifecycle,","link":"https://blog.hypriot.com/post/donation-liberapay-support-contribute/","owner":"Huon Wilson"}]