[{"title":"Getting Started With Capacitor Using React","description":"\n                    <p>In February 2018 the Ionic team announced <a href=\"https://capacitor.ionicframework.com/\">Capacitor</a>. Capacitor allows you to make your frontend builds run everywhere, for example, iOS, Android, Electron and in the browser as a progressive web application (PWA).</p>\n<p>Also, Capacitor provides a high-quality API to work with native functions within your apps. For example, you can get access to the camera and it means you still get this access to every platform.</p>\n<p>In the <a href=\"https://capacitor.ionicframework.com/docs/\">official Capacitor documentation</a> you can find a well-described tutorial on how to use Capacitor with Ionic, but in our tutorial, we will check how you can add Capacitor to your existing <a href=\"https://reactjs.org/\">React</a> app. We will create a simple React app with Capacitor and run it on iOS and in the browser as PWA.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotde","link":"https://www.thepolyglotdeveloper.com/2018/06/getting-started-capacitor-using-react/","owner":"Nelson Elhage"},{"title":"The Original Serverless Architecture is Still Here","description":"","link":"http://engineering.khanacademy.org/posts/original-serverless.htm","owner":"Just Eat"},{"title":"Ticketmaster Presence wins “Best in Sports Technology” at Sports Business Awards","description":"Exciting news. Ticketmaster Presence was just awarded “Best in Sports Technology” at Sports Business Journal’s 11th Annual Sports Business Awards! Ticketmaster Presence is the next generation venue access control and fan engagement platform that replaces paper tickets with digital passes. Presence streamlines live event venue operations, provides real-time insights and analytics to venues and teams, enhances security, protects […]","link":"https://tech.ticketmaster.com/2018/05/31/ticketmaster-presence-wins-best-in-sports-technology-at-sports-business-awards/","owner":"Thumbtack"},{"title":"Today we mitigated the resolver","description":"","link":"https://idea.popcount.org/2018-06-01-today-we-mitigated-the-resolver","owner":"Marco Pivetta"}]