[{"title":"Introducing Oak: an Open Source Scalable Key-Value Map for Big Data Analytics","description":"<p><a href=\"https://yahoodevelopers.tumblr.com/post/178045146133/introducing-oak-an-open-source-scalable-key-value\" class=\"tumblr_blog\">yahoodevelopers</a>:</p><blockquote>\n<p>By Dmitry Basin, Edward Bortnikov, Anastasia Braginsky, Eshcar Hillel, Idit Keidar, Hagar Meir, Gali Sheffi</p>\n<p>Real-time analytics applications are on the rise. Modern decision support and machine intelligence engines strive to continuously ingest large volumes of data while providing up-to-date insights with minimum delay. For example, in <a href=\"http://www.flurry.com/\">Flurry Analytics</a>, an Oath service which provides mobile developers with rich tools to explore user behavior in real time, it only takes seconds to reflect the events that happened on mobile devices in its numerous dashboards. The scalability demand is immense – as of late 2017, <a href=\"http://flurrymobile.tumblr.com/post/169545749110/state-of-mobile-2017-mobile-stagnates\">the Flurry SDK was installed on 2.6B devices and monitored 1M+ mo","link":"https://yahooeng.tumblr.com/post/178045294111","owner":"Xmartlabs"},{"title":"Need to document your environment?  Check out “As Built Report”","description":"Documentation – ew, yuck.  I know, I know.  However, if you work in an environment with tight change control and validation requirements then this will strike your fancy. For the longest time I’ve combined bits and pieces of various scripts and utilities such as RVTools, Alan Renouf’s vCheck Report, some aspects of vDocumentation (thanks to […]","link":"https://www.jonkensy.com/need-to-document-your-environment-check-out-as-built-report/","owner":"John Wittenauer"},{"title":"Performance Tracing for GraphQL with Apollo and it’s friends","description":"","link":"https://medium.com/hackernoon/performance-tracing-for-graphql-with-apollo-and-its-friends-877adf733322?source=rss-d14afae26ab6------2","owner":"Daniel Doubrovkine (dB.)"},{"title":"Up Your Meeting Game","description":"<p>Today we up your meeting game with two updates to our calendar — plus one customer favorite:</p><p class=\"poet-read-more\"><a href=\"/blog/meeting-variables\" title=\"Read more of Up Your Meeting Game\">Continue reading</a></p>","link":"https://mixmax.com/blog/meeting-variables","owner":"Microsoft Python Engineering"}]