[{"title":"Add Zoom meetings and rooms to your calendar","description":"<p>Today we up your meeting game with two updates to our calendar — plus one customer favorite:</p><p class=\"poet-read-more\"><a href=\"/blog/add-zoom-meetings-and-rooms-to-your-calendar\" title=\"Read more of Add Zoom meetings and rooms to your calendar\">Continue reading</a></p>","link":"https://mixmax.com/blog/add-zoom-meetings-and-rooms-to-your-calendar","owner":"Microsoft Python Engineering"},{"title":"JWT Authorization In A GraphQL API Using Golang","description":"\n                    <p>If you&rsquo;ve been keeping up, you&rsquo;ll remember I released a very popular tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/05/getting-started-graphql-golang/\">Getting Started with GraphQL Using Golang</a> which was more or less a quick-start to using GraphQL in your web applications. Since then, I demonstrated an alternative way to work with related data in a tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2018/05/maintain-data-relationships-resolvers-graphql-golang-application/\">Maintain Data Relationships Through Resolvers with GraphQL in a Golang Application</a>. Both articles are great, but they left out an important feature that most modern APIs must have. Most modern APIs must have a way to authorize particular users to access only certain pieces of data and not all data offered by the service.</p>\n<p>One of the most popular ways to enforce some kind of authorization in an application is through the use of JSON web ","link":"https://www.thepolyglotdeveloper.com/2018/07/jwt-authorization-graphql-api-using-golang/","owner":"Nelson Elhage"},{"title":"Six Attributes of Beautiful Systems","description":"What I’ve learned at Squarespace is that technical aesthetics can be \r\ndescribed precisely and that developing that vocabulary to use in \r\nconversations with colleagues about the merits of designs can lead to more \r\nbeautiful systems, which carry significant practical benefits.","link":"https://engineering.squarespace.com/blog/2018/six-attributes-of-beautiful-systems","owner":"Square"},{"title":"Understanding Permissions in the Android World","description":null,"link":"https://clevertap.com/blog/understanding-android-permissions/","owner":"Clever"}]