[{"title":"CockroachDB 2.0 Has Arrived!","description":"CockroachDB debuted as the open source database that made it possible to build massive, reliable cloud applications without giving up SQL. Forward-thinking companies adopted it to hide the complexity of dealing with distributed scale, resilience, and consistency problems in the database layer. The promise was simple: keep your apps simple and your pagers silent. Over the last six months, we&#x2019;ve welcomed Mesosphere as a customer and helped companies like Kindred and Baidu continue to migrate internet-scale workloads onto CockroachDB.","link":"https://www.cockroachlabs.com/blog/cockroachdb-2-0-release/","owner":"CockroachDB"},{"title":"Cryptographic Right Answers","description":"\n\n<p>We’re less interested in empowering developers and a lot more pessimistic about the prospects of getting this stuff right.</p>\n\n<p>There are, in the literature and in the most sophisticated modern systems, “better” answers for many of these items. If you’re building for low-footprint embedded systems, you can use STROBE and a sound, modern, authenticated encryption stack entirely out of a single SHA-3-like sponge constructions. You can use NOISE to build a secure transport protocol with its own AKE. Speaking of AKEs, there are, like, 30 different password AKEs you could choose from.</p>\n\n<p>But if you’re a developer and not a cryptography engineer, you shouldn’t do any of that. You should keep things simple and conventional and easy to analyze; “boring”, as the Google TLS people would say.</p>\n\n<p>(This content has been developed and updated by different people over a decade. We&rsquo;ve kept what Colin Percival originally said in 2009, Thomas Ptacek said in 2015, and what we&rsqu","link":"https://latacora.micro.blog/2018/04/03/cryptographic-right-answers.html","owner":"Latacora"},{"title":"CSS Color Emoji Stack","description":"As part of a solid cross-platform system stack is emoji rendering. As mentioned in CSS System Fonts for Linux 2018, Ubuntu 18.04 and Fedora 28 gain color emoji support. While most platforms now render emoji by default, the results are often inconsistent. Most emoji will be in color, but perhaps not the system emoji, and some emoji by default will render in monochrome versions. To help resolve these issues, color emoji fonts must be explicitly added to make them render correctly.","link":"https://www.client9.com/css-color-emoji-stack/","owner":"Nick Galbreath"},{"title":"OCaml all the way down","description":"<p>One of the joys of working at Jane Street for the last 15 or so years\nhas been seeing how our software stack has grown in scope. When I\nstarted, I was building pretty narrowly focused systems for doing\nstatistical research on trading strategies, and then building systems\nfor executing those same strategies.</p>\n\n","link":"https://blog.janestreet.com/ocaml-all-the-way-down/","owner":"Jane Street"}]