[{"title":"Building a global search engine for genetic data at DevTO","description":"<p><a href=\"http://www.devto.ca/\">DevTO</a> is a popular meetup for software developers in Toronto. Attended by over 100 developers on the last Monday of each month, the group features two 20-minute presentations on various topics from the industry, accompanied by food, drinks and networking.</p> <p>On April 30, <a href=\"https://www.wealthsimple.com/\">Wealthsimple</a> hosted <a href=\"https://www.meetup.com/DevTOEvents/events/249570998/\">the event</a> celebrating the 7th anniversary of DevTO. I was invited to...","link":"https://mirocupak.com/building-a-global-search-engine-for-genetic-data-at-devto/","owner":"Milosz Galazka"},{"title":"Clever Reliability — May 2018 Update","description":null,"link":"https://engineering.clever.com/2018/05/16/clever-reliability-may-2018-update/","owner":"Chef"},{"title":"There Will Be WireGuard","description":"<p>Amidst the hubbub of the Efail PGP/SMIME debacle yesterday, the WireGuard project made a pretty momentous announcement: a MacOS command line version of the <a href=\"https://www.wireguard.com/\">WireGuard VPN</a> is <a href=\"https://lists.zx2c4.com/pipermail/wireguard/2018-May/002854.html\">now available for testing</a>, and should stabilize in the coming few months. I’m prepared to be wrong, but I think that for a lot of young tech companies, this might be the biggest thing to happen to remote access in decades.</p>\n\n<p>WireGuard is a modern, streamlined VPN protocol that Jason Donenfeld  developed based on Trevor Perrin’s <a href=\"http://noiseprotocol.org/\">Noise protocol framework</a>. Imagine a VPN with the cryptographic sophistication of Signal Protocol and you’re not far off. Here are the important details:</p>\n\n<p>WireGuard is orders of magnitude smaller than the IPSEC or OpenVPN stacks. On Linux, the codebase is something like 4500 lines. It’s designed to be simple and easy to ","link":"https://latacora.micro.blog/there-will-be/","owner":"Kolosek"},{"title":"TPDP Episode #18: Progressive Web Application Development","description":"\n                    <p>I&rsquo;m pleased to announce that the latest episode of The Polyglot Developer Podcast, titled <strong>Progressive Web Application Development</strong> has been published to all of the major podcast networks.</p>\n<p>In this episode, which is the eighteenth on the show, I&rsquo;m joined by <a href=\"https://twitter.com/tzmanics\">Tara Manicsic</a> who is a Google Developer Expert (GDE) and works for Progress Software, the company behind Kendo UI. We discuss everything from where applications are headed and how they can function effectively as PWAs.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2018/05/tpdp-episode-18-progressive-web-application-development/'>TPDP Episode #18: Progressive Web Application Development</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2018/05/tpdp-episode-18-progressive-web-application-development/","owner":"Nelson Elhage"},{"title":"Updating Your Engineering Interview to Make Better Hiring Decisions","description":"For many engineers, thinking about spending countless hours of studying for coding interviews leaves them exhausted before they even get started. At Cockroach Labs, we have open sourced the interview process on Github to create familiarity for candidates and removed resumes and utilized exercise-based interviews to reduce bias. Beginning in mid-2017, we engaged with our engineering team on how we can make our engineering interview process less intimidating and more fair, resulting in better hiring decisions.","link":"https://www.cockroachlabs.com/blog/updating-eng-interview/","owner":"Cloudflare"}]