[{"title":"A Probabilistic Approach to Counting Message Deliveries","description":"<h3 id=\"message-summaries-help-teachers-students-and-parents-to-communicate-better\">Message summaries help teachers, students and parents to communicate better</h3>\n\n<p>Here is a scenario that happens at <strong>Remind</strong> every day: a teacher sends a class announcement, which goes out to every class participant. There are several ways that an announcement can be delivered, as each recipient may choose their preferred delivery mechanism: push notification, email and SMS are supported.</p>\n\n<p><img src=\"https://s3.amazonaws.com/prod-remind-com-devbuckets-engblogimagebucket-9c8ee3y4wppb/2018-02-14-falcon-heavy-announcement.png\" alt=\"An announcement on Remind\" /></p>\n\n<p>Statistics are collected about whether each recipient has received and/or read the message, and then, they are presented to the teacher as an aggregated view, also known as a <strong>message summary</strong>.</p>\n\n<p><img src=\"https://s3.amazonaws.com/prod-remind-com-devbuckets-engblogimagebucket-9c8ee3y4wppb/2018-02","link":"http://engineering.remind.com/a-probabilistic-approach-to-counting-message-deliveries/","owner":"Remind"},{"title":"The end.","description":"<p>The first code of PullReview has been pushed in January 2013. We were 3, Martin, Stephan, and I. It was launched in October 2013.\nIt slowly grew for about 2 years. Life being about choices and decisions, we split, Martin and Stephan taking different roads. I tried\nto actively run and grow PullReview alone. After one year, the customer base was not still enough. I decided to find a new adventure and\njoined Eura Nova in January 2016. I put PullReview in maintenance mode and slowly reduced the operational cost. The revenue was enough to\ncover them. It worked for 2 years. I was happy that I could continue to help developers.</p>\n\n<p>Recently, 2 big customers stopped their subscription. The revenue does not cover the costs anymore. This is the end of PullReview. I’ll\nstop it next Monday, the 19th February 2018, the free and paying versions. There are good alternatives, I’m sure you’ll find one that\nsuits you.</p>\n\n<p>It was a great adventure, I learned a lot, I could help a lot of develo","link":"http://blog.8thcolor.com/en/2018/02/the-end/","owner":"PullReview"},{"title":"Tools We Love – iOS and Android","description":"Last year, the Raizlabs team showed our love by sharing our favorite tools. We love developing impactful products that change lives. Our favorite tools help us spend more time writing code, and less time in the spaces in between. Check out some of our favorites for iOS and Android: iOS Distribution Profiles, certificates, signing, and […]","link":"/dev/2018/02/tools-love-ios-android/","owner":"Raizlabs"}]