[{"title":"Clever SSO Reliability — July 2018 Update","description":null,"link":"https://engineering.clever.com/2018/08/08/clever-sso-reliability-july-2018-update/","owner":"Chef"},{"title":"ROCA vs. ROBOT: An Eternal Golden Braid","description":"\n\n<p>The ROCA RSA key generation flaw or ROBOT, the “Return Of Bleichenbacher” attack: which is most deserving of the “Best Cryptographic Attack” Pwnie award at the 2018 Black Hat USA conference? Only one can survive. Let us consider.</p>\n\n<p>Assume for the moment that it’s down to those two: ROBOT and ROCA. But first take a moment to consider the best cases for the “runners up”. They are all excellent; it was a very good year for crypto research.</p>\n\n<h2 id=\"efail\">Efail</h2>\n\n<p>The Efail attack broke PGP email. Also: S/MIME. All encrypted email! That is, by itself, a headlining cryptographic vulnerability. The case for Efail as Pwnie winner:</p>\n\n<ul>\n<li><p>The Efail Pwnie might do the most good for the community of all the Pwnie winners. The encrypted email ecosystem is broken, and has been known to be broken for over a decade. The Efail researchers took vulnerabilities we knew about and weaponized them to break actual email clients. In this sense, Efail looks a lot like BEAST, w","link":"https://latacora.micro.blog/roca-vs-robot/","owner":"Kolosek"},{"title":"The Evolution of RecyclerView Adapter in OpenSooq","description":"\n\t\t\t\t\t\t","link":"https://engineering.opensooq.com/the-evolution-of-recyclerview-adapter-in-opensooq/","owner":"Oyster"},{"title":"Wildcard certificate from Let’s Encrypt with CloudFlare DNS","description":"If you’re using CloudFlare to host your DNS, there is a plugin for the official Let’s Encrypt client Certbot you can use to easily acquire and renew wildcard certificates from Let’s Encrypt. Note: This article has been changed to not use pip to install Certbot, but instead use the now available OS packages. CloudFlare API","link":"https://www.bjornjohansen.com/wildcard-certificate-letsencrypt-cloudflare","owner":"Bill the Lizard"}]