[{"title":"Acks-giving, or How We Give Thanks at Cockroach Labs","description":"Every Sunday, my husband and I share what we are thankful for. While we give gratitude throughout the week, on Sundays, we make a point of saying our gratitude out loud to each other. &#x201C;Sunday thankfuls&#x201D; are a tradition we will teach our 9-month-old, and that we encourage our friends and family to join should they find themselves at our dinner table.\nIt&#x2019;s important to us that we vocalize our gratitude out loud.","link":"https://www.cockroachlabs.com/blog/acks-giving-or-how-we-give-thanks-at-cockroach-labs/","owner":"CockroachDB"},{"title":"Deal or No Deal? - A Tool to Find Real Discounts this Black Friday #RealBlackFridayDiscounts","description":"We've all felt happy landing good discounts during sale season ... but have you ever stopped to analyze how real these discounts were? With Black Friday around the corner, we set out to help consumers like you make better decisions on deals. Here's how. #RealBlackFridayDiscounts","link":"https://www.semantics3.com/blog/black-friday-sale-season/","owner":"Semantics3"},{"title":"Maps and Location Services with HERE by Example, Released","description":"\n                    <p>I&rsquo;m pleased to announce that a new course has been published, this time on the subject of maps and various location services. This course titled, <a href=\"https://courses.thepolyglotdeveloper.com/p/maps-and-location-services-with-here-by-example\">Maps and Location Services with HERE by Example</a>, focuses on building web applications using JavaScript and products by HERE Technologies.</p>\n<p>In this course you&rsquo;ll see many step by step examples on how to work with interactive maps, geocode and reverse geocode locations, calculate different types of routes, and more.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/11/maps-location-services-here-example-released/'>Maps and Location Services with HERE by Example, Released</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2019/11/maps-location-services-here-example-released/","owner":"Nic Raboy"},{"title":"Use replica database for read-only transactions","description":"\n<div class=\"paragraph\">\n<p>Some time ago we had a problem with performance caused by generating big reports for users.\nDuring one of the firehouse meetings, there was an idea to generate reports from the replica database.\nWe&#8217;ve solved the issue differently but the idea got me interested.\nIn this post, I&#8217;ll configure spring-boot based application to use the replica database for all read-only transactions.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201911/read-from-replica/\">Read more</a></p>","link":"https://blog.pchudzik.com/201911/read-from-replica/","owner":"Paweł Chudzik"}]