[{"title":"Creating vCenter Role/Permissions with PowerCLI","description":"Hey all – been too long! Busy as usual, but wanted to make a quick post. I have been testing NSX-T extensively and have built several nested labs in order to do so. However, I like to build out the solution as I would in a production environment which means creating an Active Directory authenticated […]","link":"https://www.jonkensy.com/creating-vcenter-role-permissions-with-powercli/","owner":"John Wittenauer"},{"title":"Interesting Matlab puzzle – analysis","description":null,"link":"https://undocumentedmatlab.com/articles/interesting-matlab-puzzle-analysis?utm_source=rss&utm_medium=rss&utm_campaign=interesting-matlab-puzzle-analysis","owner":"Una Kravets"},{"title":"My Apollo Bibliography","description":"Over the last few years — perhaps not that unusually among the nerds I know — I’ve become increasingly fascinated by the Apollo program (and early space program more generally), and been reading my way through a growing number of books and documentaries written about it. At a party this weekend I got asked for my list of Apollo book recommendations, so I decided to write them in a form I can easily share and refer to, in case it’s of interest to anyone else.","link":"https://blog.nelhage.com/post/apollo-bibliography/","owner":"Natasha Murashev"},{"title":"Spin Cycle — Automating the Tedious","description":"","link":"https://medium.com/square-corner-blog/spin-cycle-automating-the-tedious-3f569106fd3c?source=rss----3650599ae4e2---4","owner":"Sqreen"},{"title":"The Difference Between SQL’s JOIN .. ON Clause and the Where Clause","description":"A question that is frequently occurring among my SQL training‘s participants is: What’s the difference between putting a predicate in the JOIN .. ON clause and the WHERE clause? I can definitely see how that’s confusing some people, as there seems to be no difference at first sight, when running queries like these, e.g. in … ","link":"https://blog.jooq.org/2019/04/09/the-difference-between-sqls-join-on-clause-and-the-where-clause/","owner":"IPFS"}]