[{"title":"Announcing CockroachCloud: CockroachDB as a Service","description":"Today we announced the beta program for CockroachCloud, a self-service, fully managed cloud offering of CockroachDB. CockroachCloud delivers simple and easy to onboard distributed SQL, while also offering a secure and flexible experience. Whether you&#x2019;re building a small application on a single node, a resilient application across multiple nodes or a multi-region application serving users all over the world, CockroachCloud is the distributed SQL database for modern application developers.&#xA0;","link":"https://www.cockroachlabs.com/blog/cockroachcloud-release/","owner":"Cloudflare"},{"title":"Evolving Systems for New Products","description":null,"link":"https://engineering.clever.com/2019/10/16/evolving-systems-for-new-products/","owner":"Chef"},{"title":"GIPHY Gets Tagged by K-Nearest Neighbors","description":"When a brand new GIF gets uploaded onto GIPHY.com, there’s usually not a lot of data associated with it to make sure that it’s discoverable via search. While we do rely on machine learning for tag generation, we also allow uploading users and GIPHY’s content team to manually add “tags”, which are keywords that help […]","link":"https://engineering.giphy.com/giphy-gets-tagged-by-k-nearest-neighbors/","owner":"Gilt"},{"title":"How to Simulate a Liquibase Migration using H2","description":"This post is part of a new blog series about database migrations, which will cover a variety of database change management topics. In the near future, we’ll look much more into these topics, hoping to add more value to our users’ existing Flyway, Liquibase, and other integrations where the migration tools can profit a lot … ","link":"https://blog.jooq.org/2019/10/16/how-to-simulate-a-liquibase-migration-using-h2/","owner":"IPFS"},{"title":"Split the Bill with Our New Amex Partnership","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2019/10/15/split-the-bill-with-our-new-amex-partnership","owner":"Vena Solutions"}]