[{"title":"Forcing conventions","description":"\n<div class=\"paragraph\">\n<p>When the whole team agrees on coding standards we tend to be optimistic. We think that from now on\neverything will be exactly as we decided. The truth is that usually after a couple of months you’ll\nreinstall IDE or system and forget about configuration or new people join and it’s the Wild West all\nover again.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201906/code-style/\">Read more</a></p>","link":"https://blog.pchudzik.com/201906/code-style/","owner":"Paul Lewis"},{"title":"SQLsmith: Randomized SQL Testing in CockroachDB","description":"Randomized testing is a way for programmers to automate the discovery of interesting test cases that would be difficult or overly time consuming to come up with by hand. CockroachDB uses randomized testing in many parts of its code. I previously wrote about generating random, valid SQL. Since then we&#x2019;ve added an improved SQL generator to our suite called SQLsmith, inspired by a C compiler tester called Csmith. It improves on the previous tool by generating type and column-aware SQL that usually passes semantic checking and tests the execution logic of the database.","link":"https://www.cockroachlabs.com/blog/sqlsmith-randomized-sql-testing/","owner":"Cloudflare"},{"title":"Tensor Considered Harmful","description":"<p ><a href=\"http://nlp.seas.harvard.edu/NamedTensor\">Tensor Considered Harmful</a>, by Alexander Rush</p>\n<blockquote ><p >\nTL;DR: Despite its ubiquity in deep learning, Tensor is broken. It forces bad habits such as exposing private dimensions, broadcasting based on absolute position, and keeping type information in documentation. This post presents a proof-of-concept of an alternative approach, <strong >named tensors</strong>, with named dimensions. This change eliminates the need for indexing, dim arguments, einsum- style unpacking, and documentation-based coding. The prototype <strong >PyTorch library</strong> accompanying this blog post is available as <a href=\"https://github.com/harvardnlp/NamedTensor\">namedtensor</a>.\n</p></blockquote>\n<p >Thanks to Edward Z. Yang for pointing me to this \"Considered Harmful\" position paper.</p>","link":"http://lambda-the-ultimate.org/tensor-considered-harmful","owner":"Kyle Kingsbury"}]