[{"title":"Building a RESTful API Using ReactPHP: Basic Authentication","description":"In the previous article, we have created a RESTful API on top of ReactPHP HTTP server. Now we want to protect our API and add authentication. When it comes to securing a RESTful API things became interesting because a truly RESTful API should remain stateless. It means that the server doesn’t store sessions, all the information that the server needs to handle each request should be contained in the request itself. Basic HTTP Authentication Basic authentication is the type of HTTP authentication, in which login credentials are sent along with the headers of the request. The client requests a protected URL and the server responses with 401 Not Authorized code. In return, the client sends back the same request but...","link":"http://sergeyzhuk.me/2019/04/20/restful-api-with-reactphp-basic-auth/","owner":"Sam Saffron"},{"title":"NVIDIA Jetson Nano - Install Docker Compose","description":"<p>In our last blogpost <a href=\"https://blog.hypriot.com/post/nvidia-jetson-nano-intro/\">NVIDIA Jetson Nano Developer Kit - Introduction</a> we digged into the brand-new <strong>NVIDIA Jetson Nano Developer Kit</strong> and we did found out, that Docker 18.06.1-CE is already pre-installed on this great ARM board.</p>\n\n<p><img src=\"https://blog.hypriot.com/images/nvidia-jetson-nano-intro/Jetson-Nano-Upacked.jpg\" alt=\"Jetson-Nano-Upacked.jpg\" /></p>\n\n<p>Today, I want to share some more details on how you can easily install Docker Compose on the Jetson Nano.</p>\n\n<p></p>\n\n<h3 id=\"install-docker-compose\">Install Docker Compose</h3>\n\n<p>Sadly, there is no binary of <a href=\"https://docs.docker.com/compose/\">Docker Compose</a> available we could install directly on an ARM 64bit board like the NVIDIA Jetson Nano. If we are looking at the official GitHub release page for Docker Compose <a href=\"https://github.com/docker/compose/releases/tag/1.24.0\">https://github.com/docker/compose/releases/t","link":"https://blog.hypriot.com/post/nvidia-jetson-nano-install-docker-compose/","owner":"Huon Wilson"},{"title":"Practical AI Podcast: GIPHY’s Celebrity Detector","description":"GIPHY Engineering’s head of R&D, Nick Hasty, joined the Practical AI Podcast to discuss the recently released Celebrity Detector. In the episode, Nick shares more details about the project, and also sheds some light on GIPHY’s origins, AI at GIPHY and more! Check out the episode below: Practical AI 38: GIPHY’s celebrity detector – Listen […]","link":"https://engineering.giphy.com/practical-ai-podcast-giphys-celebrity-detector/","owner":"Gilt"},{"title":"Practical Metrics with Graphite and Terraform (Part 1)","description":"<p>Why we stopped using CloudWatch and hosted our own Statsd and Graphite using Terraform.</p>\n<p class=\"poet-read-more\"><a href=\"/blog/practical-metrics-one\" title=\"Read more of Practical Metrics with Graphite and Terraform (Part 1)\">Continue reading</a></p>","link":"https://mixmax.com/blog/practical-metrics-one","owner":"Microsoft Python Engineering"}]