[{"title":"3 Steps to make your app more magical","description":"Any sufficiently advanced technology is indistinguishable from magic. How can you make your own app experience more magical?","link":"https://blog.novoda.com/3-steps-to-make-your-app-magical/","owner":"Nordic APIs"},{"title":"A new beginning","description":"This blog has been inactive for a long time. I tried to at least post an article yearly, and next thing you know, two years and a half fly by&hellip; Halloween seemed like a good time to resurrect it.\nI wanted to start writing again recently, and faced an issue: this blog was using Octopress 2. Well, Octopress has apparently been dead for even longer than this blog. So I wanted to switch to another static generator.","link":"https://enoent.fr/posts/a-new-beginning/","owner":"Manu Sporny"},{"title":"Evolution of Data Ingestion and Product Instrumentation at Prezi","description":"","link":"https://engineering.prezi.com/evolution-of-data-ingestion-and-product-instrumentation-at-prezi-660e158bbfc0?source=rss----911e72786e31---4","owner":"Postmates"},{"title":"How We Built a Vectorized Execution Engine","description":"CockroachDB is an OLTPdatabase, specialized for serving high-throughput queries that read or write a small number of rows. As we gained more usage, we found that customers weren&#x2019;t getting the performance they expected from analytic queries that read a lot of rows, like large scans, joins, or aggregations. In April 2018, we started to seriously investigate how to improve the performance of these types of queries in CockroachDB, and began working on a new SQL execution engine.","link":"https://www.cockroachlabs.com/blog/how-we-built-a-vectorized-execution-engine/","owner":"Cloudflare"},{"title":"Running cron jobs in the cloud - Amazon EC2 vs AWS Lambda","description":"In this article, we compare Amazon EC2 and AWS Lambda for running cron jobs in AWS and offer guidance for when to choose which of the two.","link":"https://serverless.com/blog/aws-lambda-vs-ec2-for-cron-jobs/","owner":"Sensible"}]