[{"title":"Actions, Tasks, and Destructured Params- The Illustrated Actionhero Community Q&A","description":"","link":"https://blog.evantahler.com/actions-tasks-and-destructured-params-the-illustrated-actionhero-community-q-a-a3128f41b2ee?source=rss----6605676e3d60---4","owner":"Evan Tahler"},{"title":"All the Fitbit activity badges","description":"Fitbit has discontinued their Fitbit One step trackers, which seems like a good opportunity to step back and reflect on wearing one for the last decade or so. I’ve enjoyed using Fitbit trackers, but the One devices seemed like they broke down too often. I’m pretty proud that I ended up earning all the activity-related […]","link":"https://www.mattcutts.com/blog/all-the-fitbit-activity-badges/","owner":"Matt Cutts"},{"title":"Creating an eBook with Pandoc and Markdown","description":"\n                    <p>You might already be aware of this, but I&rsquo;ve accomplished a life achievement of writing and self-publishing two technical eBooks. I published <a href=\"https://www.thepolyglotdeveloper.com/2018/10/web-services-javascript-developer-first-edition/\">Web Services for the JavaScript Developer</a>, followed by <a href=\"https://www.thepolyglotdeveloper.com/2019/08/web-services-golang-developer-first-edition/\">Web Services for the Go Developer</a>, which contain the same concepts using two different programming technologies.</p>\n<p>If you&rsquo;ve ever thought about writing an eBook, you&rsquo;ve probably opened tools like Apple Pages or Microsoft Word and said to yourself, formatting this is going to be a nightmare. Technical content will, more often than not, contain code, which may have sophisticated formatting. Writing a programming eBook or another technical eBook doesn&rsquo;t have to be a hassle when you&rsquo;re using the right tooling.</p>\n<p>In this tutor","link":"https://www.thepolyglotdeveloper.com/2019/10/creating-ebook-pandoc-markdown/","owner":"Nic Raboy"},{"title":"keras-vggface deploy model file locally","description":null,"link":"http://redino.net/blog/2019/10/keras-vggface-deploy-model-file-locally/?utm_source=rss&utm_medium=rss&utm_campaign=keras-vggface-deploy-model-file-locally","owner":"Redino"}]