[{"title":"Podcast: A Few Of Our Favorite Things About React","description":null,"link":"https://stackoverflow.blog/2019/11/19/podcast-a-few-of-our-favorite-things-about-react/","owner":"Squarespace"},{"title":"Welkom, MapTiler.NL!","description":"\n          <img src=\"https://www.maptiler.com/media/2019-11-19-welkom-maptiler-nl-1.jpg\"\n          alt=\"Thumb\">\n          <p>We are proud to announce <a href=\"https://www.maptiler.nl/\">MapTiler.NL</a>, where you can find maps in the Dutch language, maps from official government data and a contact to a technical team in Utrecht.</p>\n\n<h2 id=\"maps-focused-on-the-netherlands\">Maps focused on the Netherlands</h2>\n<p>Street and satellite maps of the entire world can show country and city names in Dutch, English or any of the 60 supported languages.</p>\n\n<p>Fast loading of maps is accomplished by servers located in Amsterdam, Brussel and other 150 data centers on 5 continents.</p>\n\n<h2 id=\"cartiqo-vector-tiles-for-dutch-government-data\">Cartiqo: vector tiles for Dutch government data</h2>\n<p>Open data from Kadaster and Centraal Bureau voor de Statistiek are used for creating Cartiqo maps thanks to a cooperation between Webmapper and MapTiler.</p>\n\n<p>Vector tiles, raster tiles, web map servi","link":"https://www.maptiler.com/news/2019/11/welkom-maptiler-nl/","owner":"Mandrill"},{"title":"Yugabyte vs CockroachDB: Unpacking Competitive Benchmark Claims","description":"Competition is good. It focuses your energies. It keeps you sharp and pushes you to be better. At Cockroach Labs we welcome competition. It hasn&#x2019;t escaped our notice that a new entrant in the database landscape is frequently comparing themselves against us, making claims about their performance and functionality vis-a-vis our own. We decided to take a closer look. This is our analysis of CockroachDB vs Yugabyte v2.0.0. All benchmark comparisons were done with CockroachDB v19.","link":"https://www.cockroachlabs.com/blog/unpacking-competitive-benchmarks/","owner":"Cloudflare"}]