[{"title":"Getting Started with Building Chatbots using AWS Lex and Node.js","description":"\n                    <p>Amazon and a lot of cloud vendors such as Microsoft and Google have services around machine learning (ML), artificial intelligence (AI), and virtual assistants. A popular one that might come to mind is Amazon Alexa, something I&rsquo;ve <a href=\"https://www.thepolyglotdeveloper.com/tags/alexa/\">written quite a few tutorials</a> around over the years.</p>\n<p>The concept around Alexa is simple. Provide the Alexa service some audio, have that audio converted into text or some other format that can be evaluated, execute some code, and respond with something to be spoken to the user. However, what if you didn&rsquo;t necessarily want to use a virtual assistant with audio, but integrate as part of a chat application in the form of a chatbot?</p>\n<p>In this tutorial we&rsquo;re going to look at using <a href=\"https://aws.amazon.com/lex/\">Amazon Web Services (AWS) Lex</a>, which is a service for adding conversational interfaces to your applications. If you&rsquo;re comi","link":"https://www.thepolyglotdeveloper.com/2019/06/getting-started-building-chatbots-aws-lex-nodejs/","owner":"Nelson Elhage"},{"title":"Monday Motivation","description":"\n","link":"https://iridakos.com/cats/2019/06/03/monday-motivation","owner":"Larry Land"},{"title":"React Data Survival Kit","description":null,"link":"https://ponyfoo.com/articles/react-data-survival-kit","owner":"Philipp Oppermann"},{"title":"Which Hostgator Plan is Best for Indian Businesses?","description":"<div class=\"bigInt\" itemprop=\"description\">Web hosting in India is a mixed bag. There are lots of local companies based in places like Pune, Bangalore, and Chennai, but none of the web hosts own their data centers. Instead, they&#39;re leased out, and this means they don&#39;t have direct access to the servers. Hostgator on the other hand, is a well-known brand that has the resources to manage its own servers. And due to their discounts and coupons, they have some of the cheapest web hosting on the market.</div><br><div class=\"cen\"><img alt=\"Which Hostgator Plan is Best for Indian \" class=\"sri650\" itemprop=\"image\" src=\"https://github.com/srinivastamada/9lessonsImages/blob/master/articles/hostgator-s.png?raw=true\"></div><br><a href=\"http://www.9lessons.info/2019/06/which-hostgator-plan-is-best-for-indian.html#more\"></a><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/9lesson?a=mO8s6A7wkqw:So23LP_c7AU:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/9lesson?d=yIl2A","link":"http://feedproxy.google.com/~r/9lesson/~3/mO8s6A7wkqw/which-hostgator-plan-is-best-for-indian.html","owner":"Simon Reimler"}]