[{"title":"Debugging hidden memory leaks in Ruby","description":"\n<p>In 2015 I wrote about some of the tooling Ruby provides for <a href=\"https://samsaffron.com/archive/2015/03/31/debugging-memory-leaks-in-ruby\" rel=\"nofollow noopener\">diagnosing managed memory leaks</a>. The article mostly focused on the easy managed leaks.</p>\n<p>This article covers tools and tricks you can use to attack leaks that you can not easily introspect in Ruby. In particular I will discuss mwrap, heaptrack, iseq_collector and chap.</p>\n<p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://discuss.samsaffron.com/uploads/default/original/2X/9/921e3b91465bbbb906d535676b1d1b89d154c80f.png\" data-download-href=\"https://discuss.samsaffron.com/uploads/default/921e3b91465bbbb906d535676b1d1b89d154c80f\" title=\"image.png\"><img src=\"https://discuss.samsaffron.com/uploads/default/optimized/2X/9/921e3b91465bbbb906d535676b1d1b89d154c80f_2_690x286.png\" alt=\"image\" data-base62-sha1=\"kQCu0aBea6Wzy5u52K6j9Bm7lin\" width=\"690\" height=\"286\" srcset=\"https://discuss.samsaffron.com/up","link":"https://samsaffron.com/archive/2019/10/08/debugging-unmanaged-and-hidden-memory-leaks-in-ruby","owner":"Sakib Sami"},{"title":"Hosting for GeoPackage","description":"\n          <img src=\"https://www.maptiler.com/media/2019-10-15-maptiler-maps-api-hosting-for-geopackage-1-1.png\"\n          alt=\"Thumb\">\n          <p>MapTiler Cloud offers map hosting for your own geodata in any coordinate system in GeoPackage format with EPSG coordinate reference system.</p>\n\n<h2 id=\"map-hosting-for-geodata-in-any-map-projection\">Map hosting for geodata in any map projection</h2>\n<p>Map in any local or global geographic projection can now be hosted on MapTiler Cloud in GeoPackage format.</p>\n\n<p>GeoPackage is an open and interoperable standardized format, which can be produced and viewed by many desktop GIS software. Support for raster tiles is implemented according to the standard, vector tile implementation is using the <a href=\"https://docs.opengeospatial.org/per/18-074.html#_vector_tiles_extensions_informative\">very latest draft</a> of the extension.</p>\n\n<blockquote>\n  <p>Open GeoPackage standard guarantee no vendor lock-in </p>\n</blockquote>\n\n<p><a href=\"https://","link":"https://www.maptiler.com/news/2019/10/maptiler-maps-api-hosting-for-geopackage/","owner":"Mandrill"},{"title":"MapTiler Desktop 10.2","description":"\n          <img src=\"https://www.maptiler.com/media/2019-10-15-maptiler-desktop-10-2-1.png\"\n          alt=\"Thumb\">\n          <p>Generating maps in any geographic coordinate system in GeoPackage format and direct upload to MapTiler Cloud is now possible with MapTiler Desktop 10.2.</p>\n\n<h2 id=\"create-a-map-in-a-custom-grid-and-upload-it-as-geopackage-into-maptilercloud\">Create a map in a custom grid and upload it as GeoPackage into MapTiler Cloud</h2>\n<p>Generating a map in OGC GeoPackage format in local coordinate systems is possible since <a href=\"https://www.maptiler.com/blog/2017/07/geopackage-in-maptiler-80.html\">MapTiler Desktop 8.0</a>. The new release allows <strong>direct upload to our MapTiler Cloud in GeoPackage format with any tile grid</strong>. <a href=\"https://www.maptiler.com/blog/2019/10/maptiler-maps-api-hosting-for-geopackage.html\">Read more about hosting maps in any coordinate system</a>.</p>\n\n<p>Currently, only raster tiles in GeoPackage are supported. Generating ve","link":"https://www.maptiler.com/news/2019/10/maptiler-desktop-10-2/","owner":"Mandrill"},{"title":"Meet the Grads","description":"<p><em>Interested in joining Deliveroo? Head to the bottom of this post for details on our 2020 Grad Hiring.</em></p>\n\n<h3 id=\"why-deliveroo\">Why Deliveroo?</h3>\n\n<p>Hi, I’m Ryan, I recently graduated after studying Computer Science at the University of Plymouth and I’ve joined the Consumer Tech team as a backend engineer. During my time as a student I was very familiar with Deliveroo (mostly on Saturday mornings!) and this meant Deliveroo felt like the perfect place for me after Uni.</p>\n\n<p>One of the benefits of joining a company like Deliveroo is that despite the size and scale of the company, there’s still loads of challenging problems to solve. This really drew me to Deliveroo as it meant that there was ample opportunity for me to challenge myself by tackling new and interesting problems and I knew that I wouldn’t be doing boring or repetitive tasks.</p>\n\n<p>Another big motivator for me to join Deliveroo was the company culture. It was clear from the start that Deliveroo really v","link":"https://deliveroo.engineering/2019/10/15/meet-the-grads.html","owner":"DeferPanic"},{"title":"Online and Offline Sync — The Illustrated Actionhero Community Q&A","description":"","link":"https://blog.evantahler.com/online-and-offline-sync-the-illustrated-actionhero-community-q-a-c768513dd378?source=rss----6605676e3d60---4","owner":"Evan Miller"},{"title":"OpenStreetMap in WGS84","description":"\n          <img src=\"https://www.maptiler.com/media/2019-10-15-openstreetmap-in-wgs84-on-maptiler-cloud-1-1.png\"\n          alt=\"Thumb\">\n          <p>Global maps based on OpenStreetMap in WGS84 map projection are available on MapTiler Cloud via maps API. This complements the already existing maps in Web Mercator projection, which is de-facto the industry standard.</p>\n\n<h2 id=\"why-there-are-so-many-map-projections\">Why there are so many map projections?</h2>\n<p>Earth is not flat. Therefore, we need to mathematically solve the issue of projecting a globe into 2D space. It is possible to do in many ways, but all solutions, which are called map projections, have pros and cons.</p>\n\n<p>Over time, Web Mercator become de-facto the industry standard. However, like any other map projections, it also has downsides: the most visible one is the distortion of sizes. Areas near poles are displayed much bigger while equatorial zone appears much smaller than in reality.</p>\n\n<p>Various local/national ","link":"https://www.maptiler.com/news/2019/10/openstreetmap-in-wgs84-on-maptiler-cloud/","owner":"Mandrill"}]