[{"title":"Building a Simple Web Application in Dart","description":"\n                    <p><a href=\"https://www.dartlang.org/\">Dart</a> is a programming language developed by Google and made popular by <a href=\"https://flutter.io/\">Flutter</a>, their mobile development framework for cross-platform application development.</p>\n<p>The Dart language is a <a href=\"https://en.wikipedia.org/wiki/Dart_(programming_language)\">general-purpose language</a>, built to be used for far more than just mobile development, and, in this short tutorial, I will show you how to build a basic web application, using Dart.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/04/building-simple-web-application-dart/'>Building a Simple Web Application in Dart</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n                ","link":"https://www.thepolyglotdeveloper.com/2019/04/building-simple-web-application-dart/","owner":"Nelson Elhage"},{"title":"Deploying React Native Applications using App Center","description":"<p>React Native emerged as a popular framework to build Android and iOS applications from a single code base. Verification of React Native apps during the development phase is not always easy, but thanks to a host of managed services, the CI/CD process can be simplified a lot.</p>\n\n<p>A particularly interesting solution is <a href=\"https://appcenter.ms/\">App Center</a>, part of the Visual Studio product suite from Microsoft. With its built-in support for <a href=\"https://facebook.github.io/react-native/\">React Native</a>, it can not be more easier to automatically build, test, package, and distribute React Native apps, for both iOS and Android. As of this writing, App Center is using the <a href=\"https://azure.microsoft.com/en-us/pricing/details/app-center/\">pay-as-go</a> pricing model. If you are a hobbyist or developing an app for fun, likely you will be still within the free tier.</p>\n\n<p>To illustrate the use of App Center, I created a very simple React Native app (at the level of ","link":"https://ariya.io/2019/04/deploying-react-native-applications-using-app-center","owner":"Ariejan de Vroom"},{"title":"Using IGNORE NULLS With SQL Window Functions to Fill Gaps","description":"I found a very interesting SQL question on Twitter recently: Hi @sfonplsql we have some scenario, Let us 01Jan Mkt Value 100, 02Jan 120, next entry available 25th Jan 125, from 3rd Jan 24 Jan, our value should be 120. How to arrive ? Thanks @oraclebase — Vikki (@vikkiarul) April 23, 2019 Rephrasing the question: … ","link":"https://blog.jooq.org/2019/04/24/using-ignore-nulls-with-sql-window-functions-to-fill-gaps/","owner":"IPFS"}]