[{"title":"Announcing the Kinvolk Flatcar Container Linux Subscription","description":"Back in March last year, following Red Hat’s acquisition of CoreOS, Inc., we announced Flatcar Container Linux, a fork of CoreOS Container Linux. At the time, we saw this as a kind of insurance policy for a future when Red Hat might terminate ongoing support and maintenance of the widely-deployed CoreOS platform. As we put it at the time:\nThe strongest open source projects have multiple commercial vendors that collaborate together in a mutually beneficial relationship.","link":"/blog/2019/11/announcing-the-kinvolk-flatcar-container-linux-subscription/","owner":"King"},{"title":"Announcing the Kinvolk Update Service and Nebraska Project","description":"Today we are announcing the Kinvolk Flatcar Container Linux Subscription, which includes a new managed service, the Kinvolk Update Service. This is covered in more detail in another blog post .\nIn this post, we’ll dive into the details of Kinvolk Update Service and share more about the heritage, functionality, and implementation. Of course, Kinvolk Update Service is built on 100% Open Source Software, which we are also making available today on github as the Nebraska project.","link":"/blog/2019/11/announcing-the-kinvolk-update-service-and-nebraska-project/","owner":"King"},{"title":"Manage Your Costs with MapTiler Cloud","description":"\n          <img src=\"https://www.maptiler.com/media/2019-11-07-manage-your-costs-with-maptiler-cloud-1.png\"\n          alt=\"Thumb\">\n          <p>We are really glad to see that MapTiler maps are being used heavily everywhere! But this sometimes means that the request package included in your MapTiler Cloud plan is exceeded and you are charged for all the extra requests consumed by your application.</p>\n\n<p>Do you want to be in control of your monthly spending and don’t need to be surprised at the end of each month by looking at the bill? We have a solution for you! Read more to see how easily protect your maps API keys by restricting them to selected domains and set the monthly spending limit.</p>\n\n<h2 id=\"restrict-your-apikeys\">Restrict your API keys</h2>\n<p>By using MapTiler Cloud maps in a public application your API keys are exposed. The key can be misused by a third-party, which will lead to an increased number of requests on your account and possible higher charges. To protect your","link":"https://www.maptiler.com/news/2019/11/manage-your-costs-with-maptiler-cloud/","owner":"Mandrill"},{"title":"Migrating Monitoring from IOpipe to Serverless Framework Pro","description":"Learn how to migrate your serverless application monitoring to Serverless Framework Pro from IOpipe.","link":"https://serverless.com/blog/iopipe-to-serverless/","owner":"Sensible"},{"title":"Parallel Commits: An Atomic Commit Protocol For Globally Distributed Transactions","description":"Distributed ACID transactions form the beating heart of CockroachDB. They allow users to manipulate any and all of their data transactionally, no matter where it physically resides.\nDistributed transactions are so important to CockroachDB&apos;s goal to &quot;Make Data Easy&quot; that we spend a lot of time thinking about how to make them as fast as possible. Specifically, CockroachDB specializes in globally distributed deployments, so we put a lot of effort into optimizing CockroachDB&apos;s transaction protocol for clusters with high inter-node latencies.","link":"https://www.cockroachlabs.com/blog/parallel-commits/","owner":"Cloudflare"},{"title":"Using AI to Automate Web Crawling","description":"Classification, clustering and reinforcement algorithms used at Semantics3 to automate the crawling of ecommerce websites","link":"https://www.semantics3.com/blog/ai-for-automated-web-crawling/","owner":"Segment"}]