[{"title":"Configuring Visual Studio Code for Arduino Development","description":"\n                    <p>I&rsquo;ve been playing around with an <a href=\"https://amzn.to/2JJYYqA\">Arduino Uno</a> recently, something new to me since I&rsquo;ve always only used Raspberry Pi hardware. Many Arduino devices, or at least the Uno like I have are inexpensive and a lot of fun to play around with. However, the development experience out of the box isn&rsquo;t exactly what I was familiar with or happy about. To develop and push code to an Arduino you need to use the Arduino Desktop IDE. If you&rsquo;re like me, you&rsquo;re a one IDE type of developer, so having to work in a different environment is a little less than ideal.</p>\n<p>It doesn&rsquo;t have to be that way when developing with Arduino though.</p>\n<p>In this tutorial I&rsquo;m going to walk you through configuring Visual Studio Code for Arduino development. You&rsquo;ll be able to write code, deploy to hardware, and monitor the output.</p>\n                    \n                        <p>The post <a rel='nofollow' hre","link":"https://www.thepolyglotdeveloper.com/2019/05/configuring-visual-studio-code-arduino-development/","owner":"Nelson Elhage"},{"title":"Getting Started with Ionic React and Capacitor","description":"<div class=\"bigInt\" itemprop=\"description\">Ionic is the most popular framework for Angular mobile application development. Now Ionic announced with React beta and Vue Js. This post is about getting started with Ionic React with Capacitor(Ionic Product).  The Capacitor is a native bride for Cross-Platform for building universal applications.  This blog post will explain how to set up a react project using Ionic mobile components and generating iOS, Android and Desktop(Electron framework build) applications. </div><br><div class=\"cen\"><img alt=\"Getting Started with Ionic React \" class=\"sri650\" itemprop=\"image\" src=\"https://github.com/srinivastamada/9lessonsImages/blob/master/react-welcome/IonicReact.png?raw=true\"></div><br><a href=\"http://www.9lessons.info/2019/05/ionic-react-capacitor-mobile-applications.html#more\"></a><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/9lesson?a=SDJjBO9MWJI:mTSXG_14juY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/9lesson?d=yIl2A","link":"http://feedproxy.google.com/~r/9lesson/~3/SDJjBO9MWJI/ionic-react-capacitor-mobile-applications.html","owner":"Simon Reimler"}]