[{"title":"Seven Sketches in Compositionality: An Invitation to Applied Category Theory","description":"<a href=\"http://xahlee.info/math/i/category_theory_brendan_fong_david_spivak_2018-03.pdf\">Seven Sketches in Compositionality: An Invitation to Applied Category Theory</a>\n<p >2018 by Brendan Fong and David I. Spivak</p>\n<blockquote >\nCategory theory is becoming a central hub for all of pure mathematics. It is unmatched\nin its ability to organize and layer abstractions, to find commonalities between structures of all sorts, and to facilitate communication between different mathematical\ncommunities.\nBut it has also been branching out into science, informatics, and industry. We believe\nthat it has the potential to be a major cohesive force in the world, building rigorous\nbridges between disparate worlds, both theoretical and practical. The motto at MIT is\nmens et manus, Latin for mind and hand. We believe that category theory—and pure\nmath in general—has stayed in the realm of mind for too long; it is ripe to be brought\nto hand.\n</blockquote>\nA very approachable but useful introduction to","link":"http://lambda-the-ultimate.org/node/5571","owner":"Kyle Kingsbury"},{"title":"Verify your Linux Kernel for Container Compatibility","description":"<p>Are you sure whether your Linux kernel is able to run Containers in an optimal way, or if there are still some missing kernel settings which will lead to some strange issues in the future?</p>\n\n<p><img src=\"https://blog.hypriot.com/images/verify-kernel-container-compatibility/400px-NewTux.svg.png\" alt=\"400px-NewTux.svg.png\" /></p>\n\n<p>Normally you don&rsquo;t have to bother about this question. When you&rsquo;re using Docker and Containers on a modern Linux system or on a public cloud offering, this has been already optimized by the Linux distribution or your cloud provider. But when you start using Containers on Embedded Devices you should verify this carefully.</p>\n\n<p>So, let&rsquo;s learn how easy it is to verify it by yourself&hellip;</p>\n\n<p></p>\n\n<h3 id=\"how-can-i-verify-the-linux-kernel-for-container-compatibility\">How can I verify the Linux Kernel for Container Compatibility?</h3>\n\n<p>Typically this is really an easy task, as soon as you know the right tools.</p>\n\n<p>For ru","link":"https://blog.hypriot.com/post/verify-kernel-container-compatibility/","owner":"Huon Wilson"}]