[{"title":"Ember Table 2.0 Release","description":"","link":"https://medium.com/build-addepar/ember-table-2-0-release-5b91903f3e34?source=rss----596e43e5e150---4","owner":"AdRoll"},{"title":"Need a quicker way to get the money from your Venmo account into your bank account? We’ve got it.","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2019/8/9/need-a-quicker-way-to-get-the-money-from-your-venmo-account-into-your-bank-account-weve-got-it","owner":"Vena Solutions"},{"title":"Sorbet - A static type checker for Ruby","description":"Sorbet is a type checker which is now joining the flock on the duck typed Ruby Land. In this post, we shall explore why we would need static type checking and what are the implications of incorporating it.\nWhat is a Type system? Types are how a programmer can impart meaning to the raw sequence of bits such as a value, constant or some object within a program and also helps the language&rsquo;s compiler/interpreter to allocate memory accordingly.","link":"https://crypt.codemancers.com/posts/2019-08-12-sorbet-type-checker-for-ruby/","owner":"Codelitt"},{"title":"TPDP Episode #30: Building a Developer Community with Meetups","description":"\n                    <p>The thirtieth episode of The Polyglot Developer Podcast is now available on the popular podcast networks! This episode is titled, <strong>Building a Developer Community with Meetups</strong>, and it features <a href=\"https://www.linkedin.com/in/vijayxtreme/\">Vijay Menon</a>, organizer of the <a href=\"https://www.javascriptla.net\">JavaScriptLA</a> Meetup group in Los Angeles, California.</p>\n<p>Being a part of a developer community, outside of a day job, is important for all developers. Developer communities offer many benefits, some of which include learning about new and modern technologies or expanding your depth of knowledge on seasoned technologies.</p>\n<p>Education is only one of the benefits, but Vijay and I explore many in this episode of the podcast, as well as building your own communities.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/08/tpdp-e30-building-developer-communi","link":"https://www.thepolyglotdeveloper.com/2019/08/tpdp-e30-building-developer-community-with-meetups/","owner":"Nelson Elhage"}]