[{"title":"A couple of handy zsh/bash functions for Python programmers","description":"Just a quick post today, to tell you about a couple of simple zsh functions that I find handy as a Python programmer. First, pyimp – a very simple function that tries to import a module in Python and displays the output. If there is no output then the import succeeded, otherwise you’ll see the […]","link":"http://blog.rtwilson.com/a-couple-of-handy-zsh-bash-functions-for-python-programmers/","owner":"Robin Wilson"},{"title":"Evolution of Zulily’s Airflow Infrastructure","description":"At Zulily, our need to perform various dependent actions on different schedules has continued to grow. Sometimes, we need to communicate inventory changes to advertising platforms. At other times, we need to aggregate data and produce reports on the effectiveness of spend, conversions of ads or other tasks. Early … ","link":"https://zulily-tech.com/2019/11/19/evolution-of-zulilys-airflow-infrastructure/","owner":"Zulily"},{"title":"Introducing Cockroach University","description":"Last week, we launched Cockroach University with our first course, Getting Started with CockroachDB. Our goal in building this was to provide a way for people to learn CockroachDB in an engaging and structured environment with lots of opportunities for hands-on practice, as well as a chance to show off what they&#x2019;ve done. We included a graded final exam, and those who pass will receive a Certificate of Completion.","link":"https://www.cockroachlabs.com/blog/introducing-cockroach-university/","owner":"CockroachDB"},{"title":"MapTiler in Swiss TV News","description":"\n          <img src=\"https://www.maptiler.com/media/2019-11-20-maptiler-in-swiss-tv-news-1.jpg\"\n          alt=\"Thumb\">\n          <p>Swiss National TV (SRF1 channel) broadcasted a short report about 50 years of Swiss cartography and MapTiler appeared in the main Friday news (Tagesshau) at a prime time!</p>\n\n<p>We were selected as experts in the digital cartography - and provided a short interview in the spot related to the 50th anniversary of the <a href=\"https://kartografie.ch/\">Swiss Cartographic Society (SGK)</a>, who has given our team the <a href=\"https://www.maptiler.com/blog/2018/04/swiss-society-of-cartography-and-the-prix-carto-award.html\">PrixCarto Digital prize</a> in the previous bi-annual period.</p>\n\n<p>We are truly honored to be awarded for innovating the map-making here in Switzerland.</p>\n\n<p>See the TV report online on the <a href=\"https://maptiler.link/2r1L8s9\">SRF1 website</a>.</p>\n","link":"https://www.maptiler.com/news/2019/11/maptiler-in-swiss-tv-news/","owner":"MapTiler"},{"title":"On Flutter – For Anyone Curious but Unconvinced","description":null,"link":"https://binary-studio.com/2019/11/20/flutter/","owner":"Binary Studio"},{"title":"prox part 1 — type level programming in Scala","description":"","link":"https://engineering.prezi.com/prox-part-1-type-level-programming-in-scala-47d4b5c32df9?source=rss----911e72786e31---4","owner":"Prezi"},{"title":"Take the legwork out of API Gateway troubleshooting","description":"Tag your Lambdas to track errors and debug serverless applications. If you’re using NodeJS or Python, we’ll help you find even the trickiest serverless application errors faster.","link":"https://serverless.com/blog/api-gateway-troubleshooting/","owner":"Serverless"}]