[{"title":"2019 Year in Review","description":"<p>Another year has come and gone. 2019 was a pretty wild year for me, with a number of big life events and transformations like I haven&#39;t had in a long time. It was also a year in which I confronted my inner life more earnestly, which is something I had only started to do in 2018.</p>\n\n<p>Here&#39;s a review of my 2019.</p>\n\n<h3 id=\"my-business-almost-doubled\">My Business (Almost) Doubled</h3>\n\n<p><span class='marginnote'><img class='fullwidth' src='/assets/img/posts/IMG_4533.JPG'/><br>Presenting at RubyKaigi</span></p>\n\n<p>So, I&#39;ll start with the big bang, the thing I&#39;m most proud of. My freelancing - a combination of book sales, client work, and workshops - doubled in top-line revenue this year. Expenses were a lot higher too, but I&#39;m still taking home a lot more than I was last year.</p>\n\n<p>Despite being in the self-employed business for almost 5 years now, this is probably the first year in which I made as much or more money than I would have at a corporate job. S","link":"https://www.nateberkopec.com/blog/2019/12/17/year-in-review.html","owner":"NSHipster"},{"title":"How Education First Increased Developer Efficiency with CockroachCloud","description":"An often overlooked privilege of building database technology is the opportunity to team up with companies that are making a positive impact in the world. For Cockroach Labs, EF (Education First)is one of those companies. Since 1965, Education First has offered a range of educational programs including study abroad, student exchange, educational travel courses and language classes; all in an effort to &quot;open the world through education.&quot; Currently, Education First has 612 offices and schools in over 50 different countries.","link":"https://www.cockroachlabs.com/blog/education-first/","owner":"Cloudflare"},{"title":"On the packaging of ideas","description":"<p>Lately, I&#39;ve been thinking about the importance of how ideas are packaged, and the effect this has on persuading the intended audience of the idea. Mostly this was due to the <a href=\"https://www.wnycstudios.org/podcasts/dolly-partons-america\">Dolly Parton&#39;s America podcast</a> telling the story about how Dolly Parton&#39;s involvement in the 9 to 5 movie and soundtrack supported the feminist movement of the 80&#39;s, while Dolly Parton is a country singer that does not identify as a feminist. Despite that, her soundtrack (and the movie itself), expresses feminist, left-wing ideas.</p>\n\n<p><span class='marginnote'><img class='fullwidth' src='/assets/img/posts/9-to-5.jpg'/><br>What a way to make a livin&#39;.</span></p>\n\n<p>Idea packaging is comprised of a number of related elements:</p>\n\n<ul>\n<li>Frame</li>\n<li>Medium</li>\n<li>Identity cues</li>\n</ul>\n\n<p>Idea packaging is important because the same idea presented with different packaging can be received and responded to ver","link":"https://www.nateberkopec.com/blog/2019/12/17/idea-packaging.html","owner":"NSHipster"},{"title":"Your data on a map without coding","description":"\n          <img src=\"https://www.maptiler.com/media/2019-12-17-custom-data-on-a-map-without-coding-1.png\"\n          alt=\"Thumb\">\n          <p>The position of your shop in the city, hiking trails with related points of interest, electric power grid or any other vector data can be easily displayed on a map with a few clicks.</p>\n\n<p>Let’s have a look at how to import your existing files or draw points or tracks manually, add these data into a map of your choice and then embed such a map into your blog or website - without any programming at all.</p>\n\n<h2 id=\"online-editor-for-points-lines-polygons\">Online editor for points, lines &amp; polygons</h2>\n<p>The <a href=\"https://cloud.maptiler.com/data/new/\">Vector Data Editor</a> in MapTiler Cloud allows you to create or edit your basic vector data. It is possible to start drawing your dataset or upload existing files in the following formats: .geojson, .gpkg, .gpx, .kml, .shp, .zip shapefile.</p>\n\n<p>You can add points, lines, and polygons, ","link":"https://www.maptiler.com/news/2019/12/custom-data-on-a-map-without-coding/","owner":"Mandrill"}]