[{"title":"Introducing the Flatcar Linux Edge Channel","description":"Today, Kinvolk is making available a new channel to Flatcar Linux , Flatcar Linux Edge. This channel serves to deliver experimental Linux OS technologies to the Kubernetes developer community in an easily accessible manner. The goal is to accelerate the adoption of cutting-edge Linux technologies in Kubernetes and related projects.\nBackground First announced just over a year ago, Flatcar Linux is Kinvolk’s drop in replacement for CoreOS’ Container Linux. There were two main reasons we decided to initiate the fork.","link":"/blog/2019/05/introducing-the-flatcar-linux-edge-channel/","owner":"King"},{"title":"Luigi the 10x Plumber: Containerizing & Scaling Luigi in Kubernetes","description":"Here at GIPHY, we love data. We love it because it lets us make data-driven decisions that improve the quality of results our users get from our search engine. The more search traffic on GIPHY, the more insight we have into what’s popular and trending. We use these insights/signals to fine-tune search results we serve […]","link":"https://engineering.giphy.com/luigi-the-10x-plumber-containerizing-scaling-luigi-in-kubernetes/","owner":"Gilt"},{"title":"Password Hashing and JWTs for NativeScript Apps with an Express.js Backend","description":"\n                    <p>When building an application that allows users to have accounts, you have to ensure that access to these accounts is secure. When building a user account system, an important factor to keep in mind is how passwords are stored. Storing passwords as plain text is a complete rookie move that leaves your users vulnerable to all sorts of data breaches.</p>\n<p>The best way to protect passwords is to employ <a href=\"https://crackstation.net/hashing-security.htm\">hashing and salting</a> and in this tutorial, we&rsquo;ll show you exactly how to do this. We&rsquo;ll also show you how to generate JSON Web Tokens (JWT) on a Node.js server backend that can be used to authenticate and authorize users, as well as how to store those tokens on the client NativeScript application.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/05/password-hashing-jwts-nativescript-apps-expressjs-backend/'>Password Has","link":"https://www.thepolyglotdeveloper.com/2019/05/password-hashing-jwts-nativescript-apps-expressjs-backend/","owner":"Nelson Elhage"}]