[{"title":"A developer goes to a DevOps conference","description":"As a professional software engineer and enthusiastic pro-am systems administrator, I have long been curious about DevOps. I spent the last two days at PDX DevOpsDays. Across organised talks, Ignite’s, Open Spaces, and as many hallway conversations as I could fit in, here is what I learned about what “DevOps” is and does. DevOps is […]","link":"https://www.darkcoding.net/software/a-developer-goes-to-a-devops-conference/","owner":"Glenn Engstrand"},{"title":"A Shallow Dive Into Distributed Tracing","description":"We at Kinvolk were excited to begin working recently with the amazing team over at LightStep on distributed tracing. I must admit that, while I was aware of the OpenTracing project and knew it was probably kind of important, I did not know a whole lot about the topic when we first started chatting about it at KubeCon in Barcelona.\nSince then, through our engagement with LightStep, I’ve learned a little bit about the topic and I’d love to share some of those learnings.","link":"/blog/2019/09/a-shallow-dive-into-distributed-tracing/","owner":"King"},{"title":"Another Friday has arrived","description":"\n","link":"https://iridakos.com/cats/2019/09/13/another-friday","owner":"Larry Land"},{"title":"From Intern to Full-Time Engineer at Cockroach Labs","description":"Throughout the year, we offer internships at Cockroach Labs to give students opportunities to gain industry experience and work on challenging problems within distributed systems. Bilal Akhtar is a Member of Technical Staff at Cockroach Labs, working on the Core Storage team and toying with KV storage engines. Outside of work, you&#x2019;ll see him reading non-fiction, or giving urban photography a shot.\nIinterned at Cockroach Labs twicewhile in school.","link":"https://www.cockroachlabs.com/blog/from-intern-to-full-time-engineer-at-cockroach-labs/","owner":"Cloudflare"},{"title":"How Clever grows inclusivity for women in engineering","description":null,"link":"https://engineering.clever.com/2019/09/12/how-clever-grows-inclusivity-for-women-in-engineering/","owner":"Chef"},{"title":"Jade to React: using prod validation to make modernization safe, fast, and fun","description":"","link":"https://benchling.engineering/jade-to-react-using-prod-validation-to-make-modernization-safe-fast-and-fun-766258ee8d35?source=rss----3d4aa8fb07ea---4","owner":"BBC"}]