[{"title":"Conflict Resolution and Code Reviews","description":null,"link":"https://ponyfoo.com/articles/conflict-resolution-and-code-reviews","owner":"Pony Foo"},{"title":"How to alias and navigate to directories with autocomplete in Linux","description":"<p>I use the terminal a lot and in my day to day work I tend to navigate to the same bunch of directories.</p>\n\n<p>There are some awesome tools out there (like <a href=\"https://github.com/wting/autojump\">autojump</a> or <a href=\"https://github.com/rupa/z\">z</a>) but sometimes, especially when the directories are similarly named, there is a need <strong>to be explicit</strong> to navigate to the proper one.</p>\n\n<p>I decided to write a script to overcome this issue and to avoid having to edit my <code class=\"highlighter-rouge\">.bash*</code> files to manage <a href=\"http://tldp.org/LDP/abs/html/aliases.html\"><code class=\"highlighter-rouge\">aliases</code></a> each time I wanted to add or remove a directory.</p>\n\n<h2 id=\"goto\">goto</h2>\n\n<p><code class=\"highlighter-rouge\">goto</code> is a shell utility to quickly navigate to aliased directories with autocomplete <em>(tab completion)</em>.</p>\n\n<!-- Place this tag where you want the button to render. -->\n<p><a class=\"btn btn-secondary bg-da","link":"https://iridakos.com/programming/2019/04/10/shell-navigation-with-autocomplete","owner":"Lazarus Lazaridis"},{"title":"My i3 window manager setup","description":"\n<p>I have been a long time <a href=\"https://i3wm.org/\">i3 window manager</a> user. But not really.</p>\n<p>My old <a href=\"https://samsaffron.com/archive/2019/03/31/why-i-stuck-with-windows-for-6-years-while-developing-discourse\">Windows 10</a> based setup involved doing all my console work in an Ubuntu VM running i3. However, the lion’s share of the non console work was still done in Windows, including browsing and more.</p>\n<p>For multiple years now I only partially experienced i3, it showed. My i3 setup was almost vanilla.</p>\n<p>My move to <a href=\"https://www.archlinux.org/\">Arch Linux</a> changed everything.</p>\n<p>This move completely shifted the way I think about my relationship with my desktop environment. Previously, my relationship with Windows was very simplistic. Windows works the way it works,  I simply adapted to that. Sometimes I learned a new shortcut, but the majority of my Windows day-to-day involved dragging windows around, reaching Firefox window and tab saturation","link":"https://samsaffron.com/archive/2019/04/09/my-i3-window-manager-setup","owner":"Sam Saffron"},{"title":"TPDP Episode #26: Game Development With Houdini","description":"\n                    <p>The latest episode of The Polyglot Developer Podcast has been published and it is the first one on the show to be on the topic of game development!</p>\n<p>In episode twenty-six titled, <strong>Game Development with Houdini</strong>, I&rsquo;m joined by <a href=\"https://twitter.com/The_BenMears\">Ben Mears</a> from <a href=\"https://www.sidefx.com/\">SideFX</a>, the company that is responsible for <a href=\"https://www.sidefx.com/products/houdini/\">Houdini</a>.</p>\n<p>In case this is your first time hearing of Houdini, it is a system that allows you to create procedural, node-based workflows, for generating game assets and terrains. Houdini is used in many of the top rated games and significantly reduces parts of the game development time.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/04/tpdp-e26-game-development-houdini/'>TPDP Episode #26: Game Development With Houdini</a> appeared firs","link":"https://www.thepolyglotdeveloper.com/2019/04/tpdp-e26-game-development-houdini/","owner":"Nic Raboy"}]