[{"title":"\"Three Things I Wish I Knew When I Started Designing Languages\"","description":"<p ><a href=\"https://www.infoq.com/presentations/language-design-process\">The transcript of <i >Three Things I Wish I Knew When I Started Designing Languages</i></a>, a talk given by Peter Alvaro somewhere or other, is up at Info Q.</p>\n<p >Peter Alavaro's main research interest is in taming distributed systems. He starts his talk with the provocative thesis, \"In the future, all radical new languages will be domain-specific languages.\"  He talks of the evolution of his ideas about dealing with distributed systems:</p>\n<ol >\n<li >Little interest by designers of programming-language designers in filling huge difficulty of debugging in context of distributed systems;\n<li >PLs often make handling of data somewhat implicit, even with functional programming, which he says is dangerous in distributed programming;\n<li >To talk about the flow of data properly, we need to talk about time;\n<li >Two things that influenced him as a grad student: Jeff Ullman's claim that encapsulation and declarativ","link":"http://lambda-the-ultimate.org/node/5569","owner":"Lambda the Ultimate"},{"title":"Experimenting with the Streams API","description":null,"link":"https://34.220.116.254:80/experimenting-with-the-streams-api/","owner":"Dean Hume"},{"title":"React State: Choose Wisely","description":null,"link":"https://ponyfoo.com/articles/react-state-choose-wisely","owner":"Pony Foo"},{"title":"Where is Data Regulatory Compliance Worth the Cost?","description":"In 2016, LinkedIn chose not to comply with Russia&apos;s requirement for data to be stored locally. As a result, they were kindly blocked from doing business in the country. Facebook and Twitter, on the other hand, both decided that compliance in Russia is worth the effort. Neither has fully met Russia&apos;s requirements but they have shown enough progress to avoid being blocked.\nThis is an example of the kind of decision that data localization laws force companies to make.","link":"https://www.cockroachlabs.com/blog/data-localization-compliance/","owner":"CockroachDB"}]