[{"title":"Commas in big numbers everywhere: An OpenType adventure","description":"<p>My job involves a lot of staring at large numbers, mostly latencies in\nnanoseconds, and picking out magnitudes like microseconds. I noticed\nmyself constantly counting digits in my text editor, in my terminal,\nand in <a href=\"https://jupyter.org/\">Jupyter</a> notebooks in my browser.</p>\n\n","link":"https://blog.janestreet.com/commas-in-big-numbers-everywhere/","owner":"InVision"},{"title":"Mountains","description":"<p>After painting the <a href=\"/painting/2019/10/11/meadow\">meadow with acrylic colors</a>, I bought oil colors which are the ones Bob Ross uses in “The joy of painting” show.\nThis time I followed the <a href=\"https://www.youtube.com/watch?v=kasGRkfkiPM\">episode 10</a> from season 13 of the show, called <strong>“Mountain Summit”</strong>.</p>\n\n<p>I am very satisfied by the outcome but being a beginner, I faced a lot of difficulties and the painting has a number of errors.</p>\n\n<p><img src=\"/assets/images/posts/paintings/mountains/painting.jpg\" alt=\"Mountains - Painting\" /></p>\n\n<h2 id=\"facts\">Facts</h2>\n\n<p>I used</p>\n\n<ul>\n  <li>the wet-on-wet technique</li>\n  <li>oil colors</li>\n  <li>50x80 canvas</li>\n</ul>\n\n<h2 id=\"difficulties\">Difficulties</h2>\n\n<ul>\n  <li>My paintbrushes were not the same as Bob Ross’ ones (size and material) and the paint didn’t apply the way I wanted (I will search for tips and tricks when it comes to buying paintbrushes for oil colors)</li>\n  <li>I couldn’t f","link":"https://iridakos.com/painting/2019/10/14/mountains","owner":"Larry Land"},{"title":"Serverless Deployment Best Practices","description":"Learn some of the best practices when it comes to deploying serverless applications.","link":"https://serverless.com/blog/serverless-deployment-best-practices/","owner":"Sensible"},{"title":"TPDP E32: Getting Familiar with TypeScript for Development","description":"\n                    <p>I&rsquo;m happy to announce that E32 of The Polyglot Developer Podcast is now available for download!</p>\n<p>This episode features Corbin Crutchley, a friend, regular guest, and owner of the blog, <a href=\"https://www.unicorn-utterances.com\">Unicorn Utterances</a>. You might remember Corbin from the episode, <a href=\"https://www.thepolyglotdeveloper.com/2019/07/tpdp-e29-asynchronous-javascript-development/\">Asynchronous JavaScript Development</a>, where we focused on promises, callbacks, and a lot of other asynchronous topics in JavaScript. This time around we&rsquo;re focusing on TypeScript, which is a super-set to JavaScript, and is becoming an increasingly popular development technology.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/10/tpdp-e32-getting-familiar-typescript-development/'>TPDP E32: Getting Familiar with TypeScript for Development</a> appeared first on <a rel='nofoll","link":"https://www.thepolyglotdeveloper.com/2019/10/tpdp-e32-getting-familiar-typescript-development/","owner":"Nelson Elhage"},{"title":"Two kernel mysteries and the most technical talk I've ever seen","description":"If you start digging into Linux kernel internals, like function disassembly and profiling, you may run into two mysteries of kernel engineering, as I did:\n","link":"http://www.brendangregg.com/blog/2019-10-15/kernelrecipes-kernel-ftrace-internals.html","owner":"Brendan Eich"}]