[{"title":"Hash Password Data In MongoDB With Mongoose And Bcrypt","description":"\n                    <p>When creating a web application that handles user information it is a good idea to protect anything considered sensitive rather than storing it as plaintext within a database. The goal is to make it as difficult as possible for a malicious person to obtain access to this sensitive information. Rather than encrypting sensitive information with the knowledge that it can one day become decrypted, it is better to hash this sensitive data instead because hashing is a one-way process.</p>\n<p>In this tutorial we&rsquo;re going to take a look at hashing password data with <a href=\"https://github.com/dcodeIO/bcrypt.js\">bcryptjs</a> before storing it in a <a href=\"https://www.mongodb.com/\">MongoDB</a> NoSQL database with <a href=\"https://mongoosejs.com\">Mongoose</a> and Node.js.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/02/hash-password-data-mongodb-mongoose-bcrypt/'>Hash Password Data In","link":"https://www.thepolyglotdeveloper.com/2019/02/hash-password-data-mongodb-mongoose-bcrypt/","owner":"Nelson Elhage"},{"title":"Lesser Known jOOλ Features: Useful Collectors","description":"jOOλ is our second most popular library. It implements a set of useful extensions to the JDK’s Stream API, which are useful especially when streams are sequential only, which according to our assumptions is how most people use streams in Java. Such extensions include: … and many more. Collectors But that’s not the only thing … ","link":"https://blog.jooq.org/2019/02/11/lesser-known-joo%ce%bb-features-useful-collectors/","owner":"IPFS"},{"title":"Reflecting on The Soul of a New Machine","description":"Long ago as an undergraduate, I found myself back home on a break from school, bored and with eyes wandering idly across a family bookshelf. At school, I had started to find a calling in computing systems, and now in the den, an old book suddenly caught my eye: Tracy Kidder’s The Soul of a [...]","link":"http://dtrace.org/blogs/bmc/2019/02/10/reflecting-on-the-soul-of-a-new-machine/","owner":"Brujo Benavides"}]