[{"title":"Applied Category Theory - The Emerging Science of Compositionality","description":"<p >An enjoyable 25-minute introductory talk: <a href=\"https://www.youtube.com/watch?v=iwvl0tBJhoM\">YOW! Lambda Jam 2019 - Ken Scambler - Applied Category Theory</a> (<a href=\"https://www.slideshare.net/kenbot/applied-category-theory-the-emerging-science-of-compositionality\">slides</a>)</p>\n<blockquote ><p >What do programming, quantum physics, chemistry, neuroscience, systems biology, natural language parsing, causality, network theory, game theory, dynamical systems and database theory have in common?</p>\n<p >As functional programmers, we know how useful category theory can be for our work - or perhaps how abstruse and distant it can seem. What is less well known is that applying category theory to the real world is an exciting field of study that has really taken off in just the last few years. It turns out that we share something big with other fields and industries - we want to make big things out of little things without everything going to hell! The key is compositionality, the ","link":"http://lambda-the-ultimate.org/node/5581","owner":"Kyle Kingsbury"},{"title":"Execute HTTP Requests in JavaScript Applications","description":"\n                    <p>When it comes to modern application development, whether that be web, mobile, or other, there is almost always a need interact with remote web services, generally through HTTP. When working with frameworks such as Angular, Vue, and React, there is baked in functionality for making requests, but what about if you&rsquo;re using vanilla JavaScript or you&rsquo;d prefer not to use those built in functionalities?</p>\n<p>In this tutorial we&rsquo;re going to explore a few options towards making HTTP requests in JavaScript. Particularly we&rsquo;re going to focus on the classic XHR request, using a modern JavaScript Fetch, as well as using a third-party package called Axios.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/08/execute-http-requests-javascript-applications/'>Execute HTTP Requests in JavaScript Applications</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotde","link":"https://www.thepolyglotdeveloper.com/2019/08/execute-http-requests-javascript-applications/","owner":"Nelson Elhage"},{"title":"How to fix Certificate does not match supplied signing thumbprint","description":"Many developers have recently reported seeing the following error message when they try to compile their UWP projects: “Certificate does not match supplied signing thumbprint: xxxxx”. Full error message: 1>C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Professional\\MSBuild\\Microsoft\\VisualStudio\\v16.0\\AppxPackage\\Microsoft.AppXPackage.Targets(821,5): error : Certificate does not match supplied signing thumbprint: 5969de9ae710abeaf66c5d5182ee776c83689dbce Reason The problem with the inability to compile the project is due to a mismatch between the real thumbprint of the certificate (.pfx) and the corresponding value stored in the project file (.csproj, .vbproj or .vcxproj)....","link":"https://www.rudyhuyn.com/blog/2019/08/05/how-to-fix-certificate-does-not-match-supplied-signing-thumbprint/","owner":"Robin Wilson"},{"title":"WotLK or Wrath choice?","description":"Hey everyone, I’m looking for the best choice for me in terms of WotLK. Ideally I’d go for a server still in its progression infancy but alas, no such luck, everyone’s at ICC. So I slimmed down my choices do Dalaran-wow and Wow-Mania, they both seem to have similar population levels but I’m not familiar […]","link":"https://datchley.name/wotlk-or-wrath-choice/","owner":"Daniel Schmidt"}]