[{"title":"Adaptive Throttling of Indexing for Improved Query Responsiveness","description":"","link":"https://medium.com/myntra-engineering/adaptive-throttling-of-indexing-for-improved-query-responsiveness-b3ac949e76c9?source=rss----7484818e9f88---4","owner":"Mozilla Release Engineering"},{"title":"How a global e-lock manufacturer modernized their IAM system with Managed CockroachDB","description":"A global electronic lock company wanted to upgrade their identity access management (IAM) system to achieve global scale with no manual sharding. They wanted to move away from sharding and evolve the app&#x2019;s architecture from monolithic to microservices. With no in-house site reliability team, they started evaluating database-as-a-service (DBaaS) products. Their requirements included:&#xA0;\nData domiciling:The manufacturer has customers across Europe, Asia, and North America, and they needed to ensure European customer data remained in Europe in order to remain compliant with the General Data Protection Regulation (GDPR).","link":"https://www.cockroachlabs.com/blog/identity-access-management-case-study/","owner":"Cloudflare"},{"title":"Solving Remote Build Cache Misses by Annoying Your Colleagues","description":"This is part two in a series about solving Gradle remote build cache misses. Solving build cache misses is important to both avoid work that…","link":"https://developers.soundcloud.com/blog/gradle-remote-build-cache-misses-part-2","owner":"Soshace"},{"title":"The Round","description":"October 3rd, 2019 @ 26 Bridge, Brooklyn NY Come see us at The Round NYC on October 3rd where we’ll be participating in a panel, sharing what it’s like to work at GIPHY Engineering and chatting with candidates about opportunities to join the team! The event is completely free. You can find more info and […]","link":"https://engineering.giphy.com/the-round/","owner":"Gilt"},{"title":"Traditional Agile is now missing the point","description":null,"link":"https://elegantcode.com/2019/10/01/traditional-agile-is-now-missing-the-point/","owner":"Edward Faulkner"},{"title":"Zero Configuration Monitoring and Alerts now available for serverless Python apps","description":"We are adding support for Python to the Serverless Framework Dashboard to enable monitoring, alerts, and much more for your Python serverless applications.","link":"https://serverless.com/blog/aws-lambda-python-monitoring/","owner":"Sensible"}]