[{"title":"Chaining JavaScript Promises While Sharing Parent Data","description":"\n                    <p>Typically when I&rsquo;m working with RESTful APIs, the routes or endpoints return what I need, plus more, which would be too much data. However, recently I ended up working with an API where the responses were rather trim, resulting in the need to use many HTTP requests to various endpoints, rather than getting everything in a single request. To take it a step further, some of those HTTP requests depended on data from other requests creating a mess of asynchronous operations in JavaScript.</p>\n<p>After consulting with my pal, <a href=\"https://www.linkedin.com/in/corbincrutchley/\">Corbin Crutchley</a>, we came up with a solution to what I needed, without creating chaos in my code. Remember, Corbin is a JavaScript professional, as demonstrated on the podcast we recorded together titled, <a href=\"https://www.thepolyglotdeveloper.com/2019/07/tpdp-e29-asynchronous-javascript-development/\">Asynchronous JavaScript Development</a>.</p>\n<p>In this tutorial we&rsquo;re g","link":"https://www.thepolyglotdeveloper.com/2019/07/chaining-javascript-promises-while-sharing-parent-data/","owner":"Nelson Elhage"},{"title":"Getting Started with CockroachDB and Flowable","description":"Last week, our friends at Flowable released Flowable 6.4.2, which officially adds support for CockroachDB. Flowable provides a workflow and Business Process Management (BPM) platform for developers, system admins and business users, and now integrates with CockroachDB in just a few steps, thanks to a recent collaboration. Cockroach Labs and Flowable engineers have been teaming up since the early stages of CockroachDB because it makes deploying Flowable that much easier.","link":"https://www.cockroachlabs.com/blog/cockroachdb-and-flowable/","owner":"Cloudflare"},{"title":"How PubNative is Saving 30% on Infrastructure Costs with Kinvolk, Packet, and Kubernetes","description":"Earlier this year, mobile advertising technology leader PubNative approached Kinvolk with an interesting challenge: rapid business growth meant their cloud bill was also growing rapidly. Leveraging Packet’s bare metal cloud locations around the globe, they believed they could benefit from significant cost savings and achieve greater flexibility with a multi-cloud architecture.\nRunning Kubernetes in a bare metal environment was not the same as in AWS, though, and PubNative needed help. Kinvolk brought the technology, expertise and collaborative approach to enable them to successfully migrate their application from Amazon Web Services to Packet, resulting in cost savings of hundreds of thousands of dollars.","link":"/blog/2019/07/how-pubnative-is-saving-30-on-infrastructure-costs-with-kinvolk-packet-and-kubernetes/","owner":"King"},{"title":"How to Fetch All Current Identity Values in Oracle","description":"Oracle 12c has introduced the useful SQL standard IDENTITY feature, which is essentially just syntax sugar for binding a sequence to a column default. We can use it like this: Which produces COL1 ---- 1 2 3 COL2 ---- 1 For unit testing against our database, we might want to know what “state” our identities … ","link":"https://blog.jooq.org/2019/07/16/how-to-fetch-all-current-identity-values-in-oracle/","owner":"IPFS"}]