[{"title":"CakePHP and Heroku","description":"I was impressed with how straight forward it is to set up CakePHP apps on Heroku (or probably any Cloud solution probably). And it is free here for basic applications, especially for trying it out. Prepare your app Your application...","link":"https://www.dereuromark.de/2019/12/27/cakephp-and-heroku/","owner":"Dennis Yurichev"},{"title":"Change the Host File of an Android Emulator","description":"\n                    <p>While working on a bug in one of my projects recently, I found an issue that I could only recreate on an Android device. However, due to some cross-origin resource sharing (CORS) issues on my server, I had to serve my development environment from a changed hostfile that had a specific subdomain of my project.</p>\n<p>With the ability to use a remote Chrome debugger from your desktop to a mobile device, you can use an emulator and still have your full Chrome debugging capabilities. The only problem then, is how to get the host file to match your desktop environment. Following these steps will allow you to do just that!</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2019/12/change-host-file-android-emulator/'>Change the Host File of an Android Emulator</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    \n    ","link":"https://www.thepolyglotdeveloper.com/2019/12/change-host-file-android-emulator/","owner":"Nelson Elhage"},{"title":"Context API for Vue.js/Nuxt.js applications","description":"","link":"https://engineering.upgrad.com/context-api-for-vue-js-nuxt-js-applications-e4c984508bd1?source=rss----c08812b771e6---4","owner":"Upday"},{"title":"Skills and tools that will not get you a new job","description":"\n<div class=\"paragraph\">\n<p>On almost every job interview there are questions about frameworks, programming principles, maybe some coding or whiteboard architecting.\nOn the other side, there is the way you work. Tools and skills you use on a daily basis which define how you work.\nNo one really asks about those things but I find them quite important.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/201912/skills-and-tools/\">Read more</a></p>","link":"https://blog.pchudzik.com/201912/skills-and-tools/","owner":"Paul Lewis"}]