[{"title":"Shipping Quickly with a Large Team","description":"<p>On the Payments team, we recently came up against a situation where we need to build a greenfield app, had tight deadlines, and had 7 engineers available. Amazing! there are 7 engineers available!… now how can we work effectively?</p>\n\n<p>Should we adhere to the <a href=\"http://blog.idonethis.com/two-pizza-team/\">two pizza rule</a>, where a team should not be larger than what two pizzas can feed? This is backed by science and is a great rule to follow. However, if we followed it, our team size would be 2-3, maybe 4 if we’re not very hungry that day. So we stepped back and thought about how we can meet the requirements and deliver this quickly, effectively, and have all 7 engineers contributing.</p>\n\n<p>We shipped the product on time with all 7 engineers contributing. These were some techniques we used.</p>\n\n<h2 id=\"design-an-architecture\">Design an Architecture</h2>\n<p>We needed a dashboard where users could login and perform specific money movement operations. The architecture shou","link":"https://deliveroo.engineering/2019/03/26/shipping-quickly-with-a-large-team.html","owner":"DeferPanic"},{"title":"Ten Commandments of Egoless Programming Still Relevant Today","description":null,"link":"https://www.ctl.io/developers/blog/post/10-commandments-for-developers","owner":"Capgemini"},{"title":"The Action Pattern: Clean, Obvious, Testable Code","description":null,"link":"https://ponyfoo.com/articles/action-pattern-clean-obvious-testable-code","owner":"Philipp Oppermann"},{"title":"The Cost of Useless Surrogate Keys in Relationship Tables","description":"What’s a good natural key? This is a very difficult question for most entities when you design your schema. In some rare cases, there seems to be an “obvious” candidate, such as a variety of ISO standards, including: ISO 639 language codes ISO 3166 country codes ISO 4217 currency codes But even in those cases, … ","link":"https://blog.jooq.org/2019/03/26/the-cost-of-useless-surrogate-keys-in-relationship-tables/","owner":"IPFS"}]