[{"title":"Hypothesis Testing in Production","description":"<p>At Remind we have built a robust communication platform that makes it easy for educators, students, and parents to work together. Our users use Remind to keep classes organized, to help each other with school assignments, and to send out announcements for school events. Given these important use cases, users depend on Remind to deliver out their messages on time and reliably. As we scale, grow and change our systems to support all our users and meet their expectations, issues are bound to happen. When issues do happen, it is critical to identify and resolve them quickly to reduce the impact on our users. Throughout the years, we have developed techniques and common patterns that are useful when fixing issues. In this post, we’ll walk through a process of using hypothesis testing to guide us in fixing an issue.</p>\n\n<h2 id=\"an-overview-of-our-architecture\">An overview of our architecture</h2>\n\n<p><img src=\"https://prod-remind-com-devbuckets-engblogimagebucket-9c8ee3y4wppb.s3.amazonaw","link":"http://engineering.remind.com/hypothesis-testing-in-production/","owner":"Remind"},{"title":"Modules Part 03: Minimal Version Selection","description":"Series Index Why and What\nProjects, Dependencies and Gopls\nMinimal Version Selection\nMirrors, Checksums and Athens\nGopls Improvements\nVendoring\nIntroduction Every dependency management solution has to solve the problem of picking a version of a dependency. Many of the version selection algorithms that exist today attempt to identify the “latest greatest” version of any dependency. This makes sense if you believe semantic versioning will be applied correctly and the social contract will be respected.","link":"https://www.ardanlabs.com/blog/2019/12/modules-03-minimal-version-selection.html","owner":"William Kennedy"},{"title":"Three Wingifighters at the BountyCon","description":"On March 29th, 2019, our team members Ankit Jain, Dheeraj Joshi and I had the privilege to attend a very exclusive event called BountyCon in…","link":"https://engineering.wingify.com//posts/three-wingifighters-at-the-bountycon/","owner":"Wingify"},{"title":"Vanilla WoW Addons","description":"So you’ve just rolled a brand new char. How much time do you spend sorting out the addons? Are you one of the people who prefer to use the basic blizzard ui or are you one of the people who spend days making your interface perfect? At what stage do you set up the addons […]","link":"https://datchley.name/vanilla-wow-addons/","owner":"Dave Atchley"}]