[{"title":"Managing Serverless Multi-Tier Architectures in OpenSooq","description":"The multi-tier application (three-tier, n-tier, etc.) has been a cornerstone architecture pattern for decades. The multi-tier pattern provides good guidelines for you to follow to ensure decoupled and scalable application components that can be separately managed and maintained (often by distinct teams). Multi-tiered applications are often built using a service-oriented architecture (SOA) approach to using web services. In this approach, the network acts as the boundary between tiers. We show how we design multi-tiered architectures for popular patterns such as microservices, mobile backends, and our website. Architects and developers can now use an implementation pattern that reduces the development and operations cycles required to create and operationally manage multi-tiered applications.","link":"https://engineering.opensooq.com/managing-serverless-multi-tier-architectures-in-opensooq/","owner":"Opensooq"},{"title":"Moving to Dart from C++","description":"\n                    <p>A couple of days ago, while recovering from some flu, I managed to catch up a bit of me reading. If you know anything about the life of an independent contractor, you&rsquo;d know that there&rsquo;s never time for your personal projects or hobbies, so this was a most welcome break.</p>\n<p>One of my favorite blogs is this one and I saw a great article on <a href=\"https://www.thepolyglotdeveloper.com/2019/04/sort-vector-integers-quicksort-algorithm-cpp/\">Sorting vectors in C++</a> by Nic Raboy.  As it happens, C++ is one of my first commercial languages and I still make some moderate use of it for various mobile projects.</p>\n<p>One thing that struck me, as I read the code, was how close this was to the <a href=\"https://www.dartlang.org/\">Dart</a> programming language.  I&rsquo;ve been doing a lot of Flutter development of late, and have been making more use of the Dart programming language.  Mobile applications often contain complex logic, and this is where Dart ","link":"https://www.thepolyglotdeveloper.com/2019/06/moving-to-dart-from-cpp/","owner":"Nic Raboy"}]