[{"title":"Bringing Personalized Search to Etsy","description":"The Etsy marketplace brings together shoppers and independent sellers from all over the world. Our unconventional inventory presents unique challenges for product search, given that many of our listings fall outside of standard e-commerce categories. With more than 80 million listings and 3.7 million sellers, Etsy relies on machine learning to help users browse creative, […]","link":"https://codeascraft.com/2020/10/29/bringing-personalized-search-to-etsy/","owner":"Erlang Solutions"},{"title":"Meet the 2020 Safety Engineering Interns: COVID Edition","description":null,"link":"https://eng.uber.com/safety-engineering-interns-2020/","owner":"Twitch"},{"title":"Provisioning Flatcar Container Linux with Tinkerbell","description":"While much of the world&rsquo;s computing has moved to virtual machines running in the cloud, there are still many reasons why users want to deploy their workloads on bare metal servers. But provisioning and managing physical servers has historically been a manual and resource-intensive process.\nIt doesn&rsquo;t have to be that way, though - once an oxymoron, the concept of &ldquo;bare metal cloud&rdquo; has been made possible by technologies for booting from the network, together with API-driven control planes for managing server and network configurations.","link":"/blog/2020/10/provisioning-flatcar-container-linux-with-tinkerbell/","owner":"King"},{"title":"Testing JavaScript applications with confidence","description":"","link":"https://techblog.commercetools.com/testing-javascript-applications-with-confidence-ff539c4a25f2?source=rss----d3d69d818e3d---4","owner":"Collective Idea"},{"title":"The VSTO startup sequence","description":"Earlier this week I was looking for an old photo, and while browsing I came across a photo I took of my whiteboard in my office at Microsoft in 2004. Or rather, it was two photos; I’ve crudely stitched them … ","link":"https://ericlippert.com/2020/10/29/the-vsto-startup-sequence/","owner":"Eric Elliot"}]