[{"title":"Capture and analyze NDK crashes with backtrace-unity 3.1","description":null,"link":"https://backtrace.io/blog/announcements/unityndkcrashes/","owner":"Babbel"},{"title":"Detect when node_modules are out of sync","description":"<div class=\"article-intro\">\r\n    I&rsquo;m pretty sure this already happened to you as well. You pull down the latest <code>main</code> branch or jump to some feature branch and you start getting weird errors. Until only later you recognize you forgot to execute an <code>npm install</code>. Let&rsquo;s look into how we can avoid that.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/Euh3uDjlLq8\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/Euh3uDjlLq8/","owner":"Justin Weiss"},{"title":"Include Touch, Cursor, and Gesture Events in a Phaser Game","description":"\n                    <p>So you&rsquo;re at a point in your game where you need to allow the player to interact with the game. While keyboard events are common in a lot of games, they aren&rsquo;t the only way to interact, and they may not even be the best way to interact if you&rsquo;re planning on taking your game into a mobile setting.</p>\n<p>An alternative to using keystrokes to interact with your game is to use pointer events. Events that involve a pointer could include the clicking or movement of a mouse, a tapping of a finger, or a swiping gesture event with either.</p>\n<p>In this tutorial, we&rsquo;re going to see how to interact with a <a href=\"http://phaser.io/\">Phaser</a> 3.x game, not with a keyboard, but with your finger on the screen or with your mouse.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/09/include-touch-cursor-gesture-events-phaser-game/'>Include Touch, Cursor, and Gesture Events i","link":"https://www.thepolyglotdeveloper.com/2020/09/include-touch-cursor-gesture-events-phaser-game/","owner":"Nelson Elhage"},{"title":"Some of git internals (updated)","description":"Some of git internals (updated)","link":"https://yurichev.com/news/20201220_git/","owner":"Dennis Felsing"}]