[{"title":"Announcing Our Market Prediction Kaggle Competition","description":"<p>Jane Street is running a Kaggle contest based on a real problem with\nreal financial data. If you like ML projects, or think you might,\n<a href=\"https://www.kaggle.com/c/jane-street-market-prediction\" target=\"_blank\">head over and check it\nout</a>.\nWe think it’s a pretty fun one. The prizes are pretty good too, with a\ntotal $100K being paid out.</p>\n\n","link":"https://blog.janestreet.com/announcing-our-market-prediction-kaggle-competition-index/","owner":"InVision"},{"title":"Horovod v0.21: Optimizing Network Utilization with Local Gradient Aggregation and Grouped Allreduce","description":null,"link":"https://eng.uber.com/horovod-v0-21/","owner":"Twitch"},{"title":"Installing PHP extensions without pecl in PHP 8 Docker images","description":"UPDATE: Since this was published, PR 1087 has been raised and merged with restores pecl to the Docker PHP 8 images. I discovered recently that pecl is no longer shipped in the PHP Docker images for PHP 8. This appears to be related to the deprecation of --with-pear in PHP core as noted in issue 1029. Consider this Dockerfile: FROM php:8.0.0RC5-cli-buster RUN pecl install mongodb && docker-php-ext-enable mongodb If you build, you'll discover the pecl… ","link":"https://akrabat.com/installing-php-extensions-without-pecl-in-php-8-docker-images/","owner":"Regular Geek"},{"title":"P² quantile estimator: estimating the median without storing values","description":"<p>Imagine that you are implementing performance telemetry in your application.\nThere is an operation that is executed millions of times, and you want to get its &ldquo;average&rdquo; duration.\nIt&rsquo;s not a good idea to use the arithmetic mean because the obtained value can be easily spoiled by outliers.\nIt&rsquo;s much better to use the median which is one of the most robust ways to describe the average.</p>\n<p>The straightforward median estimation approach requires storing all the values.\nIn our case, it&rsquo;s a bad idea to keep all the values because it will significantly increase the memory footprint.\nSuch telemetry is harmful because it may become a new bottleneck instead of monitoring the actual performance.</p>\n<p>Another way to get the median value is to use a sequential quantile estimator\n(also known as an online quantile estimator or a streaming quantile estimator).\nThis is an algorithm that allows calculating the median value (or any other quantile value)\nusing a fixed","link":"https://aakinshin.net/posts/p2-quantile-estimator/","owner":"Andrew Ray"},{"title":"Sending and Requesting Data from MongoDB in a Unity Game","description":"\n                    <p>Are you working on a game in <a href=\"https://unity.com/\">Unity</a> and finding yourself needing to make use of a database in the cloud? Storing your data locally works for a lot of games, but there are many gaming scenarios where you&rsquo;d need to leverage an external database. Maybe you need to submit your high score for a leaderboard, or maybe you need to save your player stats and inventory so you can play on numerous devices. There are too many reasons to list as to why a remote database might make sense for your game.</p>\n<p>If you&rsquo;ve been keeping up with the content publishing on the <a href=\"https://developer.mongodb.com/\">MongoDB Developer Hub</a> and our <a href=\"https://www.twitch.tv/mongodb\">Twitch</a> channel, you&rsquo;ll know that I&rsquo;m working on a game development series with <a href=\"https://www.twitter.com/adriennetacke\">Adrienne Tacke</a>. This series is centered around creating a 2D multiplayer game with Unity that uses MongoDB a","link":"https://www.thepolyglotdeveloper.com/2020/11/sending-requesting-data-mongodb-unity-game/","owner":"Nelson Elhage"},{"title":"Thanking CockroachDB's Open Source Contributors","description":"CockroachDB was conceived as open source software, and we are proud that CockroachDB remains open source to this day. Throughout our journey, our community has made valuable contributions to our product. Over the course of our existence, we have had over 1590 commits from over 320 external contributors across all our open source repositories. Today, we want to thank all our wonderful external contributors.\nIn this blog post, we celebrate open source contributions across the CockroachDB repositories, with a glimpse of how we manage contributions to our own repo.","link":"https://www.cockroachlabs.com/blog/thanking-cockroachdbs-external-contributors/","owner":"Cloudflare"}]