[{"title":"[Unix] Tracking changes on web1.0-style websites","description":"[Unix] Tracking changes on web1.0-style websites","link":"https://yurichev.com/news/20210105_web_updates/","owner":"Dennis Felsing"},{"title":"A Field Guide to Unit Testing: Maintainability","description":"","link":"https://tech.pic-collage.com/a-field-guide-to-unit-testing-maintainability-501427112db9?source=rss----3819a69148cb---4","owner":"Periscope Data"},{"title":"Announcing Flatcar Container Linux Pro for Microsoft Azure","description":"With the success of Flatcar Container Linux on Microsoft Azure Marketplace, we’ve seen hundreds of millions of usage hours since it was made available just a few months ago. Today, we are announcing Kinvolk’s new offering called Flatcar Container Linux Pro for Azure.\nAvailable in the Azure Marketplace , the Pro edition of Flatcar Container Linux is the result of a close collaboration with our friends in the Azure compute team, and includes:","link":"/blog/2020/10/announcing-flatcar-container-linux-pro-for-microsoft-azure/","owner":"King"},{"title":"DASH: Four Properties of Kubernetes-Native Databases","description":"``` Cloud-native application architectures help developers deliver amazing experiences to their customers around the world. They do this by taking advantage of billions in cloud provider investments, which provide nearly unlimited and on-demand resources spread across hundreds of data centers globally.\n``` Kubernetes &#x2013; the Google-built open source container orchestration system &#x2013; is quickly becoming a ubiquitous tool for deploying, running, and scaling these applications. Kubernetes simplifies and supercharges application delivery if (and this is a big &#x201C;if&#x201D;) those applications are architected to take advantage of the resources available in cloud environments.","link":"https://www.cockroachlabs.com/blog/dash-kubernetes-native-database/","owner":"Cloudflare"},{"title":"Improving our design system through Dark Mode","description":"Etsy recently launched Dark Mode in our iOS and Android buyer apps. Since Dark Mode was introduced system-wide last year in iOS 13 and Android 10, it has quickly become a highly requested feature by our users and an industry standard. Benefits of Dark Mode include reduced eye strain, accessibility improvements, and increased battery life. […]","link":"https://codeascraft.com/2020/10/21/improving-our-design-system-through-dark-mode/","owner":"Erlang Solutions"},{"title":"Intro to Multi-Region Distributed SQL Topologies","description":"CockroachDB is a Distributed SQL database. That means for the person doing the querying, everything looks like the SQL they&#x2019;ve known for years. But under the hood, there&#x2019;s a lot more going on. In order to achieve the bulletproof resiliency and elastic scalability CockroachDB delivers, data is replicated and geographically distributed across nodes of a cluster, and read and write requests are automatically routed between nodes as appropriate. Replication and geo-distribution mean that your nodes have a shape--a topology--and how you design that topology allows you to make important tradeoffs regarding latency and resilience.","link":"https://www.cockroachlabs.com/blog/multi-region-topology-patterns/","owner":"Cloudflare"}]