[{"title":"2019 in technology","description":"","link":"https://devblog.songkick.com/2019-in-technology-b9fe9182b7e2?source=rss----e0e3c74f91b8---4","owner":"Snyk"},{"title":"mmuniq: When Bloom filters don't bloom","description":"","link":"https://idea.popcount.org/2020-03-02-mmuniq-when-bloom-filters-dont-bloom","owner":"Marco Pivetta"},{"title":"SQL DISTINCT is not a function","description":"A very common misconception I often encounter with SQL users is the idea that DISTINCT is something like a function, and that it can take parenthesised arguments. Just recently, I’ve seen this Stack Overflow question where the OP was looking for a way to express this in jOOQ: Notice the parentheses around (emp.id), which look … ","link":"https://blog.jooq.org/2020/03/02/sql-distinct-is-not-a-function/","owner":"IPFS"},{"title":"Test suites as classifiers","description":"Suppose we have some codebase we’re considering applying some patch to, and which has a robust and maintained test suite.\nConsidering the patch, we may ask, is this patch acceptable to apply and deploy. By this we mean to ask if the patch breaks any important functionality, violates any key properties or invariants of the codebase, or would otherwise cause some unacceptable risk or harm. In principle, we can divide all patches into “acceptable” or “unacceptable” relative to some project-specific notion of what we’re willing to allow.","link":"https://blog.nelhage.com/post/test-suites-as-classifiers/","owner":"Natasha Murashev"},{"title":"Vim plugins that I use","description":null,"link":"https://catonmat.net/vim-plugins","owner":"Peter Steinberger"},{"title":"Why We Chose Go","description":"To the outside, trivago appears to be one single software product providing our popular hotel meta search. Behind the scenes, however, it is home to dozens of projects and tools to support it. Teams are encouraged to choose the programming languages and frameworks that will get the job done best. Only few restrictions are placed on the teams in these decisions, primarily long-term maintainability. As a result, trivago has a largely polyglot code base that fosters creativity and diverse thinking.","link":"https://tech.trivago.com/2020/03/02/why-we-chose-go/","owner":"TripAdvisor"}]