[{"title":"5 Things We Learned in Achieving SOC2 Compliance","description":"<p>We achieved SOC2 compliance!  Sharing 5 things we learned.</p>\n<p class=\"poet-read-more\"><a href=\"/blog/5-things-we-learned-in-achieving-soc2\" title=\"Read more of 5 Things We Learned in Achieving SOC2 Compliance\">Continue reading</a></p>","link":"https://mixmax.com/blog/5-things-we-learned-in-achieving-soc2","owner":"Microsoft Python Engineering"},{"title":"Distributed Load Testing with Jmeter","description":"Learn how to distribute and run Jmeter tests along multiple droplets on DigitalOcean using Terraform, Ansible, and bash scripting - to automate the process.","link":"https://blog.risingstack.com/distributed-load-testing-with-jmeter/","owner":"Riot Games"},{"title":"Remind's security stance in action","description":"<p>At Remind, we help educators communicate with millions of students and families. These connections are critical for supporting student learning, especially with school closures this year, and it’s equally important for all of the communications on our platform to be secure, protected, and reliably delivered. As part of our security stance, we engage the security researcher community via a bug bounty program—which is how a recent collaboration with a researcher helped us identify improvements to user safety while maintaining the essential content-sharing function of our platform.</p>\n\n<p>First, some background: Along with messages, the Remind platform allows users to share content—like assignments, flyers, newsletters and other materials and resources—in their classes, schools, and districts. Files are uploaded to Remind and stored in Amazon S3 and served via our Amazon Cloudfront CDN, as is practice for many other companies.</p>\n\n<p>But unlike other platforms, a significant percenta","link":"http://engineering.remind.com/reminds-security-stance-in-action/","owner":"Red Hat"},{"title":"Ten Modern Layouts in One Line of CSS","description":"This post highlights a few powerful lines of CSS that do some serious heavy lifting and help you build robust modern layouts.","link":"https://una.im/1linelayouts/","owner":"T.J. Maher"},{"title":"Why TuneGO Chose CockroachDB over PostgreSQL","description":"Every startup has a choice: Begin building with something familiar (Postgres, MySQL&#x2026;) or begin building with something new (CockroachDB). Using a familiar database means engineers can hit the ground running and begin building on a trustworthy platform. Using a new database will require research, testing, and a period of time for acclimation.&#xA0;\nOn the surface this looks like a simple decision: start building faster with a familiar database. Peel the onion back one more layer and it becomes clear why so many growth-stage companies are deciding to start with CockroachDB rather than Postgres or MySQL.","link":"https://www.cockroachlabs.com/blog/tunego-customer/","owner":"Cloudflare"}]