[{"title":"Book Review - Accelerate: The Science of Lean Software and Devops","description":"During my morning coffee session, I came across the book - Accelerate: The Science of Lean Software and Devops, and the title of the book instantly drew me in.","link":"https://34.220.116.254:80/accelerate-devops-book-review/","owner":"David Walsh"},{"title":"Confluence Server 7.7 beta is available now","description":null,"link":"https://blog.developer.atlassian.com/confluence-server-7-7-beta-is-available-now/","owner":"Asana"},{"title":"How 5G and Public Clouds Will Shape the Future of Global Applications","description":"This past February, before the pandemic was deemed a pandemic and New York City was still humming along, as usual, I sat down at Cockroach Labs HQ to talk about&#xA0;the future of data&#xA0;in application development. It&#x2019;s a broad topic and one that&#x2019;s about to undergo a fundamental and immutable shift. We&#x2019;ll get to why in just a minute.\nIn the three months since that conversation, a lot has changed in the world.","link":"https://www.cockroachlabs.com/blog/5g-global-applications/","owner":"Cloudflare"},{"title":"How to Pick a Metric as the North Star for Algorithms to Optimize Business KPI?  A Causal Inference Approach","description":"How to pick a metric as the north star to guide algorithms for business KPI optimization?  We developed a novel approach, causal meta-mediation analysis (CMMA), to solve it.  This article draws on our published paper in ACM SIGKDD2020.","link":"https://codeascraft.com/2020/08/03/causal-inference-to-pick-north-star-metric-for-algorithms-to-optimize-business-kpi/","owner":"Erlang Solutions"},{"title":"Let's Debug a Node.js Application","description":"<p>There are always challenges when it comes to debugging applications. Node.js' asynchronous workflows add an extra layer of complexity to this arduous process. Although there have been some updates made to the V8 engine in order to easily access asynchronous stack traces, most of the time, we just get errors on the main thread of our applications, which makes debugging a little bit difficult. As well, when our Node.js applications crash, we usually need to <a href=\"https://www.ibm.com/developerworks/library/wa-ibm-node-enterprise-dump-debug-sdk-nodejs-trs/index.html\">rely on some complicated CLI tooling to analyze the core dumps</a>.</p>\n\n<!-- more -->\n\n<p>In this article, we'll take a look at some easier ways to debug your Node.js applications.</p>\n<h2 class=\"anchored\">\n  <a name=\"logging\" href=\"#logging\">Logging</a>\n</h2>\n\n<p>Of course, no developer toolkit is complete without logging. We tend to place <code>console.log</code> statements all over our code in local development, but ","link":"https://blog.heroku.com/debug-node-applications","owner":"HERE"},{"title":"trivago Tech Check-in: Meet Fabian","description":"In our new series, trivago Tech Check-in, we&rsquo;re introducing you to some of our tech talents from across the globe who help keep our metasearch engine running smoothly everyday. In this first edition, you&rsquo;ll meet Fabian Fritzsche, an engineering intern that works on the Microservice-System that feeds our GraphQL API with up-to-date hotel data.","link":"https://tech.trivago.com/2020/08/03/trivago-tech-check-in-meet-fabian/","owner":"TripAdvisor"},{"title":"Uncanny","description":"<p>I’m standing in line at the grocery store. My hands are full of products I don’t recognize but should be sufficient for the next couple days here. I place things on the conveyor belt, hoping the cashier doesn’t ask any questions. Of course, she does. I assume she’s asking if I want a bag and shake my head no. Thankfully, that seemed to answer her question.</p>\r\n\r\n<p>The few items are rung up and she tells me the total. Again, I don’t understand a word. I glance quickly at the screen to see the total and I pull out a bill large enough to cover it. I have a pocket full of change but it’s going to take me forever to figure out which is what and I don’t want to hold up the line any further. I’ll end up leaving all the change at the hotel before I head home. </p>\r\n\r\n<p>I head off into the street, checking my phone to confirm directions back to the hotel.</p>\r\n\r\n<hr />\r\n\r\n<p>I’m standing in line at the grocery store. I’m six feet back, on a marked circle, but shifting forwards and backwar","link":"http://snook.ca/archives/personal/uncanny","owner":"Jonathan Dekhtiar"}]