[{"title":"Bias in word embeddings","description":"","link":"https://blog.acolyer.org/2020/12/08/bias-in-word-embeddings/","owner":"Addy Osmani"},{"title":"Explainable Fraud Detection","description":"Introduction Explainable Artificial Intelligence (XAI) is an emerging field within Machine Learning (ML). There has been considerable advances in the state of the art in recent years. Machine learning models often need to be audited for bias and unfairness. Effectively interpreting the decision of an algorithm is an integral part...  ","link":"https://tech.wayfair.com/2020/12/explainable-fraud-detection/","owner":"Wattpad"},{"title":"Quantile confidence intervals for weighted samples","description":"<p>When you work with non-parametric distributions,\nquantile estimations are essential to get the main distribution properties.\nOnce you get the estimation values, you may be interested in measuring the accuracy of these estimations.\nWithout it, it&rsquo;s hard to understand how trustable the obtained values are.\nOne of the most popular ways to evaluate accuracy is confidence interval estimation.</p>\n<p>Now imagine that you collect some measurements every day.\nEach day you get a small sample of values that is not enough to get the accurate daily quantile estimations.\nHowever, the full time-series over the last several weeks has a decent size.\nYou suspect that past measurements should be similar to today measurements,\nbut you are not 100% sure about it.\nYou feel a temptation to extend the up-to-date sample by the previously collected values,\nbut it may spoil the estimation (e.g., in the case of recent change points or positive/negative trends).</p>\n<p>One of the possible approaches in t","link":"https://aakinshin.net/posts/weighted-quantiles-ci/","owner":"Andrew Ray"},{"title":"The Best Free Monospace Fonts for Developers, Compared","description":"\n            ","link":"https://www.sitepoint.com/html5-svg-cubic-curves/?utm_source=rss","owner":"Sift Science"},{"title":"Towards a Strong Mental Model of Docker","description":"Get a deep understanding of Docker, targeted at web and Mac software engineers","link":"http://blog.andrewray.me/towards-a-strong-mental-model-of-docker/","owner":"Andrew Brampton"}]