[{"title":"8-bit Spirituals","description":"An 8-bit Spiritual (8BS) is a modern program that hearkens back to a time when applications provided a robust experience but fit onto a single floppy disk. Modern apps are bloated by comparison, but there are applications that fit the spirit of the 8-bit days. That said, a modern 8BS should provide a minimal set […]","link":"http://blog.fogus.me/2020/05/20/8-bit-spirituals/","owner":"Mike Ash"},{"title":"Engineering a Better Working Group","description":"To change the culture around testing at Squarespace, we knew it would take \r\nmore than a single team. We started a working group, bringing together both \r\nengineers and non-engineers from across the company to address the problem. \r\nIf you have a cross-organizational issue that needs to be solved, here’s \r\nhow to do it.","link":"https://engineering.squarespace.com/blog/2020/engineering-a-better-working-group","owner":"Square"},{"title":"How ListSeparator Depends on Runtime and Operating System","description":"<p><em>This blog post was <a href=\"https://blog.jetbrains.com/dotnet/2020/05/20/listseparator-depends-runtime-operating-system/\">originally posted</a> on <a href=\"https://blog.jetbrains.com/dotnet/\">JetBrains .NET blog</a>.</em></p>\n<p>In the two previous blog posts from this series, we discussed how socket errors and socket orders depend on the runtime and operating systems. For some, it may be obvious that some things are indeed specific to the operating system or the runtime, but often these issues come as a surprise and are only discovered when running our code on different systems.\nAn interesting example that may bite us at runtime is using <code>ListSeparator</code> in our code. It should give us a common separator for list elements in a string. But is it really common?\nLet&rsquo;s start our investigation by printing <code>ListSeparator</code> for the Russian language:</p>\n<div class=\"highlight\"><pre class=\"chroma\"><code class=\"language-cs\" data-lang=\"cs\"><span class=\"n\">Console<","link":"https://aakinshin.net/posts/how-listseparator-depends-on-runtime-and-operating-system/","owner":"Andrew Ray"},{"title":"Stretch Opportunities for Engineers","description":"Stretch opportunities are tasks or projects that are a bit beyond your current skill or knowledge level and that allow you to improve and…","link":"https://developers.soundcloud.com/blog/stretch-opportunities-for-engineers","owner":"Soshace"}]