[{"title":"How MyMahi Built a Scalable, Serverless Backend using CockroachDB and AWS Lambda","description":"Even before the stay-at-home orders spiked the demand for digital learning platforms, MyMahi was architecting for scale. MyMahi, a New Zealand-based digital education company, built their student platform, which helps 8,000+ monthly active students track their learning journeys, with CockroachDB Core embedded in a technology stack that includes spot instances (e.g., AWS Fargate), serverless functions (e.g., AWS Lambda), and GraphQL (e.g., GraphQL.js, GraphQL Tools). Starting in 2018, MyMahi designed their new application to take advantage of technologies that allow them to scale out seamlessly in response to student activity.","link":"https://www.cockroachlabs.com/blog/mymahi-serverless-lambda/","owner":"Cloudflare"},{"title":"Incident Response at Heroku","description":"<p><em>This post is an update on a <a href=\"https://blog.heroku.com/incident-response-at-heroku\">previous post</a> about how Heroku handles incident response.</em></p>\n\n<p>As a service provider, when things go wrong, you try to get them fixed as quickly as possible. In addition to technical troubleshooting, there’s a lot of coordination and communication that needs to happen in resolving issues with systems like Heroku’s.</p>\n\n<p>At Heroku we’ve codified our practices around these aspects into an incident response framework. Whether you’re just interested in how incident response works at Heroku, or looking to adopt and apply some of these practices for yourself, we hope you find this inside look helpful.</p>\n<h2 class=\"anchored\">\n  <a name=\"incident-response-and-the-incident-commander-role\" href=\"#incident-response-and-the-incident-commander-role\">Incident Response and the Incident Commander Role</a>\n</h2>\n\n<p>We describe Heroku’s incident response framework below. It’s based on the <","link":"https://blog.heroku.com/incident-response-at-heroku-2020","owner":"HERE"},{"title":"Lighthouse: Expectations vs. Reality","description":null,"link":"https://medium.com/engineering-housing/lighthouse-performance-auditing-things-you-should-know-4cbcc4cf6d02?source=rss----3a69e32e2594---4","owner":"Hostinger"}]