[{"title":"Deploying to HatchBox with Rails 5.x","description":"<p class=\"center\"><img src=\"/blog/assets/IMG_4620.jpeg\" alt=\"IMG_4620.jpeg\" /></p>\n\n<p>I just got a database less home page for a future SAAS app deployed via <a href=\"https://www.hatchbox.io/\">HatchBox</a> under Rails 5.x and I thought the differences were significant enough that I should document it.  HatchBox is the best tool I've ever found for Rails deploys but knowing all the steps to follow is key.</p>\n\n<p>elixi: Other than the Rails 5.2 upgrade step, there aren't many differences between this and Rails 6 but it has been long enough since I've done this that writing it down felt right.</p>\n\n<h2 id=\"1-upgrade-rails-to-52x-if-you-dont-have-rails-credentialsedit\">1. Upgrade Rails to \"5.2.x\" if You Don't Have rails credentials:edit</h2>\n\n<p>If your Rails 5 version is old enough that you get this crap:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>❯ rails credentials:edit\nrails aborted!\nDon't know how to build task 'credent","link":"http://fuzzyblog.io/blog/rails/2020/09/14/deploying-to-hatchbox-with-rails-5-x.html","owner":"Scott Hanselman"},{"title":"How to Run a Software as a Service on Kubernetes","description":"The first version of CockroachCloud, our database-as-a-service product, had our users fill out a Google doc with their cloud deployment preferences. We&#x2019;ve come a long way since that initial proof of concept (including, yes, building a UI). More importantly, we&#x2019;ve put implementation patterns in place that make something complicated (like configuring a cloud deployment) scalable. As we&#x2019;ve written about before, choosing to run CockroachCloud on Kubernetes is a huge partof that implementation pattern.","link":"https://www.cockroachlabs.com/blog/kubernetes-saas-implementation/","owner":"Cloudflare"},{"title":"Join InVision CTO Sanjeev Katariya for a talk on developing AI","description":"Hello—InVision CTO Sanjeev Katariya, here. I’d like to invite you to a virtual talk I’m giving for the Arizona Technology Council’s (AZTC) Tech Sector Speaker Series on Tuesday, Sept 15 from 3:30 - 5 p.m. GMT about the experiences organizations face on their AI journey.\nAI is transforming the world, but organizations need to understand the problems, opportunities, and solutions that come with the technology when implemented in the workspace.","link":"https://engineering.invisionapp.com/post/sanjeev-katariya-aztc-talk/","owner":"Intuit"},{"title":"Life, part 35","description":"Last time we implemented what looked like Gosper’s algorithm and got a disappointing result; though the quadtree data structure is elegant and the recursive algorithm is simple, and even though we memoize every operation, the time performance is on par … ","link":"https://ericlippert.com/2020/09/14/life-part-35/","owner":"Eric Elliot"},{"title":"Monitoring Air Quality During Wildfires, in Partnership with PurpleAir","description":"\n          <img src=\"https://www.maptiler.com/media/2020-09-14-monitoring-ari-quality-during-wildfires-in-partnership-with-purpleair-1.png\"\n          alt=\"Thumb\">\n          <p>MapTiler is proud to support <a href=\"https://www.purpleair.com/map?mylocation\">PurpleAir’s map</a> and mission to improve the accessibility of air quality data while making this data open. Such work is critical, especially during times of disaster, such as the massive wildfires witnessed across Australia, Siberia, and currently in the Western United States.</p>\n\n<h2 id=\"citizen-science\">Citizen Science</h2>\n<p>PurpleAir relies on citizen scientists and everyday users to <a href=\"https://www2.purpleair.com/collections/air-quality-sensors\">purchase and install air quality monitoring sensors</a> and publishes real-time air quality data on their map. Over nine thousand sensors are now distributed around the world.</p>\n\n<p><img src=\"https://www.maptiler.com/media/2020-09-14-monitoring-ari-quality-during-wildfires-in-","link":"https://www.maptiler.com/news/2020/09/monitoring-ari-quality-during-wildfires-in-partnership-with-purpleair/","owner":"Mandrill"},{"title":"Software Quality: Elevating the Game","description":null,"link":"https://tech.ebayinc.com/engineering/software-quality-elevating-the-game/","owner":"Dropbox"}]