[{"title":"Built to Last","description":"<p >Mar Hicks. <a href=\"https://logicmag.io/care/built-to-last/\">Built to Last</a>. Logic. Issue 11, \"Care\". </p>\n<blockquote ><p >\nIt was this austerity-driven lack of investment in people—rather than the handy fiction, peddled by state governments, that programmers with obsolete skills retired—that removed COBOL programmers years before this recent crisis. The reality is that there are plenty of new COBOL programmers out there who could do the job. In fact, the majority of people in the COBOL programmers’ Facebook group are twenty-five to thirty-five-years-old, and the number of people being trained to program and maintain COBOL systems globally is only growing. Many people who work with COBOL graduated in the 1990s or 2000s and have spent most of their twenty-first century careers maintaining and programming COBOL systems...</p>\n<p >In this sense, COBOL and its scapegoating show us an important aspect of high tech that few in Silicon Valley, or in government, seem to understand. Old","link":"http://lambda-the-ultimate.org/node/5605","owner":"Lambda the Ultimate"},{"title":"How are App Clips going to save my day?","description":"Here I am, on the streets of Wroclaw. Pandemic lockdown rules have been partially lifted and I can finally go and meet my friend. I don't really wanna use the train, because... well people. So I opt-in for one of those electric scooters.","link":"https://blog.novoda.com/app-clips/","owner":"Novoda"},{"title":"Load Shedding in Clojure","description":"","link":"https://medium.com/helpshift-engineering/load-shedding-in-clojure-d4857ce11588?source=rss----3229f31ca4f4---4","owner":"Helpshift"},{"title":"Pagination Updates on Our API","description":"As part of our efforts to improve our APIs, we’re introducing updates on how we paginate over tracks. This only affects developers and apps…","link":"https://developers.soundcloud.com/blog/pagination-updates-on-our-api","owner":"Soundcloud"},{"title":"Serverless Framework V2","description":"Dropping support for older Node.js versions, to improve security and performance","link":"https://serverless.com/blog/serverless-framework-v2/","owner":"Serverless"}]