[{"title":"Battery Day","description":"\n\n<p>Tesla had its first Battery Day on September 22nd, 2020<sup class=\"footnote-ref\" id=\"fnref:1\"><a href=\"#fn:1\">1</a></sup>. What a fantastic world\nwe live in that we can witness the first Apple-like keynote for batteries.\nBatteries are a part of our everyday life; without them, the world would be\na much different place. Your cellphone, flashlight, tablet, laptops, drones,\ncars, and other devices would not be portable and operational without batteries.</p>\n\n<p>At the heart of it, batteries store chemical energy and convert it into\nelectrical energy. The chemical reaction in a battery involves the flow of\nelectrons from one electrode to another. When a battery is discharging,\nelectrons flow from the electrode known as the anode, or negative electrode, to\nthe electrode known as the cathode, or positive electrode. This flow of\nelectrons provides an electric current that can be used to power devices.\nElectrons have a negative charge; therefore, as the flow of negative electrons\nmoves fr","link":"https://blog.jessfraz.com/post/battery-day/","owner":"Jesal Gadhia"},{"title":"Build a Go App with upper/db and CockroachDB","description":"Today&apos;s blog is a guest post by Jos&#xE9; Nieto, creator of upper/db. upper/db gives you tools for the most common operations with databases, and is now compatible with CockroachDB.\nupper/db is a data access layer written in Go with ORM-like features. It&apos;s compatible with PostgreSQL, MySQL, SQLite, MongoDB, and now, CockroachDB!&#xA0;I am very pleased to announce that our CockroachDB adapter is now in beta and ready to be used!","link":"https://www.cockroachlabs.com/blog/upperdb-cockroachdb/","owner":"Cloudflare"},{"title":"Building an Ad Engine for Grocery","description":"","link":"https://tech.instacart.com/building-an-ad-engine-for-grocery-8d6bb1753831?source=rss----587883b5d2ee---4","owner":"Indeed"},{"title":"Emulate vision deficiencies in DevTools","description":"Emulate vision deficiencies in to see how users who experience color blindness or blurred vision might see your site.","link":"https://addyosmani.com/blog/emulate-vision-deficiencies-devtools/","owner":"Adam Tuliper"},{"title":"Generics Part 03: Struct Types and Data Semantics","description":"Series Index Generics Part 01: Basic Syntax\nGenerics Part 02: Underlying Types\nGenerics Part 03: Struct Types and Data Semantics\nIntroduction In the previous post, I showed you how to declare a user-defined type, based on an underlying type. I did this through the progression of writing different versions of the same type using concrete types, the empty interface and then finally, generics. I also provided information on how the compiler was limited in its ability to infer the substitution for the generic type during zero value construction, but it could with initialized construction.","link":"https://www.ardanlabs.com/blog/2020/09/generics-03-struct-types-and-data-semantics.html","owner":"Wilfred Hughes"},{"title":"Let's talk about the Business of Open Source","description":"Let’s face it, in the open source community, the topic of commercialization is often best avoided. Given a choice, many technology enthusiasts would rather sidestep talking about the dirty business of making money from free software.\nWe at Kinvolk have never shied away from the fact that in order to be able to invest in innovative open source software, we have to make money. However, we are equally clear that we believe in the foundational principles of free software.","link":"/blog/2020/09/lets-talk-about-the-business-of-open-source/","owner":"King"},{"title":"New Cockroach University Course: CockroachDB for Python Developers","description":"Today, we are excited to introduce our second Cockroach Universitycourse: CockroachDB for Python Developers. This course is designed for application developers looking to advance their education with CockroachDB and learn how to build scalable, resilient applications and services.&#xA0;\nSimilar to our inaugural Getting Startedcourse, this free course includes a series of videos, exercises, and a final exam. However, this course is much more hands-on. You will build a full-stack vehicle-sharing application called MovR in Python using the popular SQLAlchemy ORM.","link":"https://www.cockroachlabs.com/blog/cockroachdb-for-python-course/","owner":"Cloudflare"},{"title":"Technology Interns in 2020: General Game Tech & Tooling/Infrastructure","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/114/riotinternsheader.png\" width=\"1640\" height=\"624\" alt=\"\" />\n<p>The Riot <a href=\"https://www.riotgames.com/en/university-programs\" target=\"_blank\">internship program</a> exists to help players drive their professional and personal development. This is the second post in the 2020 intern series - be sure to check out the <a href=\"https://technology.riotgames.com/news/technology-interns-2020-league-legends-tft-valorant\" target=\"_blank\">first post</a> as well.</p>\n","link":"https://technology.riotgames.com/news/technology-interns-2020-general-game-tech-toolinginfrastructure","owner":"Rightscale"},{"title":"Technology Interns in 2020: League of Legends, TFT, & VALORANT","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/113/riotinternsheader.png\" width=\"1640\" height=\"624\" alt=\"\" />\n<p dir=\"ltr\">The Riot <a href=\"https://www.riotgames.com/en/university-programs\" target=\"_blank\">internship program</a> helps technical players drive their professional growth by embedding them on tech teams and having them contribute to impactful, exciting technology projects. Last year we published <a href=\"https://technology.riotgames.com/news/technology-interns-riot-games\" target=\"_blank\">an article by some of our interns</a>, giving readers a glimpse at the projects technical interns get to work on. We’re doing a follow-up this year, but with additional sections to reflect our new games. </p>\n<p dir=\"ltr\">There were so many interns excited to contribute to this article that this year we’ll be doing a 2-part series. Intern stories are sorted into categories - the first post (this one) includes all blurbs for <em>League of Legends","link":"https://technology.riotgames.com/news/technology-interns-2020-league-legends-tft-valorant","owner":"Rightscale"},{"title":"Weighted quantile estimators","description":"<p>In this post, I will show how to calculate weighted quantile estimates and how to use them in practice.</p>\n<p>Let&rsquo;s start with a problem from real life.\nImagine that you measure the total duration of a unit test executed daily on a CI server.\nEvery day you get a single number that corresponds to the test duration from the latest revision for this day:</p>\n<div class=\"row\">\n<div class=\"mx-auto\">\n<a href=\"https://aakinshin.net/posts/weighted-quantiles/img/moving1-light.svg\" target=\"_blank\" class=\"imgldlink\" alt=\"moving1\">\n<picture>\n<source\ntheme='dark'\nsrcset=\"https://aakinshin.net/posts/weighted-quantiles/img/moving1-dark.svg\"\nmedia=\"(prefers-color-scheme: dark)\">\n<source\ntheme='light'\nsrcset=\"https://aakinshin.net/posts/weighted-quantiles/img/moving1-light.svg\"\nmedia=\"(prefers-color-scheme: light), (prefers-color-scheme: no-preference)\">\n<img\nclass=\"mx-auto d-block img-fluid\"\nwidth='600'\nsrc=\"https://aakinshin.net/posts/weighted-quantiles/img/moving1-light.svg\">\n</picture>\n</","link":"https://aakinshin.net/posts/weighted-quantiles/","owner":"Andrew Ray"}]