[{"title":"A Beginner’s Guide to Webpack","description":"\n            ","link":"https://www.sitepoint.com/writing-a-flarum-extension-building-a-custom-field/?utm_source=rss","owner":"SitePoint"},{"title":"Automatically generate requirements.txt for pip","description":null,"link":"http://redino.net/blog/2020/12/5723/?utm_source=rss&utm_medium=rss&utm_campaign=5723","owner":"Redino"},{"title":"Client-Side Field Level Encryption (CSFLE) in MongoDB with Golang","description":"\n                    <p>One of the many great things about MongoDB is how secure you can make your data in it. In addition to network and user-based rules, you have encryption of your data at rest, encryption over the wire, and now recently, client-side encryption known as client-side field level encryption (CSFLE).</p>\n<p>So, what exactly is client-side field level encryption (CSFLE) and how do you use it?</p>\n<p>With field level encryption, you can choose to encrypt certain fields within a document, client-side, while leaving other fields as plain text. This is particularly useful because when viewing a CSFLE document with the <a href=\"https://docs.mongodb.com/manual/mongo/\">CLI</a>, <a href=\"https://www.mongodb.com/products/compass\">Compass</a>, or directly within <a href=\"https://www.mongodb.com/cloud/atlas\">Altas</a>, the encrypted fields will not be human readable. When they are not human readable, if the documents should get into the wrong hands, those fields will be useless to ","link":"https://www.thepolyglotdeveloper.com/2020/12/field-level-encryption-fle-mongodb-golang/","owner":"Nic Raboy"},{"title":"Launching MapTiler Data for self-hosting","description":"\n          <img src=\"https://www.maptiler.com/media/2020-12-18-launching-maptiler-data-for-self-hosting-1.png\"\n          alt=\"Thumb\">\n          <p><a href=\"/data\">MapTiler Data</a> has launched. It provides ready-to-use geographical data of the entire world for your web &amp; mobile applications and the use-cases you have - including on-premise applications.</p>\n\n<h2 id=\"download-data-package-withbasemaps\">Download data package with basemaps</h2>\n<p>To publish interactive maps from your own machine, all you have to do is to download data together with our beautiful map styles for your server software.</p>\n\n<p>Data package includes street, satellite, and terrain data of the entire world to let you build maps for various use-cases. Geodata is regularly updated to bring you a fresh view of the always-changing world.</p>\n\n<p>The best map styles from MapTiler - Streets, Basic, Bright, Topo, and Satellite with labels - are now <strong>available for download</strong>. You can also create your","link":"https://www.maptiler.com/news/2020/12/launching-maptiler-data-for-self-hosting/","owner":"MapTiler"},{"title":"Pairing with Coding Black Females","description":"<p>The Guardian’s Product and Engineering team’s pairing partnership with Coding Black Females</p><p>At the start of July 2020, the Guardian partnered with<a href=\"https://codingblackfemales.com/\"> Coding Black Females</a>, an organisation which aims to provide opportunities, networks and support for black female developers.</p><p>The Guardian’s Diversity &amp; Inclusivity group arranged for volunteers from the Guardian’s Product and Engineering team to pair up with members of Coding Black Females on coding challenges, such as code katas and tech tests.</p><p>Exposure to working with professional engineers at an organisation with a significant technical focus</p><p>Working collaboratively on coding problems</p><p>Receiving guidance on all aspects of life as a software engineer in the workplace</p><p>If you would like to find out more about Coding Black Females, you can visit the <a href=\"https://codingblackfemales.com/\">website</a> and check out the <a href=\"https://codingblackfemales.","link":"https://www.theguardian.com/info/2020/dec/18/pairing-with-coding-black-females","owner":"Guardian"},{"title":"Rex: Medium’s Go Recommendation Microservice","description":"","link":"https://medium.engineering/rex-mediums-go-recommendation-microservice-e077bc9582a?source=rss----2817475205d3---4","owner":"Medium"},{"title":"Uber’s Real-Time Push Platform","description":null,"link":"https://eng.uber.com/real-time-push-platform/","owner":"Uber"}]