[{"title":"Beginner Dart Language Tutorial for JavaScript Developers","description":"Let's learn the Dart language as JS developers: We dive into OOP, classes, inheritance, and mixins, asynchrony, callbacks, async/await and streams. ","link":"https://blog.risingstack.com/learn-dart-language-beginner-tutorial/","owner":"Riot Games"},{"title":"Cockroach Labs + Hacktoberfest: A Celebration of Open Source","description":"Cockroach Labs is proud to participate in DigitalOcean&#x2019;s annual Hacktoberfest, a celebration of open source and community innovation. The month-long event encourages everyone from experienced developers to students and code newbies to make positive contributions to an ever-growing community. All backgrounds and skill levels are encouraged to complete the challenge. Once a hacker submits four high-quality pull requests, they receive a custom t-shirt from DigitalOcean.\nWe&#x2019;ve already seen contributors improve our docs and are thankful for this incredible community.","link":"https://www.cockroachlabs.com/blog/hacktoberfest-2020-open-source/","owner":"Cloudflare"},{"title":"Designing a Strategy to Develop a Game with Unity and MongoDB","description":"\n                    <p>When it comes to game development, you should probably have some ideas written down before you start writing code or generating assets. The same could probably be said about any kind of development, unless of course you&rsquo;re just messing around and learning something new.</p>\n<p>So what should be planned before developing your next game?</p>\n<p>Depending on the type of game, you&rsquo;re probably going to want a playable frontend, otherwise known as the game itself, some kind of backend if you want an online component such as multiplayer, leaderboards, or similar, and then possibly a web-based dashboard to get information at a glance if you&rsquo;re on the operational side of the game and not a player.</p>\n<p><a href=\"https://www.twitter.com/adriennetacke\">Adrienne Tacke</a>, <a href=\"https://www.twitter.com/youoldmaid\">Karen Huaulme</a>, and myself (<a href=\"https://www.nraboy.com/\">Nic Raboy</a>) are in the process of building a game. We think <a href=\"htt","link":"https://www.thepolyglotdeveloper.com/2020/10/designing-strategy-develop-game-unity-mongodb/","owner":"Nelson Elhage"},{"title":"Finding memory leaks with Memtrace","description":"<p>Memory issues can be hard to track down. A function that only\nallocates a few small objects can cause a space leak if it’s called\noften enough and those objects are never collected. Even then, many\nobjects are <em>supposed</em> to be long-lived. How can a tool, armed with data\non allocations and their lifetimes,\nhelp sort out the expected from the suspicious?</p>\n\n","link":"https://blog.janestreet.com/finding-memory-leaks-with-memtrace/","owner":"InVision"},{"title":"Ludwig v0.3 Introduces Hyperparameter Optimization, Transformers and TensorFlow 2 support","description":null,"link":"https://eng.uber.com/ludwig-v0-3/","owner":"Twitch"},{"title":"The median absolute deviation value of the Gumbel distribution","description":"<p>The <a href=\"https://en.wikipedia.org/wiki/Gumbel_distribution\">Gumbel distribution</a> is not only a useful model in the <a href=\"https://en.wikipedia.org/wiki/Extreme_value_theory\">extreme value theory</a>,\nbut it&rsquo;s also a nice example of a slightly right-skewed distribution (skewness <span class=\"math inline\">\\(\\approx 1.14\\)</span>).\nHere is its density plot:</p>\n<div class=\"row\">\n<div class=\"mx-auto\">\n<a href=\"https://aakinshin.net/posts/gumbel-mad/img/gumbel-light.svg\" target=\"_blank\" class=\"imgldlink\" alt=\"gumbel\">\n<picture>\n<source\ntheme='dark'\nsrcset=\"https://aakinshin.net/posts/gumbel-mad/img/gumbel-dark.svg\"\nmedia=\"(prefers-color-scheme: dark)\">\n<source\ntheme='light'\nsrcset=\"https://aakinshin.net/posts/gumbel-mad/img/gumbel-light.svg\"\nmedia=\"(prefers-color-scheme: light), (prefers-color-scheme: no-preference)\">\n<img\nclass=\"mx-auto d-block img-fluid\"\nwidth='600'\nsrc=\"https://aakinshin.net/posts/gumbel-mad/img/gumbel-light.svg\">\n</picture>\n</a>\n</div>\n</div>\n<br />\n<p","link":"https://aakinshin.net/posts/gumbel-mad/","owner":"Andrew Ray"}]