[{"title":"\n\t\t\tIs Zoom's Server Security Just as Vulnerable as the Client Side?\n\t\t","description":"\n\t\t\tMy last several blog posts have been about Zoom security.\nI <a href=\"../2020-04/2020-04-06.html\">concluded</a>\nthat\n<blockquote>\n\tthe architectural problems with Zoom are not serious for\n\tmost people. Most conversations at most universities are\n\tquite safe if carried by Zoom. A small subset might not be\n\tsafe, though, and if you&rsquo;re a defense contractor or a\n\tgovernment agency you might want to think twice, but that\n\tdoesn&rsquo;t apply to most of us.\n</blockquote>\n<p>\nBut I&rsquo;ve been thinking more about\n<a href=\"../2020-04/2020-04-02.html\">this</a> caveat.\n<blockquote>\n\tStill, it&rsquo;s the shortcuts that worry me the most. Those\n\taren&rsquo;t just problems that they can fix, they make me fear\n\tfor the attitudes of the development team towards security.\n\tI&rsquo;m not convinced that they get it&mdash;and that&rsquo;s bad. Fixing\n\tthat is going to require a CISO office with real power, as\n\twell as enough education to make sure that the CISO doesn&rsquo;t\n\thave to exercise","link":"\n\t\t\thttps://www.cs.columbia.edu/~smb/blog/2020-04/2020-04-13.html\n\t\t","owner":"Stephen Colebourne"},{"title":"5 Lessons for Developers to Prevent Zoombombing and Zoom’s Security Blunders","description":null,"link":"https://code.oursky.com/5-lessons-for-developers-to-prevent-zoombombing-zoom-security-blunders/","owner":"OpenTable UK"},{"title":"Collection like objects in python","description":"\n<div class=\"paragraph\">\n<p>Collections are an important part of every programming language.\nIn python, there is a couple of built-in collections like list, set, dictionary but I&#8217;m not going to dig into them now.\nIn this post, I&#8217;ll explore what it takes to implement collection like objects on your own using collections protocol.</p>\n</div>\n<p><a href=\"https://blog.pchudzik.com/202004/python-and-collection-like-objects/\">Read more</a></p>","link":"https://blog.pchudzik.com/202004/python-and-collection-like-objects/","owner":"Paul Lewis"},{"title":"GIPHY SDK: The Grid","description":"A GIF feature in your app can increase engagement and give your users a valuable new way to express themselves, but building it can be hard!  You have to figure out how and where to get the content, design and implement a UI, test, iterate…the list goes on.  That’s why we built the GIPHY SDK, […]","link":"https://engineering.giphy.com/giphy-sdk-the-grid/","owner":"Gilt"},{"title":"On Optimism and Team Engagement in the time of COVID","description":"My guiltiest pleasure right now is watching apocalypse films. It&#x2019;s less escapism than it is catharsis, and there&#x2019;s usually a happy ending (or at the very least---they have an ending).&#xA0;\nWhen you watch these apocalyptic movies, the audience is always focused on the hero, holding the door closed against some encroaching danger. Few people are paying attention to the guy in the corner of the room sitting with others, telling some wild story or caught in the middle of some elaborate joke, trying to get a smile out of people in crisis.","link":"https://www.cockroachlabs.com/blog/covid-team-engagement/","owner":"Cloudflare"}]