[{"title":"A simple way to get more value from tracing","description":"\n\n<p>A lot of people seem to think that distributed tracing isn't useful, or at least not without extreme effort that isn't worth it for companies smaller than FB. For example, <a href=\"https://twitter.com/theatrus/status/1220205677672452097\">here are</a> <a href=\"https://twitter.com/mattklein123/status/1049813546077323264\">a couple of</a> public conversations that sound like a number of private conversations I've had. Sure, there's value somewhere, <a href=\"https://twitter.com/mattklein123/status/1220150248741326855\">but it costs too much to unlock</a>.</p>\n\n<p>I think this overestimates how much work it is to get a lot of value from tracing. At Twitter, Rebecca Isaacs was able to lay out a vision for how to get value from tracing and executed on it (with help from a number other folks, including Jonathan Simms, Yuri Vishnevsky, Ruben Oanta, Dave Rusek, Hamdi Allam, and many others<sup class=\"footnote-ref\" id=\"fnref:O\"><a rel=\"footnote\" href=\"#fn:O\">1</a></sup>) such that the work eas","link":"https://danluu.com/tracing-analytics/","owner":"Daily Tech Video"},{"title":"Nix Package Manager on Ubuntu or Debian","description":"<p>Even though Ubuntu/Debian is equipped with its legendary powerful package manager, <em>dpkg</em>, in some cases, it is still beneficial to take advantage of <a href=\"https://nixos.org/nix\">Nix</a>, a purely functional package manager.</p>\n\n<p>The <a href=\"https://nixos.org/nix/manual\">complete manual</a> of Nix does a fantastic job on explaining how to install and use it. But for the impatients among you, here is a quick overview. Note that this also works well when using Ubuntu/Debian under WSL (<a href=\"https://ubuntu.com/wsl\">Windows Subsystem for Linux</a>, both the original and the newest WSL 2.</p>\n\n<p><img align=\"right\" src=\"https://ariya.io/images/2020/05/nix.png\" width=\"347\" alt=\"Nix on Debian\"/></p>\n\n<p>First, create the <code>/nix</code> directory owned by you (this is the common <a href=\"https://nixos.org/nix/manual/#sect-single-user-installation\">single-user installation</a>):</p>\n\n<pre><code>$ sudo mkdir /nix\n$ sudo chown ariya /nix\n</code></pre>\n\n<p>And then, run the ","link":"https://ariya.io/2020/05/nix-package-manager-on-ubuntu-or-debian","owner":"Ariejan de Vroom"},{"title":"Terminal telekinesis","description":"Tl;dr In my experience, software developers’ skills regarding tasks in a terminal range from desperately slow to impressively swift. I believe that, for a large part, this is caused by an abundance of articles not discussing the real problems software developers are dealing with daily. Namely, how to feel productive on a terminal, after using […]","link":"https://blog.octo.com/en/terminal-telekinesis/","owner":"Nvidia"}]