[{"title":"Designing Edge Gateway, Uber’s API Lifecycle Management Platform","description":null,"link":"https://eng.uber.com/gatewayuberapi/","owner":"Twitch"},{"title":"Generics Part 02: Underlying Types","description":"Changes The draft is a living document which means these posts will need to change over time. This section documents when changes have taken place to this post.\n21/08/20 : Moving forward with the generics design draft\nSeries Index Generics Part 01: Basic Syntax\nGenerics Part 02: Underlying Types\nGenerics Part 03: Struct Types and Data Semantics\nIntroduction In the previous post, I showed you how to write a generic function in Go using the proposed syntax from the generics draft document.","link":"https://www.ardanlabs.com/blog/2020/08/generics-02-underlying-types.html","owner":"Wilfred Hughes"},{"title":"Nuances of Elixir Releases for Phoenix Applications","description":"Deploying a phoenix application using Releases is very straightforward in most cases. However for people who are just starting off, certain steps of configuration can be a bit confusing. I&rsquo;ll try to address some of those which I have encountered in my earlier days of developing and deploying Phoenix applications.\nThis post assumes that you already have atleast a basic Phoenix application that connects to a PostgreSQL database, and is ready to be deployed.","link":"https://crypt.codemancers.com/posts/2020-08-18-nuances-of-elixir-releases-for-phoenix-applications/","owner":"Codelitt"},{"title":"What is Distributed SQL? An Evolution of the Database","description":"As organizations transition to the cloud, they eventually find that the legacy relational databases that are behind some of their most critical applications simply do not take advantage of the promise of the cloud and are difficult to scale. It is the database that is limiting the speed and effectiveness of this transition. To address this, organizations want the reliability of a tested relational data store, such as Oracle, SQL Server, Postgres, and MySQL, but with the benefits of scale and global coverage that comes with the cloud.","link":"https://www.cockroachlabs.com/blog/what-is-distributed-sql/","owner":"Cloudflare"}]