[{"title":"[Russian] математический анекдот (исправил ошибку)","description":"[Russian] математический анекдот (исправил ошибку)","link":"https://yurichev.com/news/20201009_math_joke_fixed/","owner":"Dennis Yurichev"},{"title":"[Russian] Что такое NP-проблемы: для неспециалистов","description":"[Russian] Что такое NP-проблемы: для неспециалистов","link":"https://yurichev.com/news/20201011_NP/","owner":"Dennis Yurichev"},{"title":"5 Mental Models for Software Engineers","description":"Think efficiently about a problem using these five concepts: redundancy, bottlenecks, emergence, first principles thinking, and first-conclusion bias.","link":"https://blog.codelitt.com/5-mental-models/","owner":"Codelitt"},{"title":"Continuous Side Scrolling in a Phaser Game with Tile Sprites","description":"\n                    <p>In 2D games, it is not uncommon to want animated backgrounds. Having static images in your levels doesn&rsquo;t necessarily add to the game-play experience, so a little bit of motion can go a long way.</p>\n<p>So how can you do this without having to manage these background images like you would a typical sprite?</p>\n<p>Rather than worrying about creating, destroying, and managing sprites to represent components of your background, it might make sense to use a tile sprite, sometimes referred to as a tilemap. With a tile sprite you are grabbing tiles from an image and using them wherever you might need them. This approach is common for game backgrounds or levels that have a lot of asset repetition because it takes less resources and will leave you with a higher performance game.</p>\n<p>In this tutorial, we&rsquo;re going to see how to use a tile sprite in a <a href=\"http://phaser.io/\">Phaser</a> 3.x game to add an infinite scrolling effect to the background in our","link":"https://www.thepolyglotdeveloper.com/2020/08/continuous-side-scrolling-phaser-game-tile-sprites/","owner":"Nic Raboy"},{"title":"How Working as a Product Owner Helped Me Be a Better Engineer (and vice versa)","description":"Over the past few months, I was given the opportunity to try out the life of a Product Owner (PO), alongside retaining my responsibilities as an engineer. The life of a PO has always intrigued me since I joined trivago 2 years ago, and I always found myself unofficially taking on roles that were traditionally done by them. Things like reaching out to stakeholders for collaboration, thinking about KPIs and impact, and general &ldquo;aligning&rdquo;.","link":"https://tech.trivago.com/2020/08/19/how-working-as-a-product-owner-helped-me-be-a-better-engineer-and-vice-versa/","owner":"Trivago"},{"title":"Integrating DevOps into Automation for Jira","description":null,"link":"https://blog.developer.atlassian.com/integrating-devops-into-automation-for-jira/","owner":"Atlassian"},{"title":"prox part 4 — simplified redesign","description":"","link":"https://engineering.prezi.com/prox-part-4-simplified-redesign-c442e72e973d?source=rss----911e72786e31---4","owner":"Prezi"},{"title":"The Serverless Framework Knative Component","description":"Deploy containerized applications on serverless Knative infrastructure easily, cheaply and scale massively, all via the Serverless Framework","link":"https://serverless.com/blog/serverless-framework-knative-component/","owner":"Serverless"}]