[{"title":"ElasticWars Episode IV: A new field","description":"On a normal day, we ingest a lot of data into our ELK clusters (~6TB across all of our data centers). This is mostly operational data (logs) from different components in our infrastructure. This data ranges from purely technical info (logs from our services) to data about which pages our users are loading (intersection between business and technical data).\nAt trivago,we use Kafka as a central hub for moving data between our systems (including logs).","link":"https://tech.trivago.com/2020/06/03/elasticwars-episode-iv-a-new-field/","owner":"TripAdvisor"},{"title":"In search of speed — debugging Elasticsearch performance","description":"","link":"https://engineering.prezi.com/in-search-of-speed-debugging-elasticsearch-performance-9ce8edf4af40?source=rss----911e72786e31---4","owner":"Postmates"},{"title":"Innovating with Distributed Hackathons","description":"Innovation is the lifeblood of a tech startup. Keeping it flowing is a challenge for every tech startup that grows beyond a small team and that challenge is multiplied when a company is fully distributed like InVision.\nLast month we kicked off our first distributed, cross-team hackathon with an explicit goal of breaking team silos and getting that lifeblood flowing. Spoiler alert; it was a huge success. This article aims to capture that lightning in a bottle to help both our future selves and other companies replicate our success.","link":"https://engineering.invisionapp.com/post/innovating-with-distributed-hackathons/","owner":"Intuit"},{"title":"Serverless Azure Functions V2 - Linux, Python & .NET Core Support","description":"Introducing the v2 release of the Serverless Azure Functions plugin, which includes support for Linux, Python & .NET Core Function Apps.","link":"https://serverless.com/blog/serverless-azure-functions-v2/","owner":"Sensible"},{"title":"The singular urgency of Ava DuVernay’s 13th","description":"On Sunday afternoon, I was on the phone with one of my Oxide co-founders, Steve Tuck. He and I were both trying to grapple with the brazen state-sponsored violence that we were witnessing: the murder of George Floyd and the widespread, brutal, and shameless suppression of those who were demonstrating against it. Specifically, we were [...]","link":"http://dtrace.org/blogs/bmc/2020/06/02/the-singular-urgency-of-ava-duvernays-13th/","owner":"Brujo Benavides"}]