[{"title":"Extend Flows with Heroku Compute: An Event-Driven Pattern","description":"<p><em>This post <a href=\"https://medium.com/salesforce-architects/extend-flows-with-heroku-compute-an-event-driven-pattern-a9840a91ce5b\">previously appeared</a> on the Salesforce Architects blog.</em></p>\n\n<p>Event-driven application architectures have proven to be effective for implementing enterprise solutions using loosely coupled services that interact by exchanging asynchronous events. Salesforce enables event-driven architectures (EDAs) with Platform Events and Change Data Capture (CDC) events as well as triggers and Apex callouts, which makes the Salesforce Platform a great way to build all of your <a href=\"https://www.salesforce.com/products/platform/best-practices/understanding-digital-customer-experience/\">digital customer experiences</a>. This post is the first in a series that covers various EDA patterns, considerations for using them, and examples deployed on the Salesforce Platform.</p>\n<h2 class=\"anchored\">\n  <a name=\"expanding-the-event-driven-architecture-of-the-sales","link":"https://blog.heroku.com/extend-flows-heroku-event-driven","owner":"HERE"},{"title":"No Code Workflow Orchestrator for Building Batch & Streaming Pipelines at Scale","description":null,"link":"https://eng.uber.com/no-code-workflow-orchestrator/","owner":"Twitch"},{"title":"Scale React Development with Nx","description":"<div class=\"article-intro\">\r\n    I&rsquo;m happy to announce the release of my latest Egghead course on “Scale React development with Nx”. Let me briefly dive into what the course is about, why I targeted it to React.js developers and who should watch it!\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/x-UBl5PfPk0\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/x-UBl5PfPk0/","owner":"Justin Weiss"},{"title":"State of the Product","description":null,"link":"https://evernote.com/blog/state-of-the-product/","owner":"Eventbrite"},{"title":"Technical Due Diligence–Safeguarding your IT Startup Investment","description":"Or, how to invest then add value to your startup portfolio Translated from French by Natalie Schmitz. Original French article : Due diligence technique – sécuriser son investissement dans des startups IT Introduction While many companies are still reeling from the ongoing coronavirus crisis, startups are taking the hardest blows. The French government injected 4 […]","link":"https://blog.octo.com/en/technical-due-diligence-safeguarding-your-it-startup-investment/","owner":"Nvidia"},{"title":"The Boring Option","description":"","link":"https://medium.com/strava-engineering/the-boring-option-4a7c6ad16ab8?source=rss----89d4108ce2a3---4","owner":"Stormpath"},{"title":"What is VPC Peering and When Should You Use It?","description":"If you’re building and managing applications in public cloud providers like GCP or AWS, chances are you’ve heard of VPC peering. This blog post explains what VPC peering is, why you’d want to use it, and, if you’re using CockroachCloud today, how you can get started with our new VPC peering functionality. What is a VPC and what is VPC peering? First thing’s first - a virtual private cloud (VPC) is a logically isolated, virtual network within a cloud provider.","link":"https://www.cockroachlabs.com/blog/what-is-vpc-peering/","owner":"Cloudflare"}]