[{"title":"A Full Stack Guide to Graphql: React Client","description":"This is the final post on the series of GraphQL posts.\nWe started with intro to GraphQl, implemented a simple NodeJs GraphQl service to understand the concepts like Resolvers, Schemas (typeDefs),Query and Mutation, and then we built the same GraphQL service in elixir with Absinthe.\nIn this post, we&rsquo;re going to build the UI using ReactJs and Apollo graphql client for the menu card service we wrote. Let&rsquo;s get started.","link":"https://crypt.codemancers.com/posts/2020-07-15-a-full-stack-guide-to-graphql-react-client/","owner":"Codelitt"},{"title":"A small engineering team with a big impact","description":"","link":"https://tech.instacart.com/a-small-engineering-team-with-a-big-impact-40184c40d7e?source=rss----587883b5d2ee---4","owner":"Indeed"},{"title":"Partial Commits in WebStorm","description":"<div class=\"article-intro\">\r\n    I think partial commits should be avoided as they might lead to inconsistent commits if you don&rsquo;t test them properly. But sometimes they&rsquo;re handy too. In this article I&rsquo;m quickly showing how partial commits can be done in Webstorm.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/DQCemEGN1XM\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/DQCemEGN1XM/","owner":"Justin Weiss"},{"title":"Towards solving Ultimate Tic Tac Toe","description":"Summary: Read about my efforts to solve the game of Ultimate Tic Tac Toe. It&rsquo;s been a fun journey into interesting algorithms and high-performance parallel programming in Rust.\nBackstory Starting around the beginning of the COVID-19 lockdown, I&rsquo;ve gotten myself deeply nerdsniped by an attempt to solve the game of Ultimate Tic Tac Toe, a two-level Tic Tac Toe variant which is (unlike Tic Tac Toe) nontrivial and contains some interesting strategic elements.","link":"https://blog.nelhage.com/post/solving-ultimate-ttt/","owner":"Natasha Murashev"}]