[{"title":"Introducing perfolizer","description":"<p>Over the last 7 years, I&rsquo;ve been maintaining <a href=\"https://github.com/dotnet/BenchmarkDotNet\">BenchmarkDotNet</a>;\nit&rsquo;s a library that helps you to transform methods into benchmarks, track their performance, and share reproducible measurement experiments.\nToday, BenchmarkDotNet became the most popular .NET library for benchmarking which was adopted by <a href=\"https://github.com/dotnet/BenchmarkDotNet#who-use-benchmarkdotnet\">3500+</a> projects including .NET Core.</p>\n<p>While it has tons of features for benchmarking that allows getting reliable and accurate measurements,\nit has a limited set of features for performance analysis.\nAnd it&rsquo;s a problem for many developers.\nLately, I started to get a lot of emails when people ask me\n&ldquo;OK, I benchmarked my application and got tons of numbers. What should I do next?&rdquo;\nIt&rsquo;s an excellent question that requires special tools.\nSo, I decided to start another project that focuses specifically on performance ","link":"https://aakinshin.net/posts/introducing-perfolizer/","owner":"Andrew Ray"},{"title":"Millions of map tiles into a bucket with MapTiler CloudPush","description":"\n          <img src=\"https://www.maptiler.com/media/2020-03-04-cloudpush-milions-of-mapt-tiles-into-a-bucket-with-maptiler-cloudpush-1.png\"\n          alt=\"Thumb\">\n          <p>If you decide to build a map platform on cloud storage like Amazon S3, Google Cloud Platform, Microsoft Azure or any other alternative cloud or on-premise OpenStack, you need to populate it with content. But official applications are often heavy-footed while the alternatives lack the speed. Our CloudPush technology solves both issues and offers manipulation with files that are both fast and extremely easy-to-use.</p>\n\n<h2 id=\"cloudpush-for-simple-upload-to-a-cloudservices\">CloudPush for simple upload to a cloud services</h2>\n<p>Serverless hosting has gained popularity due to easy scalability when the project starts to grow, overall better performance, lower price compared to self-hosting and easier disaster recovery if the provider spreads its’ infrastructure all over the globe. However, manipulation with files o","link":"https://www.maptiler.com/news/2020/03/cloudpush-milions-of-mapt-tiles-into-a-bucket-with-maptiler-cloudpush/","owner":"Mandrill"},{"title":"Never Concatenate Strings With jOOQ","description":"jOOQ supports a vast amount of SQL syntax out of the box. As such, most users will not think of resorting to string concatenation like in the old days when writing dynamic SQL with JDBC. But every now and then, a vendor specific feature is not supported by jOOQ (yes, it happens). In that case, … ","link":"https://blog.jooq.org/2020/03/04/never-concatenate-strings-with-jooq/","owner":"IPFS"},{"title":"Resiliency: two alternatives for fault tolerance to deprecated Hystrix","description":"","link":"https://quickbooks-engineering.intuit.com/resiliency-two-alternatives-for-fault-tolerance-to-deprecated-hystrix-de58870a8c3f?source=rss----aafcab06cc52---4","owner":"Intercom"},{"title":"Tutorial: Build an App with Spring, Java, Hibernate, Gradle, and CockroachDB","description":"Application development frameworks like&#xA0;SpringBoot&#xA0;have done a good job a giving developers a&#xA0;quick start&#xA0;to developing applications with Java. Layering&#xA0;object-relational&#xA0;mapping to SQL to remove proprietary syntax has further simplified the development of database applications.\nCockroachDB&#xA0;allows developers to take advantage in the evolution of globally distributed data with a simple SQL interface. But each database can bring it&#x2019;s own specific syntax and cause developers to hesitate when getting started with a new database.","link":"https://www.cockroachlabs.com/blog/tutorial-spring-hibernate/","owner":"Cloudflare"},{"title":"V-Drum Explorer: Planning notes for MVVM","description":"My current clunky “put all the code in the view” approach to V-Drum Explorer is creaking at the seams. I’m really not a WPF developer, and my understanding of MVVM is more theoretical than practical. I’ve read a reasonable amount, but quite a lot of aspects of V-Drum Explorer don’t really fit with the patterns … ","link":"https://codeblog.jonskeet.uk/2020/03/03/v-drum-explorer-planning-notes-for-mvvm/","owner":"Jon Kensy"},{"title":"Why you need to set up a proper super-system to be successful","description":"What makes some teams and people successful at achieving their goals? They focus on process over outcomes. ","link":"https://blog.novoda.com/super-system/","owner":"Nordic APIs"}]