[{"title":"Breaking Loose from Third-Party Lock-In with Custom Refactoring Tools","description":"Code refactoring is an essential part of the job of software developers. As time goes on, technology evolves, product requirements change…","link":"https://developers.soundcloud.com/blog/breaking-loose-from-third-party-lock-in-with-custom-refactoring-tools","owner":"Soshace"},{"title":"Python and Go : Part III - Packaging Python Code","description":"Series Index Python and Go: Part I - gRPC\nPython and Go: Part II - Extending Python With Go\nPython and Go: Part III - Packaging Python Code\nPython and Go: Part IV - Using Python in Memory\nIntroduction In the previous post we compiled Go code to a shared library and used it from the Python interactive shell. In this post we&rsquo;re going to finish the development process by writing a Python module that hides the low level details of working with a shared library and then package this code as a Python package.","link":"https://www.ardanlabs.com/blog/2020/08/packaging-python-code.html","owner":"Wilfred Hughes"},{"title":"Welcome to the dark side: deploying ‘dark mode’ on the Guardian live app","description":"<p>Do you like to read the headlines at night? QA/test analyst Gwyn Lockett discusses the introduction of dark mode on the Guardian’s main news app</p><p>As the QA/test analyst for the Guardian’s mobile apps team, part of my role is processing user feedback and suggestions. One of our most requested features has been a night-time reading solution on the Guardian live app.</p><p>With the introduction of dark mode as a system setting in both iOS 13 and Android 10, we are pleased to report we now offer this brilliant feature for readers. The sleek new dark theme will sit alongside our standard colour palette. In this blog post, I’ve outlined some of our considerations and steps we took during the development process.</p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguardian.com/info/2020/aug/11/welcome-to-the-dark-side-deploying-dark-mode-on-the-guardian-live-app\">Continue reading...</a>","link":"https://www.theguardian.com/info/2020/aug/11/welcome-to-the-dark-side-deploying-dark-mode-on-the-guardian-live-app","owner":"Groupon"}]