[{"title":"Cloud Jewels: Estimating kWh in the Cloud","description":"In the face of a changing climate, we at Etsy are committed to reducing our ecological footprint. To better understand the environmental impact of our computing, we created a set of conversion factors called Cloud Jewels to help us roughly convert our cloud usage information (like Google Cloud usage data) into approximate energy used. ","link":"https://codeascraft.com/2020/04/23/cloud-jewels-estimating-kwh-in-the-cloud/","owner":"Erlang Solutions"},{"title":"How we made FastText faster","description":"FastText is a library for efficient text classification and representation learning. Like its sibling, Word2Vec, it produces meaningful word embeddings from a given corpus of text. Unlike its sibling, FastText uses n-grams for word representations, making it great for text-classification projects like language detection, sentiment analysis, and topic modeling.  Here at GIPHY, we use FastText […]","link":"https://engineering.giphy.com/how-we-made-fasttext-faster/","owner":"Gilt"},{"title":"Inside Kinvolk Labs: Investigating Kubernetes performance issues with BPF","description":"One of the things we do in the Kinvolk Labs team is provide expert technical consulting for customers who are experiencing issues with their Kubernetes or Linux environments — from security audits to networking troubles to troubleshooting puzzling performance problems.\nA few weeks back, video advertising technology company Smartclip reached out to us at Kinvolk to investigate performance issues with their Kubernetes deployment. In this blog post, I will give you some insight into our processes and explain how we rapidly identified and solved the problem, using BPF tools from the BCC project.","link":"/blog/2020/04/inside-kinvolk-labs-investigating-kubernetes-performance-issues-with-bpf/","owner":"King"},{"title":"Podcast 229: Jokes On Us","description":null,"link":"https://stackoverflow.blog/2020/04/24/podcast-229-jokes-on-us/","owner":"Squarespace"},{"title":"Read man pages with vim","description":null,"link":"https://catonmat.net/read-man-pages-with-vim","owner":"Peter Steinberger"},{"title":"Running Flatcar Container Linux in Microsoft Azure","description":"Recently, we showed how easy it is to migrate from CoreOS Container Linux to Flatcar Container Linux . Today we’re going to build on that to show how to start instances of Flatcar Container Linux on Azure and how to migrate existing Azure instances running CoreOS Container Linux.\nNote: Red Hat announced CoreOS Container Linux will reach its end-of-life on May 26 . Flatcar Container Linux is the only drop-in replacement going forward.","link":"/blog/2020/04/running-flatcar-container-linux-in-microsoft-azure/","owner":"King"}]