[{"title":"Create a Stream Deck Plugin to Interact with Webhooks","description":"\n                    <p>I recently jumped on the hype train when it comes to streaming and picked up an <a href=\"https://amzn.to/2VijYJY\">Elgato Stream Deck</a>. If you&rsquo;re unfamiliar, these devices are essentially hotkey peripherals with LCD adjustable keys that allow you to quickly perform certain tasks. Could a keyboard shortcut get the job done? For a lot of tasks, definitely, but the Stream Deck software is where the magic comes in.</p>\n<p>The Stream Deck software allows you to connect certain services or multi-stage shortcuts to a specific key, something a standard keyboard shortcut probably won&rsquo;t do well. In addition, you&rsquo;re able to design your own actions using simple JavaScript and HTML.</p>\n<p>In this tutorial, we&rsquo;re going to see how to create a Stream Deck action, one that sends HTTP requests to remote webhook services, using JavaScript.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdevelope","link":"https://www.thepolyglotdeveloper.com/2020/07/create-stream-deck-plugin-interact-webhooks/","owner":"Nelson Elhage"},{"title":"Python and Go : Part II - Extending Python With Go","description":"Series Index Python and Go: Part I - gRPC\nPython and Go: Part II - Extending Python With Go\nPython and Go: Part III - Packaging Python Code\nPython and Go: Part IV - Using Python in Memory\nIntroduction In the previous post we saw how a Go service can call a Python service using gRPC. Using gRPC to connect a Go and Python program together can be a great choice, but there’s a complexity price that goes with it.","link":"https://www.ardanlabs.com/blog/2020/07/extending-python-with-go.html","owner":"Wilfred Hughes"},{"title":"Serverless is the ultimate place to experiment","description":"If all you want to do is play around and try stuff without worrying bills and costs, serverless is the place for you!","link":"https://serverless.com/blog/experiment-with-serverless/","owner":"Sensible"}]