[{"title":"Babyface: a Parental Leave Project","description":"I recently returned to work following three months of parental leave for the birth of my first child. I spent most of that time doing what you&#x2019;d expect: staring at the baby for hours, changing hundreds of diapers, and generally alternating between unwarranted confidence and complete uncertainty. But I also found a little time for some other projects, and I&#x2019;d like to share one of them today.\nWe used an app called Baby Connect&#xA0;to track feedings, diapers, and other vital information about the baby (this is the app that got the coveted phone home screen real estate that was freed when I uninstalled Slack for my leave).","link":"https://www.cockroachlabs.com/blog/babyface/","owner":"Cloudflare"},{"title":"Building a Custom Ambilight System For Any Input With A Raspberry Pi and Hyperion","description":null,"link":"https://blog.monstermuffin.org/building-a-custom-ambilight-system-for-any-input-with-a-raspberry-pi-and-hyperion/?utm_source=rss&utm_medium=rss&utm_campaign=building-a-custom-ambilight-system-for-any-input-with-a-raspberry-pi-and-hyperion","owner":"Monica Dinculescu"},{"title":"DriftPHP: Quick Start","description":"Idea and Architecture Let’s imagine that you are building a high-performance PHP application. Speaking of me previously I had two options: either use Symfony or ReactPHP. And to tell the truth, both solutions have their one pros and cons. With Symfony, you have a huge ready-to-go ecosystem and all you need is to add your own business logic. But the downside here is that your code is going to be blocking in most cases. If you have a lot of input/output operations (and you will definitely have) they will slow down the application. Everything you can do in this case is to reduce the bootstrap of the framework by using php-pm. It means that you have several instances of your...","link":"http://sergeyzhuk.me/2020/05/08/driftphp-quick-start/","owner":"Sam Saffron"},{"title":"High-resolution aerial imagery of entire Japan!","description":"\n          <img src=\"https://www.maptiler.com/media/2020-05-08-high-resolution-aerial-imagery-of-entire-japan-1.jpg\"\n          alt=\"Thumb\">\n          <p>High-resolution aerial imagery and official government map data of entire Japan is now available to the global audience via Maps API. It becomes possible thanks to a partnership with our local business partner, MIERUNE.</p>\n\n<h2 id=\"aerial-imagery-from-gsi-via-mapsapi\">Aerial imagery from GSI via Maps API</h2>\n<p>Our global cloudless satellite layer now includes high-resolution aerial imagery from GSI (Geospatial Information Authority of Japan). It covers <a href=\"https://maptiler.jp/maps/#hybrid/ja/vector/4.49/140.82/37.91\">entire Japan</a>, including all major and small islands.</p>\n\n<p>Aerial imagery is rendered till the zoom level 18, which is an equivalent of approximately 60cm/pixel. To obtain the resolution, we processed 6.5 TB of raw data.</p>\n\n<p><img src=\"https://www.maptiler.com/media/2020-05-08-high-resolution-aerial-imager","link":"https://www.maptiler.com/news/2020/05/high-resolution-aerial-imagery-of-entire-japan/","owner":"Mandrill"},{"title":"Using Custom Objects in Zendesk Sunshine","description":"","link":"https://developerblog.zendesk.com/using-custom-objects-in-zendesk-sunshine-cf2e82f57756?source=rss----ed5bf5519696---4","owner":"Zendesk"}]