[{"title":"AWS, Azure, & GCP Respond to the 2020 Cloud Report","description":"[THE 2021 CLOUD REPORT IS AVAILABLE. READ IT HERE]\nIn December 2019, we published the 2020 Cloud Report and an accompanying blog post, which summarized original research we conducted benchmarking the performance of Amazon Web Services (AWS), Microsoft Azure (Azure), and the Google Cloud Platform (GCP).\nThe response from our customers and the cloud providers was tremendous. Before publishing, we shared our findings with each of the benchmarked clouds and allowed time for their review and feedback.","link":"https://www.cockroachlabs.com/blog/aws-azure-gcp-respond-to-the-2020-cloud-report/","owner":"Cloudflare"},{"title":"Customizing Tooltips with the Power of Sass Mixins","description":null,"link":"https://medium.com/zoosk-engineering/customizing-tooltips-with-the-power-of-sass-mixins-78b6afb5bd8c?source=rss----95d50021e056---4","owner":"Zomato"},{"title":"Fifty shades of #808080","description":"Keeping styles and colours to a minimum can ease maintenance and enable applications to quickly iterate on design changes. This blog covers my top android resource smells and how to deal with them for a cleaner future.","link":"https://blog.novoda.com/fifty-shades-of-808080/","owner":"Nordic APIs"},{"title":"In the Wake of COVID-19: Virtual Badge Scans for Women Who Code","description":"This past year, the Cockroach Labs marketing team introduced a novel way of collecting leads at large events. Instead of giving away swag (socks, tshirts, pens, etc.) to every person we met, we donated money to a non-profit. Our &#x201C;contacts for charity&#x201D; program was wildly successful, and at AWS Reinvent and KubeCon North America last year, we more than tripled our lead capture goals and donated over $14,500 to Women Who Code, the largest and most active community for technical women in the world.","link":"https://www.cockroachlabs.com/blog/virtual-badge-scan-for-women-who-code/","owner":"Cloudflare"},{"title":"Pintool: tracking 'CALL 0' and 'JMP 0' instruction","description":"Pintool: tracking 'CALL 0' and 'JMP 0' instruction","link":"https://yurichev.com/news/20200726_pintool_call0/","owner":"Dennis Felsing"},{"title":"Sophos UTM and AP15: fixing “ll_read: dead socket: Resource temporarily unavailable”","description":null,"link":"https://www.schakko.de/2020/03/12/sophos-utm-and-ap15-fixing-ll_read-dead-socket-resource-temporarily-unavailable/?utm_source=rss&utm_medium=rss&utm_campaign=sophos-utm-and-ap15-fixing-ll_read-dead-socket-resource-temporarily-unavailable","owner":"Sergey Zhuk"},{"title":"The SOC2 Starting Seven","description":"\n\n<p>So, you plan to sell your startup’s product to big companies one day. Congratu-dolences!</p>\n\n<p>Really, that’s probably the only reason you should care about this article. If that’s not you, go forth and live your life! We’ll ask no more of your time.</p>\n\n<p>For the rest of you: Industry people talk about SOC2 a lot, and it’s taken on a quasi-mystical status, not least because it’s the product of the quasi-mystical accounting industry. But what it all boils down to is: eventually you’ll run into big-company clients demanding a SOC2 report to close a sale. You know this and worry about it.</p>\n\n<p>Here’s how we’ll try to help: with Seven Things you can do now that will simplify SOC2 for you down the road while making your life, or at least your security posture, materially better in the immediacy.</p>\n\n<p>We’ll cut to the chase and list them out, and then dig into explanations.</p>\n\n<p><em>#1: Single Sign-On</em></p>\n\n<p>You’re going to sign up for Okta or Google Cloud Identity, ","link":"https://latacora.micro.blog/2020/03/12/the-soc-starting.html","owner":"Kolosek"},{"title":"Write testable code by writing generic code","description":"Alex Gaynor recently asked this question in an IRC channel I hang out in (a channel which contains several software engineers nearly as obsessed with software testing as I am):\n uhh, so I&rsquo;m writing some code to handle an econnreset&hellip; how do I test this?\n This is a good question! Testing ECONNRESET is one of those fiddly problems that exists at the interface between systems — in his case, with S3, not even a system under his control — that can be infuriatingly tricky to reproduce and test.","link":"https://blog.nelhage.com/post/write-testable-code-by-writing-generic-code/","owner":"Natasha Murashev"}]