[{"title":"Animate a Compressed Sprite Atlas in a Phaser Game","description":"\n                    <p>You might recall that I recently wrote a tutorial titled <a href=\"https://www.thepolyglotdeveloper.com/2020/07/animate-spritesheets-phaser-game/\">Animate Spritesheets in a Phaser Game</a> where I created two different sprite animations from a single spritesheet. The process was quite simple, but not very optimized. In this previous tutorial, the spritesheet had each frame being composed of the same resolution image. This allowed us to iterate over the frames kind of like an array. However, because each frame in the spritesheet was the same size, we had a lot of empty space padded between each of the frames. Wasted space in an image means we&rsquo;re now working with a larger image in resolution and in file size.</p>\n<p>We can improve upon this process with what&rsquo;s known as a sprite atlas.</p>\n<p>A sprite atlas is still a spritesheet. We have numerous frames in a single image file, the difference being that all of the padded white-space has been removed. Sin","link":"https://www.thepolyglotdeveloper.com/2020/08/animate-compressed-sprite-atlas-phaser-game/","owner":"Nic Raboy"},{"title":"content-visibility: the New CSS Property that Boosts your Rendering Performance","description":"Improve initial load time by skipping the rendering of offscreen content.","link":"https://una.im/2020/08/05/content-visibility/","owner":"Una Kravets"},{"title":"MapTiler Desktop Next Generation","description":"\n          <img src=\"https://www.maptiler.com/media/2020-08-05-maptiler-desktop-next-generation-1.png\"\n          alt=\"Thumb\">\n          <p>We designed the MapTiler Desktop to be the most user-friendly geodata processing tool. For the upcoming version, we are asking you, the community of users, to give us your feedback.</p>\n\n<h2 id=\"the-vision\">The vision</h2>\n<p>Since the very beginning, MapTiler Desktop was created to help turn files into zoomable maps. The simple user interface allows everyone, even creative people with no technical background, to process anything you drop into it - and create map layers and overlays on existing world maps.</p>\n<blockquote>\n  <p>Being the most user-friendly geodata processing tool for converting maps-data into a web and mobile-ready form.</p>\n</blockquote>\n\n<p>Assigning location information to images or plans was always easy - with visual georeferencing - or powerful with other methods available for power users. </p>\n\n<amp-img alt=\"MapTiler Desktop N","link":"https://www.maptiler.com/news/2020/08/maptiler-desktop-next-generation/","owner":"MapTiler"},{"title":"Use NATURAL FULL JOIN to compare two tables in SQL","description":"There are a few ways to compare two similar tables in SQL. Assuming PostgreSQL syntax, we might have this schema: It is now possible to use UNION and EXCEPT as suggested by Chris Saxon: You can compare two tables with t1 minus t2 union t2 minus t1 There's a better way where you query each … ","link":"https://blog.jooq.org/2020/08/05/use-natural-full-join-to-compare-two-tables-in-sql/","owner":"jOOQ"}]