[{"title":"Community Tutorial: Using NPoco with CockroachDB and C# / .NET Core","description":"Hi, I&#x2019;m Darrien, and I&#x2019;m building a distributed, near-real time, &#x201C;OSINT data reconnaissance&#x201D; system. For this system, I&#x2019;ll be using CockroachDB for its distributed nature, and connecting it to a .NET Core API via NPoco and Npgsql. In this post, I&apos;ll give a walkthrough of how I&apos;m building the system, and how these connections work, so you can use them too.\nAn Exercise in Curiosity and Data Sets When I first learned about network penetration testing I was enamored with the reconnaissance tools available for gathering data.","link":"https://www.cockroachlabs.com/blog/npoco-dotnet-cockroachdb/","owner":"Cloudflare"},{"title":"Disputed borders in OpenMapTiles 3.11","description":"\n          <img src=\"https://www.maptiler.com/media/2020-01-30-disputed-borders-in-openmaptiles-3-11-1.png\"\n          alt=\"Thumb\">\n          <p>The new release of our open-source map publishing project, OpenMapTiles 3.11, introduces disputed borders, roads under construction, adds support for Kurdish and Amharic language and brings multiple other improvements and bug fixes.</p>\n\n<h2 id=\"disputed-borders\">Disputed borders</h2>\n<p>Many areas are claimed by two or more countries as their territory. Governments often require displaying claimed territories as part of their country - sometimes just for official government maps, but often also for all maps published in the country.</p>\n\n<p>With OpenMapTiles 3.11, the map can be styled according to the point of view of a selected country, even on the lower zoom levels. <a href=\"https://support.maptiler.com/i636-display-disputed-borders-according-to-the-official-country-s-policy\">Read this article</a> to learn how to change the map according to","link":"https://www.maptiler.com/news/2020/01/disputed-borders-in-openmaptiles-3-11/","owner":"Mandrill"},{"title":"Public cloud cost optimization","description":"","link":"https://quickbooks-engineering.intuit.com/public-cloud-cost-optimization-b67507f36b35?source=rss----aafcab06cc52---4","owner":"Intercom"},{"title":"Speeding Up Builds with Dagger Reflect","description":"A large portion of an Android app’s build time can consist of Dagger annotation processing, and most developers agree that productivity is…","link":"https://developers.soundcloud.com/blog/dagger-reflect","owner":"Soshace"}]