[{"title":"Effortless mass change management with Hammurabi","description":"","link":"https://engineering.prezi.com/hammurabi-the-extensible-codemod-tool-918d534f9f2d?source=rss----911e72786e31---4","owner":"Prezi"},{"title":"Profiles in Coding: Diana Yanakiev, Uber ATG, Pittsburgh","description":null,"link":"https://eng.uber.com/profiles-in-coding-diana-yanakiev/","owner":"Uber"},{"title":"Scan for Broken Links on a Website with JavaScript","description":"\n                    <p>Building a website isn&rsquo;t a difficult task in a lot of circumstances, but maintaining a website is a totally different story. When it comes to larger scale websites or blogs such as <a href=\"https://www.thepolyglotdeveloper.com\">The Polyglot Developer</a>, content can become out of date at any time, and it&rsquo;s more likely to happen the longer the content appears on the site.</p>\n<p>Stale content and content that doesn&rsquo;t work, whether that be through links, formatting, or something else, can severely damage how you rank in search results and the overall growth of your website.</p>\n<p>Let&rsquo;s dig a little deeper into links for example.</p>\n<p>You&rsquo;re probably going to have links on your website, whether they be internal or external in terms of where they route to. As your website evolves, or as the external websites evolve, those links might change and break. Broken links create a poor experience, something that Google and other search engi","link":"https://www.thepolyglotdeveloper.com/2020/06/scan-broken-links-website-javascript/","owner":"Nic Raboy"},{"title":"Using AWS EC2 and ECS to host hundreds of services","description":"<p>One of my goals of moving internally to the Production Engineering team was to\nhelp demystify the concepts that are commonplace within our Platform teams. My\nfirst internal blog post to do this was to share how we use EC2 (AWS Elastic\nCompute Cloud) and ECS (AWS Elastic Container Service) to host the hundreds of\nservices that our Software Engineers build and improve every day.</p>\n\n<h2 id=\"what-is-an-ec2-host\">What is an EC2 host?</h2>\n\n<aside>\n  <p>“Amazon Elastic Compute Cloud (Amazon EC2) is a web service that provides\nsecure, resizable compute capacity in the cloud. It is designed to make\nweb-scale cloud computing easier for developers. Amazon EC2’s simple web service\ninterface allows you to obtain and configure capacity with minimal friction. It\nprovides you with complete control of your computing resources and lets you run\non Amazon’s proven computing environment.”</p>\n\n  <p><em>Amazon’s description of EC2</em></p>\n</aside>\n\n<p>I would say this; an EC2 host is a server. More s","link":"https://deliveroo.engineering/2020/06/16/using-aws-ec2-and-ecs-to-host-hundreds-of-services.html","owner":"Deliveroo"}]