[{"title":"App Onboarding with SwiftUI","description":"","link":"https://medium.com/zendesk-engineering/app-onboarding-with-swiftui-23d970ab24d4?source=rss----a88376ea904a---4","owner":"ZeeMee"},{"title":"How to Calculate Your True Database Costs","description":"Before the dominance of the cloud, calculating the cost of a database was a pretty simple equation: software costs + hardware costs = database costs. If you chose an open source product, the software cost might melt away. While the cloud has fundamentally changed how we consume and deploy software, too many people are still using this outdated calculation.&#xA0;\nThe truth is, there are a lot more things to consider when pricing out the total cost of a database.","link":"https://www.cockroachlabs.com/blog/true-cost-cloud-database/","owner":"Cloudflare"},{"title":"Introducing Bean Machine","description":"The final part of my Life series is still in the works but I need to interrupt that series with some exciting news. The new programming language I have been working on for the last year or so has just … ","link":"https://ericlippert.com/2020/09/23/introducing-bean-machine/","owner":"Eric Elliot"},{"title":"java.lang.SecurityException with SubscriptionManager – But I declared the permissions!..","description":null,"link":"https://blog.blundellapps.co.uk/securityexception-subscriptionmanager-but-i-declared-the-permissions/","owner":"Blake Erickson"},{"title":"Object Pooling Sprites in a Phaser Game for Performance Gains","description":"\n                    <p>Performance is everything when it comes to video games. Lag and stutter due to dropped frames can easily ruin your game. This means that you have to be considerate of how you manage your game resources to prevent unnecessary operations and stress on the client computer or mobile devices running the game.</p>\n<p>If you&rsquo;ve got a game with a lot of items, enemies, etc., creating and destroying these sprites as necessary is an expensive task. Instead, it makes sense to create an object pool with a predefined number of preloaded sprites that are used or hidden as necessary. This means that instead of creating a sprite when you need it, you pull the sprite from the pool. When you&rsquo;re done with the sprite, instead of destroying it, you add it back to the pool. While this seems like a silly task, it can have huge performance gains within your game.</p>\n<p>In this tutorial, we&rsquo;re going to see how to create and use an object pool for our sprites in a <a h","link":"https://www.thepolyglotdeveloper.com/2020/09/object-pooling-sprites-phaser-game-performance-gains/","owner":"Nelson Elhage"},{"title":"Striving in the Time of COVID-19 — My Second Summer at Strava","description":"","link":"https://medium.com/strava-engineering/striving-in-the-time-of-covid-19-my-second-summer-at-strava-452787e90720?source=rss----89d4108ce2a3---4","owner":"Stormpath"}]