[{"title":"Cockroach University: Free, Engaging Online Curriculum on Modern Database Technology","description":"Will Cross, Ph.D., is the Training Lead at Cockroach Labs\nAround 6 months ago, we launched Cockroach University to provide a way for people to learn CockroachDB in a structured environment with opportunities for hands-on experience. Since then, we have learned that it&#x2019;s actually much more than that.\nMany of our customers distribute Cockroach University internally, and their developer teams use it as a resource to learn how to build their latest application or proof-of-concept.","link":"https://www.cockroachlabs.com/blog/cockroach-university/","owner":"Cloudflare"},{"title":"Logging Machine Learning Data at WePay","description":"<h2 id=\"our-goal\">Our Goal</h2>\n\n<p>At WePay, we use machine learning models for risk analysis and fraud detection associated with payments. Each model is optimized for different fraud patterns and checkpoints associated with the timeline of the payment. Across all models, there is a need for interpretability and retraining. While there is a system in place for this now, the process is time consuming and lacks accuracy. Our goal is to build the underlying system that improves upon this and simplifies the procedures for model maintenance and development. With model logging, our data scientists will be able to accurately extract and understand the historical data in a seamless, efficient and user-friendly way.</p>\n\n<h2 id=\"requirements\">Requirements</h2>\n\n<p>Our data model needed to be flexible in such a way that it supported an arbitrary number of columns or dimensions of the feature set. We also needed to ensure that the system in place had no effect on model latencies and scaled with ","link":"https://wecode.wepay.com/posts/logging-machine-learning-data-at-wepay","owner":"Wemake.services"},{"title":"Profiles in Coding: Christabelle Bosson, Uber Elevate, San Francisco","description":null,"link":"https://eng.uber.com/profiles-in-coding-christabelle-bosson-uber-elevate/","owner":"Twitch"}]