[{"title":"Are formatters better than linters?","description":"","link":"https://elbrujohalcon.medium.com/are-formatters-better-than-linters-cbab91189be3?source=rss-788b9596f013------2","owner":"Brendan Gregg"},{"title":"Docker Images : Part III - Going Farther To Reduce Image Size","description":"Series Index Reducing Image Size\nDetails Specific To Different Languages\nGoing Farther To Reduce Image Size\nIntroduction In the first two parts of this series, we covered the most common methods to optimize Docker image size. We saw how multi-stage builds, combined with Alpine-based images, and sometimes static builds, would generally give us the most dramatic savings. In this last part, we will see how to go even farther. We will talk about standardizing base images, stripping binaries, assets optimization, and other build systems or add-ons like DockerSlim or Bazel, as well as the NixOS distribution.","link":"https://www.ardanlabs.com/blog/2020/04/docker-images-part3-going-farther-reduce-image-size.html","owner":"Wilfred Hughes"},{"title":"Does Zoom use end-to-end encryption?","description":"TL;DR: It’s complicated. Yesterday Zoom (the videoconferencing company, not the defunct telecom) put out a clarification post describing their encryption practices. This is a nice example of a company making necessary technical clarifications during a difficult time, although it comes following widespread criticism the company received over their previous, and frankly slightly misleading, explanation. Unfortunately, … ","link":"https://blog.cryptographyengineering.com/2020/04/03/does-zoom-use-end-to-end-encryption/","owner":"Matt Warren"},{"title":"What’s a “String” in the jOOQ API?","description":"One of jOOQ’s biggest strength is the fact that it is a type safe SQL API. “Type safe”, in this context, means that every object that you put in a jOOQ query has a well defined type, such as: Condition Field Table These can be used in jOOQ in a type safe way as such: … ","link":"https://blog.jooq.org/2020/04/03/whats-a-string-in-the-jooq-api/","owner":"IPFS"}]