[{"title":"\n    Automate Your Elixir Deployments - Part 2 - Distillery & eDeliver\n  ","description":"\n    ","link":"https://hashrocket.com/blog/posts/automate-your-elixir-deployments-part-2-distillery-edeliver","owner":"Hashrocket"},{"title":"3 Programs to Support Developers & COVID-19 Frontline Workers","description":"The global pandemic has changed the way we live and work. Work-from-home has become the new normal. Web and application traffic patterns have been turned upside-down. These abrupt transitions have added stress not only to our daily lives but also to our infrastructure and business applications.&#xA0;\nIn response to these dramatic shifts, Cockroach Labs is launching new programs to better support our fellow developers and the greater community of those affected by COVID-19.","link":"https://www.cockroachlabs.com/blog/do-good-with-us/","owner":"CockroachDB"},{"title":"Debug Jest with VSCode","description":"<div class=\"article-intro\">\r\n    Jest has become the goto testing framework in the frontend space, whether it is for React or for Angular. In Nx it is even the default choice when generating a new Angular app. Debugging can be a bit more cumbersome though, in contrast to Karma. Let&rsquo;s see.\r\n</div><img src=\"http://feeds.feedburner.com/~r/juristrumpflohner/~4/FJe1fZuaozk\" height=\"1\" width=\"1\" alt=\"\"/>","link":"http://feedproxy.google.com/~r/juristrumpflohner/~3/FJe1fZuaozk/","owner":"Juri Strumpflohner"},{"title":"The Future of OpenMapTiles project","description":"\n          <img src=\"https://www.maptiler.com/media/2020-05-14-the-future-of-openmaptiles-project-1.jpg\"\n          alt=\"Thumb\">\n          <p><a href=\"https://openmaptiles.org/\">OpenMapTiles</a> disrupted web cartography by allowing anyone to launch OpenStreetMap on their computer in minutes. For free! We estimate that maps generated by the OpenMapTiles are viewed by 250 million people every month.</p>\n\n<p>We are extremely happy that community involvement is steadily increasing and keen to help with boosting further growth. Do you want to know what is on the roadmap?</p>\n\n<h2 id=\"openstreetmap-vector-tiles-directly-frompostgis\">OpenStreetMap vector tiles directly from PostGIS</h2>\n<p>Apart from pre-generating tiles for weekly or monthly updates, the people around the project are developing <em>realtime</em> serving from PostGIS. It gives OpenMapTiles the ability to serve hourly or minute OSM updates with a tradeoff of higher hardware requirements, deployment and maintenance costs.</p>\n\n","link":"https://www.maptiler.com/news/2020/05/the-future-of-openmaptiles-project/","owner":"MapTiler"},{"title":"Understanding Destructuring, Rest Parameters, and Spread Syntax","description":"This article was originally written for DigitalOcean. Introduction Many new features for working with arrays and objects have been made…","link":"https://www.taniarascia.com/understanding-destructuring-rest-spread/","owner":"Tania Rascia"}]