[{"title":"Building a Monorepo with Yarn 2","description":"<p>In true JavaScript fashion, there was no shortage of releases in the JavaScript ecosystem this year. This includes the Yarn project’s release of Yarn 2 with a compressed cache of JavaScript dependencies, including a Yarn binary to reference,  that can be used for a zero-install deployment. </p>\n\n<p><img src=\"https://heroku-blog-files.s3.amazonaws.com/posts/1608668413-yarn.png\" alt=\"Ball of yarn and knitting needles illustration\"></p>\n\n<p>Yarn is a package manager that also provides developers a project management toolset. Now, Yarn 2 is now officially supported by Heroku, and Heroku developers are able to take advantage of leveraging zero-installs during their Node.js builds. We’ll go over a popular use case for Yarn that is enhanced by Yarn 2: using workspaces to manage dependencies for your monorepo.</p>\n\n<p>We will cover taking advantage of Yarn 2’s cache to manage monorepo dependencies. Prerequisites for this include a development environment with Node installed. To follow these","link":"https://blog.heroku.com/building-a-monorepo-with-yarn-2","owner":"HERE"},{"title":"How to Test React Components Using Jest","description":"\n            ","link":"https://www.sitepoint.com/clipboard-api/?utm_source=rss","owner":"Sift Science"},{"title":"Imgur’s 2020 Year in Review","description":"It’s time to sit back, relax, and revisit the moments that topped Imgur in 2020. Thank you for making Imgur a place to laugh together, learn new things, and connect...","link":"https://blog.imgur.com/2020/12/22/imgurs-2020-year-in-review/","owner":"Imaginea"},{"title":"Improving Kubernetes and container security with user namespaces","description":"Improving Kubernetes and container security with user namespaces Author: Alban Crequy\nIn this blog post, I will introduce user namespaces, explain why they are useful for containers and how they interact with Linux capabilities and filesystems. Then, I will explain the work we’ve done on two user namespace projects with Netflix: adding unprivileged user namespace support to FUSE and current work we’re doing to enable user namespaces in Kubernetes.\n  What are user namespaces?","link":"/blog/2020/12/improving-kubernetes-and-container-security-with-user-namespaces/","owner":"King"},{"title":"Know Your Privacy Rights","description":null,"link":"https://liveramp.com/engineering/know-your-privacy-rights/","owner":"LiveChat"}]