[{"title":"Nonparametric Cohen's d-consistent effect size","description":"<p>The effect size is a common way to describe a difference between two distributions.\nWhen these distributions are normal, one of the most popular approaches to express the effect size is <a href=\"https://en.wikipedia.org/wiki/Effect_size#Cohen's_d\">Cohen&rsquo;s d</a>.\nUnfortunately, it doesn&rsquo;t work great for non-normal distributions.</p>\n<p>In this post, I will show a robust Cohen&rsquo;s d-consistent effect size formula for nonparametric distributions.</p>\n<div class=\"row\">\n<div class=\"mx-auto\">\n<a href=\"https://aakinshin.net/posts/nonparametric-effect-size/img/blackboard.png\" target=\"_blank\" alt=\"blackboard\">\n<img\nclass=\"mx-auto d-block img-fluid\"\nwidth='800'\nsrc=\"https://aakinshin.net/posts/nonparametric-effect-size/img/blackboard.png\" />\n</a>\n</div>\n</div>\n<br />","link":"https://aakinshin.net/posts/nonparametric-effect-size/","owner":"Andrew Ray"},{"title":"Real-Time Location Changes with MongoDB Realm, Change Streams, and Mapbox","description":"\n                    <p>When it comes to modern web applications, interactions often need to be done in real-time. This means that instead of periodically checking in for changes, watching or listening for changes often makes more sense.</p>\n<p>Take the example of tracking something on a map. When it comes to package shipments, device tracking, or anything else where you need to know the real-time location, watching for those changes in location is great. Imagine needing to know where your fleet is so that you can dispatch them to a nearby incident?</p>\n<p>When it comes to MongoDB, watching for changes can be done through change streams. These change streams can be used in any of the drivers, including front-end applications with MongoDB Realm.</p>\n<p>In this tutorial, we&rsquo;re going to leverage <a href=\"https://www.mongodb.com/cloud/stitch\">MongoDB Realm</a> change streams. When the location data in our NoSQL documents change, we&rsquo;re going to update the information on an inter","link":"https://www.thepolyglotdeveloper.com/2020/06/real-time-location-updates-realm-change-streams-mapbox/","owner":"Nelson Elhage"},{"title":"Technical Interview Reform, Part 1: Rethinking the Backend Engineering Interview Take-Home Challenge","description":"Most SoundCloud backend engineers have good feelings about the old backend engineering take-home challenge. It’s commonly been characterized…","link":"https://developers.soundcloud.com/blog/rethinking-the-backend-code-challenge","owner":"Soshace"}]