[{"title":"Adding new BCC-based gadgets in Inspektor Gadget","description":"When asked for a good source to learn how to write BPF code I send people to the BPF Compiler Collection (BCC) project - https://github.com/iovisor/bcc. In addition to a C/C++ library for BPF and bindings in Python and LUA, it contains various tracing tools with clear examples of how to use them. It’s useful to read the source of those tools to learn the coding patterns with BPF.\nA number of the gadgets in Inspektor Gadget such as execsnoop and opensnoop are directly based on BCC tools execsnoop and opensnoop without modifications.","link":"/blog/2020/04/adding-new-bcc-based-gadgets-in-inspektor-gadget/","owner":"King"},{"title":"Announcing Serverless Components GA","description":"We're bringing Serverless Components out of beta and introducing several new features to deliver a dramatically improved serverless development experience.","link":"https://serverless.com/blog/serverless-components-ga/","owner":"Sensible"},{"title":"Engaging Endpoints: 4 Ways to Supplement GIF search","description":"We’d like to highlight four public API endpoints designed to increase engagement and create better user experiences for products and projects integrating GIPHY. At GIPHY, we use these endpoints to help users discover content and as ancillary features for our core GIF search experience — as we know a blank search input on a platform […]","link":"https://engineering.giphy.com/engaging-endpoints-4-ways-to-supplement-gif-search/","owner":"Gilt"},{"title":"How to Build a Multi-Region Application on CockroachDB","description":"If your company has a global customer base, you&#x2019;ll likely be building an application for users in different areas across the world. Deploying the application in just a single region can make high latencies a serious problem for users located far from the application&#x2019;s deployment region. Latency can dramatically affect user experience, and it can also lead to more serious problems with data integrity, like transaction contention. As a result, limiting latency is among the top priorities for global application developers.","link":"https://www.cockroachlabs.com/blog/multiregion-app-tutorial/","owner":"Cloudflare"},{"title":"Roll up to speed up: Improving OpenTSDB query performance","description":"","link":"https://medium.com/@SkyscannerEng/roll-up-to-speed-up-improving-opentsdb-query-performance-83a647cba4ac?source=rss-401f3b3c958f------2","owner":"Sky Betting & Gaming"}]