[{"title":"A Guide to Preview Deployments with Serverless CI/CD","description":"A closer look at working with Preview Deployments in the Serverless CI/CD solution.","link":"https://serverless.com/blog/preview-deployments/","owner":"Sensible"},{"title":"Enterprise Cloud Operations and Governance","description":"","link":"https://quickbooks-engineering.intuit.com/enterprise-cloud-operations-and-governance-fdb614919cc5?source=rss----aafcab06cc52---4","owner":"Intercom"},{"title":"How to Use CockroachDB with Your Django Application on Ubuntu","description":"Django is a high-level flexible framework for building Python applications quickly. Applications run on Django store data, by default, into a SQLite database file, but lots of Django users find themselves needing to switch to a more performant database in production, one with better availability or scalability.\nThis is a short tutorial on using Django with CockroachDB as your database. At the time of writing, django-cockroachdb library is available in two versions, (2 and 3).","link":"https://www.cockroachlabs.com/blog/django-application-on-ubuntu/","owner":"Cloudflare"},{"title":"Modules Part 04: Mirrors, Checksums and Athens","description":"Series Index Why and What\nProjects, Dependencies and Gopls\nMinimal Version Selection\nMirrors, Checksums and Athens\nGopls Improvements\nVendoring\nIntroduction One of the longer standing questions I had when first learning about modules was how the module mirror, checksum database and Athens worked. The Go team has written extensively about the module mirror and checksum database, but I hope to consolidate the most important information here. In this post, I provide the purpose of these systems, the different configuration options you have, and show these systems in action using example programs.","link":"https://www.ardanlabs.com/blog/2020/02/modules-04-mirros-checksums-athens.html","owner":"Wilfred Hughes"},{"title":"Node.js Async Best Practices & Avoiding the Callback Hell","description":"This post covers what tools and techniques you have at your disposal when handling Node.js asynchronous operations. Learn how to avoid the callback hell !","link":"https://blog.risingstack.com/node-js-async-best-practices-avoiding-callback-hell-node-js-at-scale/","owner":"Riot Games"}]