[{"title":"Accessible BuzzFeed","description":"","link":"https://tech.buzzfeed.com/accessible-buzzfeed-2e1f3f94f352?source=rss----140b2c7c3466---4","owner":"Brandwatch"},{"title":"From Legislation to Code: How Gusto helped customers maximize their PPP Loan Forgiveness","description":null,"link":"https://engineering.gusto.com/from-legislation-to-code-how-gusto-helped-customers-maximize-their-ppp-loan-forgiveness/","owner":"Guardian"},{"title":"Full Text Indexing and Search in CockroachDB","description":"In this post, I&#x2019;ll skim the surface of a very common pattern in application development: full text indexing and search.&#xA0; I&#x2019;ll start with a bit of motivation, what prompted me to explore this using CockroachDB.&#xA0; Next, I&#x2019;ll introduce the initial pass at a solution, followed by a deeper explanation of how that was done, and I&#x2019;ll then improve on that result by adding a &#x201C;score&#x201D;.&#xA0; Finally, I&#x2019;ll discuss the limitations of this simplistic approach, within the context of information retrieval, ending with my answer to &#x201C;So, why&#x2019;d you do it?","link":"https://www.cockroachlabs.com/blog/full-text-indexing-search/","owner":"Cloudflare"},{"title":"We Replaced an SSD with Storage Class Memory. Here is What We Learned.","description":"On April 2, 2019 Intel Optane Persistent Memory became the first \r\ncommercially available storage class memory (SCM). SCM is a storage device \r\nthat sits on a memory bus; in contrast, traditional storage devices like \r\nSSD are attached to the PCIe bus. We were interested how SCM, being much \r\ncloser to the CPU, affects performance of real applications. We compared \r\nthe performance of MongoDB’s storage engine WiredTiger on two Optane \r\nstorage devices: one packaged as SCM and another one packaged as SSD. \r\nAlthough these devices deliver vastly different performance when accessed \r\nin a raw form, their performance under the entire software stack, including \r\nOS, file system and the application, is not that different, because \r\nin-memory caches effectively mask latency.","link":"https://engineering.mongodb.com/post/we-replaced-an-ssd-with-storage-class-memory-here-is-what-we-learned","owner":"Mixpanel"}]