[{"title":"Accept Text Input from Users in a Phaser Game","description":"\n                    <p>When you create a game, you may find yourself needing to accept keyboard input from the user. I&rsquo;m not talking about using the keyboard to control your player, but instead to accept text from the keyboard to be used as a username or for the in-game chat.</p>\n<p>If you&rsquo;ve been keeping up with the Phaser content releasing on the blog, you might remember the tutorial titled, <a href=\"https://www.thepolyglotdeveloper.com/2020/07/creating-multiplayer-drawing-game-phaser/\">Creating a Multiplayer Drawing Game with Phaser and MongoDB</a>. This tutorial demonstrated taking user input to be used as the game information, but it did so with a bit of HTML hacking.</p>\n<p>There are better ways!</p>\n<p>In this tutorial we&rsquo;re going to see how to take user keyboard input directly within a <a href=\"http://phaser.io/\">Phaser</a> 3.x game using embedded HTML and JavaScript, rather than HTML layered on top of the game.</p>\n                    \n                      ","link":"https://www.thepolyglotdeveloper.com/2020/09/accept-text-input-user-phaser-game/","owner":"Nelson Elhage"},{"title":"Affinity Design Library","description":"","link":"https://build.affinity.co/affinity-design-library-d321969716fa?source=rss----c4f165841679---4","owner":"Addepar"},{"title":"Building an app with the Teamwork Developer Portal?","description":"","link":"https://engineroom.teamwork.com/building-an-app-with-the-teamwork-developer-portal-e4843579769e?source=rss----cea4eecd5960---4","owner":"TaskRabbit"},{"title":"High Efficiency Tool Platform for Framework Migration","description":null,"link":"https://tech.ebayinc.com/engineering/high-efficiency-tool-platform-for-framework-migration/","owner":"Dropbox"},{"title":"How to Get a Human Operator on the California EDD Paid Family Leave line","description":"The California EDD Paid Family Leave phone tree is like a choose your own adventure book, where almost every option leaves you with no option to contact a human. This can be frustrating. But you can reach a human if you know the right buttons to press! Here is how to reach a human: Call […]","link":"https://kevin.burke.dev/kevin/how-to-get-a-human-operator-on-the-california-edd-paid-family-leave-line/","owner":"K. Harrison"},{"title":"The Life-Changing Magic of Tidying Ruby Object Allocations","description":"<p>Your app is slow. It does not spark joy. This post will use memory allocation profiling tools to discover performance hotspots, even when they're coming from inside a library. We will use this technique with a real-world application to identify a piece of optimizable code in Active Record that ultimately leads to a patch with a substantial impact on page speed.</p>\n\n<p>In addition to the talk, I've gone back and written a full technical recap of each section to revisit it any time you want without going through the video.</p>\n\n<p>I make heavy use of theatrics here, including a Japanese voiceover artist, animoji, and some edited clips of Marie Kondo's Netflix TV show. This recording was done at EuRuKo on a boat. If you've got the time, here's the talk:</p>\n\n<div class=\"embedded-video-wrapper\">\n<iframe src=\"https://www.youtube-nocookie.com/embed/Aczy01drwkg?start=287\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></ifra","link":"https://blog.heroku.com/tidying-ruby-object-allocations","owner":"HERE"}]