[{"title":"[Linux] The most primitive clipboard manager you can ever find","description":"[Linux] The most primitive clipboard manager you can ever find","link":"https://yurichev.com/news/20200703_clipboard/","owner":"Dennis Felsing"},{"title":"An Open Door to Open Source: Relive our OSS Conference","description":"A quick recap At the end of last year, to celebrate our continued sponsorship of the Open Source community, we hosted a small conference with special guests at our Düsseldorf campus. We initially hoped to welcome Tobias Koppers and Sean Larkin from Webpack, plus some internal speakers. What we didn&rsquo;t expect was the huge amount of fantastic speakers who wanted to present their projects to the community. In the end, Sean unfortunately couldn&rsquo;t make it but we did have a chance to welcome Marvin Hagemeister, Juan Picado, Norbert de Langen and Pia Mancini as speakers, plus our own amazing talents.","link":"https://tech.trivago.com/2020/02/25/an-open-door-to-open-source-relive-our-oss-conference/","owner":"TripAdvisor"},{"title":"Announcing Support for AWS HTTP APIs","description":"The Serverless Framework now supports the AWS HTTP API - the v2 of API Gateway for HTTP APIs.","link":"https://serverless.com/blog/aws-http-api-support/","owner":"Sensible"},{"title":"Cracking my old Tiny C obfuscator","description":"Cracking my old Tiny C obfuscator","link":"https://yurichev.com/news/20200703_deobfuscation/","owner":"Dennis Felsing"},{"title":"Flatcar Container Linux enters new era after CoreOS End-of-Life announcement","description":"Almost two years ago, we launched Flatcar Container Linux , a drop-in replacement for CoreOS Container Linux. Since then, we’ve made almost 200 releases , added an experimental edge channel , released the update server - Nebraska , (re-)introduced ARM support (which had been dropped by Red Hat), and introduced the Kinvolk Flatcar Container Linux Subscription .\nBut Flatcar Container Linux is about to enter a new era.\nThe New Era Earlier this month, Red Hat announced the End of Life of CoreOS Container Linux will be May 26th.","link":"/blog/2020/02/flatcar-container-linux-enters-new-era-after-coreos-end-of-life-announcement/","owner":"King"},{"title":"Use the jOOQ-Refaster Module for Automatic Migration off of Deprecated jOOQ API","description":"Deprecation notice After encountering numerous problems building the jOOQ-refaster module in various JDK versions and after receiving no feedback from the community about this feature, we have decided to remove it again in jOOQ 3.15: https://github.com/jOOQ/jOOQ/issues/10803 Starting with jOOQ 3.13, we’re offering a new module called jOOQ Refaster, which provides refaster templates for automatic API … ","link":"https://blog.jooq.org/2020/02/25/use-the-jooq-refaster-module-for-automatic-migration-off-of-deprecated-jooq-api/","owner":"IPFS"}]