[{"title":"Production Node Applications with Docker — 3 DevOps Tips for Shutting Down Properly","description":"","link":"https://blog.evantahler.com/production-node-applications-with-docker-3-devops-tips-for-shutting-down-properly-ed54f09f0a7f?source=rss----6605676e3d60---4","owner":"Evan Miller"},{"title":"Suspicious discontinuities","description":"\n\n<p>If you read any personal finance forums late last year, there's a decent chance you ran across a question from someone who was desperately trying to lose money before the end of the year. There are a number of ways someone could do this; one commonly suggested scheme was to buy <a href=\"https://en.wikipedia.org/wiki/Put_option\">put options that were expected to expire worthless</a>, allowing the buyer to (probably) take a loss.</p>\n\n<p>One reason people were looking for ways to lose money was that, in the U.S., there's <a href=\"https://en.wikipedia.org/wiki/Patient_Protection_and_Affordable_Care_Act#Subsidy_Cliff_at_400%_FPL\">a hard income cutoff for a health insurance subsidy</a> at $48,560 for individuals (higher for larger households; $100,400 for a family of four). There are a number of factors that can cause the details to vary (age, location, household size, type of plan), but across all circumstances, it wouldn't have been uncommon for an individual going from one side of t","link":"https://danluu.com/discontinuities/","owner":"Daily Tech Video"},{"title":"TPDP Episode #33: Containers, Virtual Machines, and Orchestration, Part 1","description":"\n                    <p>I&rsquo;m pleased to announce that <strong>Containers, Virtual Machines, and Orchestration</strong> has been published to all of the popular podcast networks. This is the 33rd episode of the show and the first two-part episode to make an appearance.</p>\n<p>This episode features <a href=\"https://www.linkedin.com/in/mareksadowski/\">Marek Sadowski</a> from IBM and dives into the DevOps space, focusing particularly on deployment strategies such as virtual machines and containers, and how to orchestrate potentially massive amounts of them in an efficient and automated fashion.</p>\n<p>If you&rsquo;re not quite comfortable with Docker, virtual machines, Kubernetes (K8s), and similar, this is an episode you should listen to, since all are very relevant and necessary skills for developers.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/02/tpdp-e33-containers-virtual-machines-orchestration-par","link":"https://www.thepolyglotdeveloper.com/2020/02/tpdp-e33-containers-virtual-machines-orchestration-part-1/","owner":"Nelson Elhage"}]