[{"title":"Hiding Text in Kotlin – How many ways?","description":null,"link":"https://blog.blundellapps.co.uk/hiding-text-in-kotlin-how-many-ways/","owner":"Blundell's Android Tutorials"},{"title":"Hoare’s Rebuttal and Bubble Sort’s Comeback","description":"<p><em><strong>Editor’s note</strong>: For this blog entry I welcome my friend and colleague Gerben Stavenga\nas a guest author.</em></p>\n\n<p>Recently Andrei Alexandrescu published an interesting\n<a href=\"https://dlang.org/blog/2020/05/14/lomutos-comeback/\">post</a> about optimizing\nQuickSort using the Lomuto partition scheme. The essence of that post is that\nfor many situations the performance of QuickSort is completely dominated by\nbranch mispredicts and that a big speed up can be achieved by writing\nbranchless code. This has been observed by many, and various branchless\nsorting routines have been proposed. Andrei observed that from the two well\nknown QuickSort partitioning schemes Lomuto is easily implemented branchless,\nand this indeed performs much better for sorting small primitives. I recently\nexperimented with similar ideas but took them in a different but interesting\ndirection. I discovered that a hybrid of the Hoare and Lomuto schemes can \ndeliver a large improvement even comp","link":"https://blog.reverberate.org/2020/05/29/hoares-rebuttal-bubble-sorts-comeback.html","owner":"Josh Haberman"},{"title":"Maps for Dark mode","description":"\n          <img src=\"https://www.maptiler.com/media/2020-05-29-maps-for-dark-mode-1.png\"\n          alt=\"Thumb\">\n          <p>Are you creating a mobile app or website with dark mode and looking for a map to fit the design? Try Dark and Night maps or create your own!</p>\n\n<h2 id=\"dark-and-night-mapstyles\">Dark and Night map styles</h2>\n<p><a href=\"https://www.maptiler.com/maps/#b992018d-d296-4562-9e33-2f86e28d0e2c//vector/4/13/49\">The Dark style</a> is a black map designed to minimize the distraction of users, who can focus on data you are presenting on top of them without being interrupted. Everything is as dim as possible and the contrast is just enough to make the map still readable.</p>\n\n<p><a href=\"https://www.maptiler.com/maps/#c72c5f44-e155-44db-9c04-f72551125b5c//vector/4/13/49\">The Night map</a> is more <em>“fancy”</em>. Labels have high contrast and it is easy-to-read. The Night map can be used in apps where you don’t want to blind your users with a white map, e.g. for navigati","link":"https://www.maptiler.com/news/2020/05/maps-for-dark-mode/","owner":"MapTiler"},{"title":"Meta-Graph: Few-Shot Link Prediction Using Meta-Learning","description":null,"link":"https://eng.uber.com/meta-graph/","owner":"Uber"}]