[{"title":"DeveloperBridge: SoundCloud’s Program for Training People from Diverse Backgrounds to Become Engineers","description":"DeveloperBridge is a year-long, full-time, paid traineeship program where participants learn from and work with engineering teams at…","link":"https://developers.soundcloud.com/blog/developerbridge-training-program","owner":"Soshace"},{"title":"EU Privacy Shield No Match for the Cockroach","description":"On July 16, 2020, the European Court of Justice got rid of the four-year-oldPrivacy Shield agreement struck between the U.S. and the EU that had exposed Europeans to possible U.S. surveillance. The agreement had also allowed U.S. companies like Facebook and Google to store data about European residents outside of the region.&#xA0;\nThis move is yet another great example of the EU doing &#x201C;right&#x201D; by their constituents and holding tech companies responsible for their users&apos; data privacy.","link":"https://www.cockroachlabs.com/blog/privacy-shield-data-compliance/","owner":"Cloudflare"},{"title":"Google Cloud Workload-Placement-Guide","description":"At trivago we operate a hybrid infrastructure of both on-premise machines and clusters on Google Cloud. Over time, we came up with a set of deployment guidelines for running our workloads as more and more of them are migrating to Google Cloud. These are not strict rules, but rather suggestions to best serve each team&rsquo;s needs.\nTeams are meant to have full control over their workloads, but most of the time they &ldquo;just want to run things&rdquo; and do not have the time or resources to care much about managing the underlying infrastructure.","link":"https://tech.trivago.com/2020/07/17/google-cloud-workload-placement-guide/","owner":"TripAdvisor"},{"title":"How I built my first search component in React","description":"\n<p>In 2016, I was working to build a <a href=\"https://letzchange.org/\" target=\"_blank\">platform</a> to help NGOs raise donations. The platform was supposed to be built using React. The beautiful designs were in place. I was excited to build some new features as well as to try out the new architecture using Redux on a larger scale.</p>\n\n<p>Yes, this was the time when Redux was fairly new. React still had PropTypes package attached to its core. The lifecycle method <code class=\"language-plaintext highlighter-rouge\">componentWillReceiveProps</code> used to dominate the scene.</p>\n\n<p>Out of the many design components that I worked while building that platform, I am going to discuss my first search component in React here.</p>\n\n<h3 id=\"elements-of-a-search-bar\">Elements of a search bar</h3>\n\n<p>The search bar was a simple input field placed at the middle of the main header. The design idea was to have a search component which displays results as soon as the user inputs something in it. Th","link":"http://engineering.hackerearth.com/2020/07/17/how-i-built-my-first-search-component/","owner":"Gusto"},{"title":"Prophecy: Teamwork’s Data Lake","description":"","link":"https://engineroom.teamwork.com/prophecy-teamworks-data-lake-1a8ebb6dd3ae?source=rss----cea4eecd5960---4","owner":"TaskRabbit"}]