[{"title":"A real world use case with Elixir Recursion","description":"Recently, I was working on writing a background worker using Elixir for one of our clients. There was a requirement to update records in a database table &amp; also update those many records in another table. This post is about how I used Recursion to solve this use case.\nI am working on an application where there are orders for each account. The background worker will search all orders which are pending &amp; mark them completed &amp; update those related accounts.","link":"https://crypt.codemancers.com/posts/2020-07-29-a-real-world-use-case-with-elixir-recursion/","owner":"Codelitt"},{"title":"Announcing the winners of Codegeist 2020","description":null,"link":"https://blog.developer.atlassian.com/announcing-the-winners-of-codegeist-2020/","owner":"Asana"},{"title":"Creating a Multiplayer Drawing Game with Phaser and MongoDB","description":"\n                    <p>When it comes to MongoDB, an often overlooked industry that it works amazingly well in is gaming. It works great in gaming because of its performance, but more importantly its ability to store whatever complex data the game throws at it.</p>\n<p>Let&rsquo;s say you wanted to create a drawing game like <a href=\"https://en.wikipedia.org/wiki/Pictionary\">Pictionary</a>. I know what you&rsquo;re thinking: why would I ever want to create a Pictionary game with MongoDB integration? Well, what if you wanted to be able to play with friends remotely? In this scenario, you could store your brushstrokes in MongoDB and load those brushstrokes on your friend&rsquo;s device. These brushstrokes can be pretty much anything. They could be images, vector data, or something else entirely.</p>\n<p>A drawing game is just one of many possible games that would pair well with MongoDB.</p>\n<p>In this tutorial, we&rsquo;re going to create a drawing game using <a href=\"https://phaser.io/\">P","link":"https://www.thepolyglotdeveloper.com/2020/07/creating-multiplayer-drawing-game-phaser/","owner":"Nelson Elhage"}]