[{"title":"A Guide to Serverless Deployment with Express and MongoDB","description":"\n            ","link":"https://www.sitepoint.com/best-monospace-fonts-for-developers/?utm_source=rss","owner":"SitePoint"},{"title":"Add Apple Watch authentication to sudo","description":"Since 1Password added Apple Watch unlock I've wondered if there are other situations when I need to enter my password where it instead require a click of my Watch instead. I recently came across an article about how to make sudo work with Touch ID, which is nice, but my iMac Pro doesn't have Touch ID. I went searching though and found pam-watchid! This is a PAM module for using the Watch – exactly what… ","link":"https://akrabat.com/add-apple-watch-authentication-to-sudo/","owner":"Rob Allen"},{"title":"Connect platforms","description":"You can now use separate charges and transfers and account debits with your Express and Custom connected accounts.","link":"https://stripe.com/docs/connect/charges-transfers","owner":"Stripe"},{"title":"How We Built Scalable Spatial Data & Spatial Indexing in CockroachDB","description":"Support for spatial data and spatial indexing is one of the most requested features in the history of CockroachDB. The first issue requesting spatial data in CockroachDB was opened in October 2017, and closed on November 12, 2020 with the release of spatial data storage in CockroachDB 20.2. Spatial data, sometimes called geospatial data, is data that contains information about geographic (and geometric) features, with PostGIS being one of the most popular spatial data extensions in use.","link":"https://www.cockroachlabs.com/blog/how-we-built-spatial-indexing/","owner":"CockroachDB"},{"title":"The Import On Interaction Pattern","description":"Tip: Lazy-load non-critical resources when a user interacts with UI requiring it. Your page may contain code or data for a component or resource that isnt immediately necessary. For example, UI a user doesnt see unless they click or scroll on parts of the page. This can apply to many kinds of first-party code you author, but this also applies to third-party widgets such as video players or chat widgets where you typically need to click a button to display the main interface.","link":"https://addyosmani.com/blog/import-on-interaction/","owner":"Addy Osmani"},{"title":"The only good thing of 2020: ANTLR 4.9","description":null,"link":"https://tomassetti.me/the-only-good-thing-of-2020-antlr-4-9/","owner":"Federico Tomassetti"}]