[{"title":"Building a Protest Map: A Behind the Scenes Look!","description":null,"link":"https://www.eventbrite.com/engineering/building-a-protest-map-a-behind-the-scenes-look/","owner":"Etsy"},{"title":"NoSQL vs. NewSQL vs. Distributed SQL: DZone's 2020 Trend Report","description":"Databases are evolving. For the past decade, we&#x2019;ve read thinkpiece after thinkpiece taking firm stances on the &#x201C;SQL vs. NoSQL&#x201D; debate--some of which declaratively pronounce the death of SQL or the death of NoSQL. In DZone&#x2019;s annual report on SQL v NoSQL database usage, we&#x2019;re excited to see that we&#x2019;re moving beyond that paradigm. What we&#x2019;re seeing in this report is more nuanced, and a lot more exciting: the death of the &#x201C;SQL vs.","link":"https://www.cockroachlabs.com/blog/dzone-sql-trend/","owner":"Cloudflare"},{"title":"REST API: Sorting, Filtering, and Pagination","description":"Web applications often have tables of data, whether it's the list of items for sale on Amazon, or notes in Evernote, and so on. Usually…","link":"https://www.taniarascia.com/rest-api-sorting-filtering-pagination/","owner":"Swizec Teller"},{"title":"Switch Between Scenes in a Phaser Game","description":"\n                    <p>When you&rsquo;re building a game, you&rsquo;re probably going to have more than one screen. For example, you might have an initial menu screen, a main gameplay screen, and a game over screen. These screens can be thought of as scenes in a game, the same way you can think of scenes in film.</p>\n<p>Every scene that you have in your game represents a clean slate, or a fresh starting point for that particular subsection of content.</p>\n<p>In this tutorial, we&rsquo;re going to see how to create multiple scenes, switch between them, and pass data between them, using <a href=\"http://phaser.io/\">Phaser</a> 3.x and simple JavaScript.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/09/switch-between-scenes-phaser-game/'>Switch Between Scenes in a Phaser Game</a> appeared first on <a rel='nofollow' href='https://www.thepolyglotdeveloper.com'>The Polyglot Developer</a>.</p>\n                    ","link":"https://www.thepolyglotdeveloper.com/2020/09/switch-between-scenes-phaser-game/","owner":"Nelson Elhage"}]