[{"title":"eBay’s Offers to Buyers Feature Hits $1B GMV","description":null,"link":"https://tech.ebayinc.com/product/ebays-offers-to-buyers-feature-hits-1b-gmv/","owner":"Ebay"},{"title":"Everything Nodes and the Scattered Stone","description":"The much anticipated first installment of the everything nodes projects is finally integrated.","link":"https://code.blender.org/2020/12/everything-nodes-and-the-scattered-stone/","owner":"Blender"},{"title":"Maps for Adobe After Effects","description":"\n          <img src=\"https://www.maptiler.com/media/2020-12-02-how-to-add-maps-into-your-video-1.png\"\n          alt=\"Thumb\">\n          <p>Maps are crucial tools to give your stories geographic context. For visual content creators, the <a href=\"https://www.maptiler.com/cloud/geolayers/\">GEOlayers plugin</a> in Adobe After Effects is a powerful tool for adding maps into videos.</p>\n\n<p>MapTiler has partnered with GEOlayers to offer its pre-made and fully customizable maps into Adobe After Effects.</p>\n\n<h2 id=\"geolayers-plugin-for-adobe-aftereffects\">GEOlayers plugin for Adobe After Effects </h2>\n<p>Maps in a video can serve more purposes than just pinpointing a place being discussed. Maps might highlight different objects, trace them on the move, visualize data about selected areas, and compare areas. These geographic visuals can also serve as purely artistic features.</p>\n\n<p>It is possible to use static maps in videos, however, this detracts from the overall flow and feeling conveyed ","link":"https://www.maptiler.com/news/2020/12/how-to-add-maps-into-your-video/","owner":"MapTiler"},{"title":"The experiences of Product Software Engineers in Customer Success","description":"","link":"https://medium.com/feedzaitech/the-experiences-of-product-software-engineers-in-customer-success-aaef7a74e306?source=rss----e11168e7fe6b---4","owner":"Feedzai"},{"title":"Upgrade Your Azure Instances to Flatcar Container Linux Pro","description":"Recently, we introduced a new offer into the Flatcar Container Linux line-up, the Pro edition of Flatcar. Available in the Azure Marketplace , Flatcar Pro offers a number of advantages over the free community edition of Flatcar, including:\n  Azure-Tuned Linux Kernel , optimally configured for Azure out of the box.  Commercial Support : in the event of any issues, the Kinvolk support team is standing by and ready to help, working closely with our counterparts in Microsoft.","link":"/blog/2020/12/upgrade-your-azure-instances-to-flatcar-container-linux-pro/","owner":"Kinvolk"},{"title":"Using jenv to select Java version on macOS","description":"When working on OpenWhisk, I discovered that it needed a different Java to the one I had installed. Looking around the Internet, I discovered jenv which shouldn't have surprised me as I use pyenv and I'm aware of rbenv too. As I use Homebrew, these are the commands I used. Firstly install jenv, the latest Java (15 at this time) and any other versions you need. Java 8 and 12 in this example: $ brew… ","link":"https://akrabat.com/using-jenv-to-select-java-version-on-macos/","owner":"Rob Allen"},{"title":"Why CockroachDB and PostgreSQL Are Compatible","description":"CockroachDB is built to be largely compatible with PostgreSQL, meaning that software written to use PostgreSQL can often be used with CockroachDB without changes.\nWhy is CockroachDB compatible with PostgreSQL? Perhaps surprisingly, at the time of writing (early May 2018), the answer to this question had not been documented publicly on the CockroachDB web site, nor in the CockroachDB docs, nor in CockroachDB-related articles in third party sources.\nI was lucky to sit next to Cockroach Labs Chief Architect and Co-Founder Ben Darnell when Lakshmi Kannan, now the general manager of CockroachCloud, asked us the very same question: Why was CockroachDB designed to be compatible with PostgreSQL?","link":"https://www.cockroachlabs.com/blog/why-postgres/","owner":"CockroachDB"},{"title":"Xcode Targets Arent Schemes","description":"","link":"https://tech.olx.com/xcode-targets-arent-schemes-a087ac4bbe3a?source=rss----761b019b483f---4","owner":"OLX"}]