[{"title":"Being a principal engineer at Skyscanner","description":"","link":"https://medium.com/@SkyscannerEng/being-a-principal-engineer-at-skyscanner-1830dfa17d30?source=rss-401f3b3c958f------2","owner":"Sky Betting & Gaming"},{"title":"Clang on Windows","description":"<p>Thanks to the MSYS2 project, now there is an easy way to utilize Clang to build C/C++ application on Windows. This works equally well for both 32-bit and 64-bit programs.</p>\n\n<p><a href=\"https://www.msys2.org/\">MSYS2</a> is a fantastic (and better) reimagination of <a href=\"https://www.cygwin.com/\">Cygwin</a>, it is like taking the best part of a typical modern Unix environment (a familiar shell, a general collection of utilities, a porting layer, a package manager, and so on) while still working on Windows. Bootstrapping into MSYS2 is easy, either install it directly (using the GUI installer) or use <a href=\"https://chocolatey.org/\">Chocolatey</a>: <code>choco install msys2</code>. Once inside its shell, <code>pacman</code> is the go-to,  ever-so-powerful <a href=\"https://github.com/msys2/msys2/wiki/Using-packages\">package manager</a>, with thousands of packages available at your disposal.</p>\n\n<p>This of course, includes the toolchain. Not only the latest GCC is there, but we als","link":"https://ariya.io/2020/01/clang-on-windows","owner":"Ariejan de Vroom"},{"title":"Prometheus at Prezi: replacing 10 years of anti-patterns","description":"","link":"https://engineering.prezi.com/prometheus-at-prezi-replacing-10-years-of-anti-patterns-e3c2317e6ca?source=rss----911e72786e31---4","owner":"Postmates"},{"title":"What is the random oracle model and why should you care? (Part 5)","description":"This is part five of a series on the Random Oracle Model.  See here for the previous posts: Part 1: An introduction Part 2: The ROM formalized, a scheme and a proof sketch Part 3: How we abuse the ROM to make our security proofs work Part 4: Some more examples of where the ROM … ","link":"https://blog.cryptographyengineering.com/2020/01/05/what-is-the-random-oracle-model-and-why-should-you-care-part-5/","owner":"Matt Warren"}]