[{"title":"An Exploration of Flavour","description":"<p>I came across a screenshot the other day that had a list of projects that I had built over 10 years ago. There was a Flickr app, a Twitter app, a job site, an ad platform. I had forgotten how prolific I was at one time. </p>\r\n\r\n<p>I definitely fell into a rut there. </p>\r\n\r\n<p>Lately, though, I’ve been getting back into exploring design and flexing my design and front-end skills on some personal projects. Last year, I launched <a href=\"https://fifty.snook.ca/\">Fifty</a> to document a food adventure. I played around with CSS grids and took inspiration from magazines to create a design I was proud of. Months later, I’m still loading up the site just to stare at it. Feels good, y’all.</p>\r\n\r\n<p>Along those lines, I’ve jumped heavily into the world of whisky. I’ve attended <a href=\"https://webwhiskyweekend.com/\">Web Whisky Weekend</a> for the last fives years, which has been a fantastic way to explore whisky. Last year, we had 150 different bottles. Crazy. </p>\r\n\r\n<p>Over those five yea","link":"http://snook.ca/archives/design/an-exploration-of-flavour","owner":"Jonathan Dekhtiar"},{"title":"Another Website Redesign - and Making the Internet Better","description":"At the age of 9, when I was too shy, young, inexperienced, and insecure to know how to make friends in the real world, I discovered the…","link":"https://www.taniarascia.com/another-website-redesign/","owner":"Swizec Teller"},{"title":"Auto Deploy to Heroku Using Gitlab CI","description":"As of now, Heroku doesn&rsquo;t support auto-deploy from GitLab. So we have to use Gitlab CI to deploy to Heroku. This post will help you to set up auto deploy to Heroku.\nFor this blog post, we will take a rails app with a Postgres database. We need Gitlab to run the unit tests and deploy to staging and then later to production.\nFor staging and production, we will keep different branches to make things simpler.","link":"https://crypt.codemancers.com/posts/2020-06-26-auto-deploy-to-heroku-using-gitlab-ci/","owner":"Codelitt"},{"title":"Dgraph Database Semantics","description":"Introduction In this paper written by Manish Jain (the founder of Dgraph) he describes Dgraph as:\na distributed graph database which provides horizontal scalability, distributed cluster-wide ACID transactions, low-latency arbitrary-depth joins, synchronous replication, high availability, and crash resilience.\nThere are many claims being stated here which frankly I didn’t understand the meaning of the first time I read this sentence. I decided I wanted to better understand these claims with the hope that it would help me understand Dgraph’s architecture and engineering decisions better.","link":"https://www.ardanlabs.com/blog/2020/06/dgraph-database-semantics.html","owner":"Wilfred Hughes"},{"title":"Technical Interview Reform, Part 2: The Recruiting Perspective and Results","description":"Please also see Part 1: Rethinking the Backend Engineering Interview Take-Home Challenge Among the engineering groups at SoundCloud, backend…","link":"https://developers.soundcloud.com/blog/backend-code-challenge-recruiting-perspective-and-results","owner":"Soshace"}]