[{"title":"Can I Run a Database In Kubernetes?","description":"About 75 percent of container orchestration is done in Kubernetes. But the popularity of the k8s platform doesn&rsquo;t mean it&rsquo;s easy to use in all scenarios. Kubernetes can have a steep learning curve, especially when it comes to managing state and storage. In a recent episode of &ldquo;The Cockroach Hour&rdquo;, Director of Product Marketing Jim Walker sat down with Keith McClellan, one of Cockroach&rsquo;s Solutions Engineers, to chat about the storage and data challenges that you&rsquo;ll encounter deploying Kubernetes, and how running it with CockroachDB can simplify those challenges.","link":"https://www.cockroachlabs.com/blog/kubernetes-databases/","owner":"CockroachDB"},{"title":"How to get the most out of Salesforce data: from Business to Data Science","description":"","link":"https://jobandtalent.engineering/how-to-get-the-most-out-of-salesforce-data-from-business-to-data-science-41e539fe212e?source=rss----66415b986b2d---4","owner":"Jobandtalent"},{"title":"TPDP E38: COBOL Development on the Mainframe","description":"\n                    <p>If you&rsquo;re interested in learning about COBOL, you&rsquo;ll find a lot of value in, <strong>COBOL Development on the Mainframe</strong>, the latest episode of The Polyglot Developer Podcast.</p>\n<p>There&rsquo;s been a lot of buzz around COBOL in recent news, which is amazing considering how far the programming technology dates back. In this episode of the podcast, I&rsquo;m joined by <a href=\"https://www.linkedin.com/in/elizabethkjoseph/\">Elizabeth Joseph</a> from IBM, and we discuss the things that COBOL does well, where it&rsquo;s used the most, and why it&rsquo;s making such a huge comeback.</p>\n<p>You don&rsquo;t have to be a system admin, mainframe developer, or COBOL expert to get a lot of value out of this episode.</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/2020/07/tpdp-e38-cobol-development-mainframe/'>TPDP E38: COBOL Development on the Mainframe</a> appeared first on <a","link":"https://www.thepolyglotdeveloper.com/2020/07/tpdp-e38-cobol-development-mainframe/","owner":"Nic Raboy"},{"title":"Venmo Launches Limited Pilot of New Tools for Sole Proprietors with the Introduction of Business Profiles ","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2020/6/30/venmo-pilots-new-tools-for-sole-proprietors-with-the-introduction-of-business-profiles","owner":"Venmo"}]