[{"title":"CakePHP Tips Winter 2020","description":"Over the last months, I collected some useful tips again for CakePHP apps and development you might find useful. Data Integrity for your DB content I usually also don’t take this into account when creating new table relations, even though...","link":"https://www.dereuromark.de/2020/02/25/cakephp-tips-winter-2020/","owner":"Dereuromark"},{"title":"Power to the People","description":"\n\n<p>When you upload photos to Instagram, back up your phone to “the cloud”, send an email through GMail, or save a document in a storage application like Dropbox or Google Drive, your data is being saved in a data center. These data centers are airplane hangar-sized warehouses, packed to the brim with racks of servers and cooling mechanisms. Depending on the application you are using you are likely hitting one of Facebook’s, Google’s, Amazon’s, or Microsoft’s data centers. Aside from those major players, which we will call the “hyperscalers”, many other companies run their own data centers or rent space from a colocation center to house their server racks.</p>\n\n<p>Most of the hyperscalers have made massive strides to get a “carbon neutral” footprint for their data centers. Google, Amazon, and Microsoft have all pledged to decarbonize completely, however none has succeeded in completely ditching fossil fuels as of yet. If a company claims to be “carbon neutral” it means they are offset","link":"https://blog.jessfraz.com/post/power-to-the-people/","owner":"Jessie Frazelle"},{"title":"Querying a GraphQL API in a React Web Application","description":"\n                    <p>GraphQL is becoming all the rage, what with being able to query an API like you can query a database. There are two aspects when it comes to GraphQL development, the first being around creating GraphQL APIs and the other around creating applications that can query those APIs.</p>\n<p>If you&rsquo;ve been keeping up, you&rsquo;re probably already familiar with my courses, <a href=\"https://courses.thepolyglotdeveloper.com/p/web-services-for-the-go-developer\">Web Services for the Go Developer</a>, and <a href=\"https://courses.thepolyglotdeveloper.com/p/web-services-for-the-javascript-developer\">Web Services for the JavaScript Developer</a>. In these courses we saw how to create a GraphQL API. Looking at things in the other direction, you might remember my tutorials, <a href=\"https://www.thepolyglotdeveloper.com/2019/01/query-graphql-api-android-ios-nativescript-angular/\">Query a GraphQL API on Android and iOS with NativeScript and Angular</a>, and <a href=\"https://w","link":"https://www.thepolyglotdeveloper.com/2020/02/querying-a-graphql-api-in-a-react-web-application/","owner":"Nic Raboy"},{"title":"React v16.13.0","description":null,"link":"https://reactjs.org/blog/2020/02/26/react-v16.13.0.html","owner":"React"},{"title":"V-Drum Explorer: Memory and 7-bit addressing","description":"So, just to recap, I’m writing an explorer for my Roland V-Drums set (currently a TD-17, but with a TD-27 upgrade on the way, excitingly). This involves copying configuration data from the module (the main bit of electronics involved) into the application, displaying with it, editing it, then copying it back again so that I … ","link":"https://codeblog.jonskeet.uk/2020/02/25/v-drum-explorer-memory-and-7-bit-addressing/","owner":"Jon Skeet"}]