[{"title":"A Drone Hugo plugin that works","description":"This article contains some background to why I wrote this plugin. If you just want to use it, see github.com/ariejan/drone-hugo for details.\n I recently moved away from Gitlab + Gitlab CI to a Gitea + Drone setup. Both Gitea and Drone are lightweight and fast, and let&rsquo;s be honest, more than enough for an engineering enthusiast like myself. They now also run on my NAS Homelab Server as docker containers, which helps to save a few bucks every month in hosting fees.","link":"https://www.devroom.io/2020/03/11/a-drone-hugo-plugin-that-works/","owner":"Antirez"},{"title":"How (some) good corporate engineering blogs are written","description":"\n\n<p>I've been comparing notes with people who run corporate engineering blogs and one thing that I think is curious is that it's pretty common for my personal blog to get more traffic than the entire corp eng blog for a company with a nine to ten figure valuation and it's not uncommon for my blog to get an order of magnitude more traffic.</p>\n\n<p>I think this is odd because tech companies in that class often have hundreds to thousands of employees. They're overwhelmingly likely to be better equipped to write a compelling blog than I am and companies get a lot more value from having a compelling blog than I do.</p>\n\n<p>With respect to the former, employees of the company will have done more interesting engineering work, have more fun stories, and have more in-depth knowledge than any one person who has a personal blog. On the latter, my blog helps me with job searching and it helps companies hire. But I only need one job, so more exposure, at best, gets me a slightly better job, wherea","link":"https://danluu.com/corp-eng-blogs/","owner":"Daily Tech Video"},{"title":"New Ionic 5 Angular 8 Display, Update and Delete Records with RxJS","description":"<div class=\"bigInt\" itemprop=\"description\">This post is about displaying the API records with delete and update actions using new Ionic and Angular reactive programming. This is a continuation of <a href=\"https://www.9lessons.info/2019/09/ionic-5-and-angular-8-restful-api-user.html\" target=\"_blank\">Ionic Angular series</a> and it explains to you how to distribute the data between the components using RxJS method like BehaviorSubject. All of the feed API responses/records storing in a reactive object, This help  the application DOM works seamlessly with update and delete operations. Implement this to your side project and enrich your applications. </div><br><div class=\"cen\"><img alt=\"New Ionic 5 Angular 8 Update and Delete Records with RxJS \" class=\"sri650\" itemprop=\"image\" src=\"https://github.com/srinivastamada/9lessonsImages/blob/master/new-ionic/ionic-update.png?raw=true\"></div><br><a href=\"http://www.9lessons.info/2019/11/ionic-angular-update-delete-rxjs.html#more\"></a><div class=\"f","link":"http://feedproxy.google.com/~r/9lesson/~3/D0OGT5gThGk/ionic-angular-update-delete-rxjs.html","owner":"Simon Reimler"},{"title":"TPDP Episode #34: Containers, Virtual Machines, and Orchestration, Part 2","description":"\n                    <p>I&rsquo;m pleased to announce that the second part of the <strong>Containers, Virtual Machines, and Orchestration</strong> podcast episode, featuring <a href=\"https://www.linkedin.com/in/mareksadowski/\">Marek Sadowski</a> from IBM, has been published!</p>\n<p>Marek and I had run out of time in the first episode which focused on container and virtual machine strategies, so we didn&rsquo;t get to dive deep into Kubernetes and similar orchestration services like Red Hat OpenShift. However, in this episode we pick up where we left off and talk about exactly that, Kubernetes (K8s) and OpenShift, and how they differ or how one might be more beneficial than the other.</p>\n<p>If you&rsquo;re new to the container orchestration world and are sure how to make sense of all the terminology, strategies, and best practices, this episode of the podcast is something you should take time to listen to.</p>\n                    \n                        <p>The post <a rel='nofollow' h","link":"https://www.thepolyglotdeveloper.com/2020/03/tpdp-e34-containers-virtual-machines-orchestration-part-2/","owner":"Nelson Elhage"}]