[{"title":"A Python sqlite3 context manager gotcha","description":"I’ve neglected this blog for a while – partly due to the chaos of 2020 (which is not great), and partly due to being busy with work (which is good!). Anyway, I’m starting to pick it up again, and I thought I’d start with something that caught me out the other day. So, let’s start […]","link":"http://blog.rtwilson.com/a-python-sqlite3-context-manager-gotcha/","owner":"Robin Ward"},{"title":"Automatically Transform Oracle Style Implicit Joins to ANSI JOIN using jOOQ","description":"While jOOQ is mostly being used as an internal SQL DSL for embedded, dynamic SQL in Java, where it offers the best solution on the market, jOOQ is increasingly also used for one of its secondary features: Its parser. Having been introduced in jOOQ 3.9 primarly for the purpose of being able to parse DDL … ","link":"https://blog.jooq.org/2020/11/17/automatically-transform-oracle-style-implicit-joins-to-ansi-join-using-jooq/","owner":"IPFS"},{"title":"Case Study: Building a Mobile Game with Dart and Flutter","description":"Master the Hero animation, state management, importing 3rd party dependencies, multiple screens, navigation, storing persistent data, vibration & more..","link":"https://blog.risingstack.com/case-study-dart-flutter-mobile-game/","owner":"Riot Games"},{"title":"eBay’s Technology Transformation is Made for Evolving Customer Needs ","description":null,"link":"https://tech.ebayinc.com/engineering/ebays-technology-transformation-is-made-for-evolving-customer-needs/","owner":"Dropbox"},{"title":"Expanding Flatcar Container Linux Offerings for Enterprise and Cloud","description":"To coincide with the first day of KubeCon North America , we are excited to share that we are expanding the family of Flatcar Container Linux distributions, with Flatcar Container Linux Pro and Long-Term Support (LTS) editions, as well as cloud marketplace availability of Flatcar in Azure, AWS, and Google Cloud.\nWith hundreds of millions of usage hours across in the last six months alone, Flatcar has built upon its CoreOS heritage to establish itself as the Kubernetes community’s favorite container-optimized Linux distribution.","link":"/blog/2020/11/expanding-flatcar-container-linux-offerings-for-enterprise-and-cloud/","owner":"King"},{"title":"Exploring the Page Visibility API for Detecting Page Background State","description":"At trivago we are working heavily on the web platform and, based on the scale that we need to serve our users, our applications need to cater for many different kinds of environments and conditions.\nAs one of our use cases demanded we look into how a background (and possibly terminating) state is defined in the modern web, we investigated the options and discovered a few interesting points, specifically about thePage Visibility API.","link":"https://tech.trivago.com/2020/11/17/exploring-the-page-visibility-api-for-detecting-page-background-state/","owner":"TripAdvisor"},{"title":"Getting Kubernetes logs into BigQuery cost-effectively","description":"","link":"https://devblog.songkick.com/getting-kubernetes-logs-into-bigquery-cost-effectively-bc6b67ddb923?source=rss----e0e3c74f91b8---4","owner":"Snyk"},{"title":"Nailing the handoff","description":"","link":"https://tech.instacart.com/nailing-the-handoff-b4052003085c?source=rss----587883b5d2ee---4","owner":"Indeed"},{"title":"Plain-text summary notation for multimodal distributions","description":"<p>Let&rsquo;s say you collected a lot of data and want to explore the underlying distributions of collected samples.\nIf you have only a few distributions, the best way to do that is to look at the density plots\n(expressed via histograms, kernel density estimations, or <a href=\"https://aakinshin.net/posts/qrde-hd/\">quantile-respectful density estimations</a>).\nHowever, it&rsquo;s not always possible.</p>\n<p>Suppose you have to process dozens, hundreds, or even thousands of distributions.\nIn that case,\nit may be extremely time-consuming to manually check visualizations of each distribution.\nIf you analyze distributions from the command line or send notifications about suspicious samples,\nit may be impossible to embed images in the reports.\nIn these cases, there is a need to present a distribution using plain text.</p>\n<p>One way to do that is plain text histograms.\nUnfortunately, this kind of visualization may occupy o lot of space.\nIn complicated cases, you may need 20 or 30 lines per ","link":"https://aakinshin.net/posts/modality-summary-notation/","owner":"Andrew Ray"},{"title":"Railgun: A new weapon for mission critical streaming tasks","description":"","link":"https://medium.com/feedzaitech/railgun-a-new-weapon-for-mission-critical-streaming-tasks-6432dd66a244?source=rss----e11168e7fe6b---4","owner":"Faraday"},{"title":"Why I Left IBM to Work on CockroachDB","description":"I’m a database nerd. Or, to be more precise, a DBMS nerd. What I love most about them is that while they’re everywhere, and modern society could not function without them, they’re incredibly difficult to build well. Part of this difficulty stems from the fact that databases are complex, and their construction borrows from nearly all fields of Computer Science. My love of databases, however, wasn’t always this strong. Back in university, I avoided the Databases course at all costs, inferring (quite incorrectly) that there wasn’t much new to learn in the domain, and that all of its hardest problems had already been solved.","link":"https://www.cockroachlabs.com/blog/why-i-left-ibm/","owner":"Cloudflare"}]