[{"title":"5 Ways to Better Understand SQL by Adding Optional Parentheses","description":"It appears that our recent beginner SQL articles explaining SQL syntax were quite popular. These include: A Beginner’s Guide to the True Order of SQL Operations A Probably Incomplete, Comprehensive Guide to the Many Different Ways to JOIN Tables in SQL 10 Easy Steps to a Complete Understanding of SQL How SQL DISTINCT and ORDER … ","link":"https://blog.jooq.org/2020/03/03/better-understand-sql-by-adding-optional-parentheses/","owner":"jOOQ"},{"title":"Elasticsearch: Custom Analysis","description":"GIPHY uses Elasticsearch to deliver all the best GIFs. Elasticsearch is an extremely fast, open source search engine supported by a great community. It has a robust Query API which allows us to quickly iterate our search algorithm. The Mapping API enables us to prototype new signals and account for the quirks in GIF metadata. […]","link":"https://engineering.giphy.com/elasticsearch-custom-analysis/","owner":"GIPHY"},{"title":"How (Not) to Build Datasets and Consume Data at Your Company","description":"The topic of datasets is not new, and they have been successfully used at SoundCloud for analytics purposes for a long time. In this blog…","link":"https://developers.soundcloud.com/blog/how-not-to-build-datasets-and-consume-data-at-your-company","owner":"Soundcloud"},{"title":"Rebalance the software spend equation","description":null,"link":"https://backtrace.io/blog/backtrace/rebalance-the-software-spend-equation/","owner":"Backtrace"},{"title":"The growth of command line options, 1979-Present","description":"\n\n<p><a href=\"https://www.xkcd.com/1795/\">My hobby</a>: opening up <a href=\"./mcilroy-unix/\">McIlroy’s UNIX philosophy</a> on one monitor while reading manpages on the other.</p>\n\n<p>The first of McIlroy's dicta is often paraphrased as &quot;do one thing and do it well&quot;, which is <a href=\"./mcilroy-unix/\">shortened from</a> &quot;Make each program do one thing well. To do a new job, build afresh rather than complicate old programs by adding new 'features.'&quot;</p>\n\n<p>McIlroy's example of this dictum is:</p>\n\n<blockquote>\n<p>Surprising to outsiders is the fact that UNIX compilers produce no listings: printing can be done better and more flexibly by a separate program.</p>\n</blockquote>\n\n<p>If you open up a manpage for <code>ls</code> on mac, you’ll see that it starts with</p>\n\n<pre><code>ls [-ABCFGHLOPRSTUW@abcdefghiklmnopqrstuwx1] [file ...]\n</code></pre>\n\n<p>That is, the one-letter flags to <code>ls</code> include every lowercase letter except for <code>{jvyz}</code>, 14 upper","link":"https://danluu.com/cli-complexity/","owner":"Dan Luu"},{"title":"Uncaught SyntaxError: Block-scoped declarations (let, const, function, class) not yet supported outside strict mode","description":"\n","link":"http://redino.net/blog/2020/03/uncaught-syntaxerror-block-scoped-declarations-let-const-function-class-not-yet-supported-outside-strict-mode/?utm_source=rss&utm_medium=rss&utm_campaign=uncaught-syntaxerror-block-scoped-declarations-let-const-function-class-not-yet-supported-outside-strict-mode","owner":"Redino"}]