[{"title":"Building TakeNote, a Notes App for Developers With GitHub Sync","description":"Not too long ago, I realized I didn't have a really good system for organizing my thoughts, and I wasn't happy with any of the note-taking…","link":"https://www.taniarascia.com/building-takenote/","owner":"Swizec Teller"},{"title":"How Retailers Can Exceed Customer Expectations on Cyber Monday (& Beyond)","description":"As retailers gear up for Cyber Monday, they are preparing for unprecedented traffic given the new ways people are shopping due to COVID-19. It’s already predicted ecommerce sales will hit over $10 billion USD on Cyber Monday alone. And although retailer’s online strategies are shifting, customer’s expectations remain the same. They want it cheap, and they want it now. According to one report, 62% of consumers say that no amount of safety measures would persuade them to shop in person.","link":"https://www.cockroachlabs.com/blog/retailers-survive-cyber-monday/","owner":"Cloudflare"},{"title":"Introducing QR Codes for eBay Shipping Labels","description":null,"link":"https://tech.ebayinc.com/product/introducing-qr-codes-for-ebay-shipping-labelsnew-blog-post/","owner":"Dropbox"},{"title":"Seeing is believing: a client-centric specification of database isolation","description":"","link":"https://blog.acolyer.org/2020/11/30/seeing-is-believing/","owner":"Addy Osmani"},{"title":"Translation QEM","description":"Introduction Wayfair sells products in the USA (wayfair.com), Canada (wayfair.ca), UK (wayfair.co.uk), and Germany (wayfair.de), and works with manufacturers from several countries. Consequently, business is being conducted in many languages. When product data is submitted by our suppliers in a different language than the market where the product is sold,...  ","link":"https://tech.wayfair.com/2020/11/translation-qem/","owner":"Wattpad"},{"title":"Visually Showing Atlas Search Highlights with JavaScript and HTML","description":"\n                    <p>When it comes to finding specific words or phrases within text, you&rsquo;re probably going to want to use a natural language search option like full-text search (FTS). Sure, you could probably create a complicated and difficult-to-maintain set of regular expressions to search within text, but that is an option that most developers don&rsquo;t want. Not to mention it won&rsquo;t cover the full scope of what a natural language processor typically accomplishes.</p>\n<p>In a previous tutorial titled <a href=\"https://www.thepolyglotdeveloper.com/2020/08/building-autocomplete-form-element-atlas-search-javascript/\">Building an Autocomplete Form Element with Atlas Search and JavaScript</a>, I wrote about searching for recipes, as they are being typed, in <a href=\"https://www.mongodb.com/cloud/atlas\">MongoDB Atlas</a> using the autocomplete operator. While this tutorial accomplished the job quite well, it didn&rsquo;t elaborate on what exactly was being matched for any g","link":"https://www.thepolyglotdeveloper.com/2020/11/visually-showing-atlas-search-highlights-javascript-html/","owner":"Nelson Elhage"},{"title":"Working with SQLite using Go and Python","description":"Introduction I prefer to use relational (SQL) databases in general since they provide several features that are very useful when working with data. SQLite is a great choice since the database is a single file, which makes it easier to share data. Even though it&rsquo;s a single file, SQLite can handle up to 281 terabytes of data. SQLite also comes with a command line client called sqlite3 which is great for quick prototyping.","link":"https://www.ardanlabs.com/blog/2020/11/working-with-sqlite-using-go-python.html","owner":"Wilfred Hughes"}]