[{"title":"Android App Bundle Support","description":"We have added Android App Bundle support which will become the required format for submitting apps to Google Play.","link":"https://www.codenameone.com/blog/android-app-bundle-support.html","owner":"Codementor"},{"title":"Announcing the Discord Moderator Academy Exam","description":"","link":"https://blog.discord.com/announcing-the-discord-moderator-academy-exam-a1bcb5b9d405?source=rss----cb96a1f03649---4","owner":"DigitalOcean"},{"title":"I try not to make unlikable software (and features)","description":"<p>I am writing to you from The Sky. On my flight today, I noticed an example of\n&ldquo;unlikable&rdquo; software — something I&rsquo;ve been increasingly aware of recently\n— inspiring me to pull out my laptop and write. On this plane, there are\ndisplays in the back of each seat which provides entertainment for the person\nseated one row back. Newer planes no longer include these, given that in\n$CURRENTYEAR everyone would just prefer some power for their phone or laptop.\nNevertheless, you can still end up a plane with this design. You can shut the\nthing off by repeatedly pressing the &ldquo;☀️ -&rdquo; button, though that button is rated\nfor half the cycles it will have already received by the time you press it.</p>\n<p>When the flight safety video is playing, or an announcement is being made,\nhowever, the system will override your brightness preference. This is a fairly\nreasonable design choice, added in the name of passenger safety. What&rsquo;s less\nreasonable is that the same feature","link":"https://drewdevault.com/2021/05/08/Try-not-to-make-unlikable-software.html","owner":"Dragan Gaic"},{"title":"Poor Disk Performance","description":"People often tell me they don't understand performance tool output because they can't tell what's \"good\" or \"bad.\" It can be hard as performance is subjective. What's good for one user may be bad for another. There are also cases where I can't tell either: The tools only provide clues for further analysis.\n","link":"http://www.brendangregg.com/blog/2021-05-09/poor-disk-performance.html","owner":"Brendan Eich"}]