[{"title":"aerc, mbsync, and postfix for maximum comfy offline email","description":"<p>I am the original author of the <a href=\"https://aerc-mail.org\">aerc mail client</a>, though my official\nrelationship with it today is marginal at best. I think that, with hindsight,\nI&rsquo;ve come to understand that the &ldquo;always online&rdquo; approach of aerc&rsquo;s IMAP\nimplementation is less than ideal. The next email client (which will exist at\nsome point!) will improve on this design, but, since it&rsquo;s still my favorite\nemail client despite these flaws, they will have to be worked around.</p>\n<p>To this end, I have updated my personal aerc setup to take advantage of its\n<a href=\"https://en.wikipedia.org/wiki/Maildir\">Maildir</a> support instead of having it use IMAP directly, then delegate IMAP\nto <a href=\"https://isync.sourceforge.io\">mbsync</a>. This brings a much-needed level of robustness to the setup, as\nmy Maildirs are available offline or on a flaky connection, and postfix will\nhandle queueing and redelivery of outgoing emails in similar conditions.<sup id=\"fn","link":"https://drewdevault.com/2021/05/17/aerc-with-mbsync-postfix.html","owner":"Dragan Gaic"},{"title":"Choosing a remote tool for pair programming","description":"<div class=\"hs-featured-image-wrapper\"> \r\n <a href=\"https://www.stridenyc.com/blog/choosing-a-remote-tool-for-pair-programming\" title=\"\" class=\"hs-featured-image-link\"> <img src=\"https://www.stridenyc.com/hubfs/pairing.jpg\" alt=\"looking for a pair programming tool\" class=\"hs-featured-image\" style=\"width:auto !important; max-width:50%; float:left; margin:0 15px 15px 0;\"> </a> \r\n</div>    \r\n<h2>Tuple vs CoScreen</h2> \r\n<p>&nbsp;</p> \r\n<p>Pairing, whether on writing code or joining a sales call, is one of the most common <a href=\"https://www.stridenyc.com/values\"><span>ways we collaborate at Stride</span></a>. Since going fully remote, Striders have been experimenting with numerous screen-sharing tools to facilitate remote pairing.</p>","link":"https://www.stridenyc.com/blog/choosing-a-remote-tool-for-pair-programming","owner":"Strava"},{"title":"CodeSOD: Authentic Mistakes","description":"<p><strong>John</strong>&#39;s employer needed a small web app built, so someone in management went out and hired a contracting firm to do the work, with the understanding that once it was done, their own internal software teams would do maintenance and support.</p>\r\n<p>Fortunately for John&#39;s company, their standard contract included a few well-defined checkpoints, for both code quality audits and <em>security</em> audits. It&#39;s the last one that&#39;s relevant in this case.</p>\r\n<p>There are three things you should never build for your application: date handling logic, encryption algorithms, or authentication mechanisms. These are all things that sound simple on the surface, but are actually quite difficult. You will mess them up, and you&#39;ll regret it. What&#39;s remarkable here, however, is seeing <em>how badly</em> one can mess up authentication:</p>\r\n<pre><code class=\"language-javascript\"><div>$(<span class=\"hljs-built_in\">document</span>).ready(<span class=\"hljs-functio","link":"https://thedailywtf.com/articles/authentic-mistakes","owner":"The Coded Self"},{"title":"Curly Tubes from the Lusion Website with Three.js","description":null,"link":"https://tympanus.net/codrops/2021/05/17/curly-tubes-from-the-lusion-website-with-three-js/","owner":"Code with style!"},{"title":"Expanding SASE threat protection and cybersecurity package options","description":null,"link":"https://umbrella.cisco.com/blog/expanding-sase-threat-protection-and-cybersecurity-package-options","owner":"OLX"},{"title":"Explore eBay’s New Optimized Spark SQL Engine for Interactive Analysis","description":null,"link":"https://tech.ebayinc.com/engineering/explore-ebays-new-optimized-spark-sql-engine-for-interactive-analysis/","owner":"Dropbox"},{"title":"First things first: the prototype","description":"We all know that moment when an exciting new idea suddenly comes to us. Maybe yours is about a dream holiday, or you’ve just had a groundbreaking vision of a new digital product… that seems so perfect that you are reluctant to share it with the world, for fear of criticism.","link":"https://www.future-processing.com/blog/first-things-first-the-prototype/","owner":"Funding Circle"},{"title":"Five Ways to Remove Backgrounds in Photoshop in 2021","description":"\n            ","link":"https://www.sitepoint.com/remove-background-photoshop/?utm_source=rss","owner":"Sift Science"},{"title":"Harpoon: Next generation time tracking and billing","description":"\n                                    ","link":"https://laravel-news.com/harpoon-financial","owner":"Kotlin"},{"title":"How Asynchronous Communication Can Boost Productivity","description":"Another practical solution is With these tools, teams can release new updates to their users continually in the most secure ways. If you don't study asynchronous workflow properly and put things in place before adopting this method, your organization may encounter some chaos. Once the team members agree on an idea, they can quickly move on with that idea rather than continuously debating it. 3. SAVING TIME Time is a valuable resource in every organization because time lost can't be recovered.","link":"https://www.cloudbees.com/blog/asynchronous-communication","owner":"CleverTap"},{"title":"How to install AdGuard Home","description":"Install AdGuard Home Network-wide ads & trackers blocking DNS server. I am using Pi-Hole with Unbound to perform DNS blocking, but AdGuard Home is an interesting alternative, so it’s worth checking it out. Open AdGuardHome to get current release. $ sudo wget --directory-prefix /opt https://github.com/AdguardTeam/AdGuardHome/releases/download/v0.105.2/AdGuardHome_linux_amd64.tar.gz Extract downloaded archive. $ sudo tar -xzf /opt/AdGuardHome_linux_amd64.tar.gz -C /opt/ […]","link":"https://sleeplessbeastie.eu/2021/05/17/how-to-install-adguard-home/","owner":"Mike Fogus"},{"title":"How to Install and deploy a WooCommerce website on RoseHosting Cloud","description":null,"link":"https://www.rosehosting.com/blog/how-to-install-and-deploy-a-woocommerce-website-on-rosehosting-cloud/","owner":"RisingStack"},{"title":"How to Use the New AWS Application Migration Service for Lift-and-Shift Migrations","description":"Since AWS acquired CloudEndure in 2019, our new colleagues have offered CloudEndure Migration and CloudEndure Disaster Recovery. CloudEndure Migration can move applications from any physical, virtual, or cloud-based infrastructure to AWS at no charge. This complements AWS Server Migration Service (AWS SMS), which is an agentless service for migrating on-premises workloads to AWS. CloudEndure Disaster […]","link":"https://aws.amazon.com/blogs/aws/how-to-use-the-new-aws-application-migration-service-for-lift-and-shift-migrations/","owner":"Avenue Code"},{"title":"JFugue Beginners Guide Part III: Rhythms, Reading and Writing to MIDI","description":"JFugue is a Java library that creates music! This is the third article of a JFugue tutorial series, and we cover rhythms and export music to MIDI format.","link":"https://stackabuse.com/jfugue-beginners-guide-part-iii-rhythms-reading-and-writing-to-midi","owner":"Srinivas Tamada"},{"title":"Key considerations when making a decision on a Cloud Data Warehouse","description":null,"link":"https://blog.cloudera.com/key-considerations-when-making-a-decision-on-a-cloud-data-warehouse/","owner":"CloudBees"},{"title":"Laravel Nova Inline Select","description":"\n                                    ","link":"https://laravel-news.com/laravel-nova-inline-select","owner":"Kotlin"},{"title":"Learn MOAR with Summer ’21: Release Highlights for Developers","description":null,"link":"https://developer.salesforce.com/blogs/2021/05/learn-moar-with-summer-21-release-highlights-for-developers.html","owner":"Runtastic"},{"title":"Observability: 15 Industry-Leading Companies Discuss its Evolution","description":null,"link":"https://haydenjames.io/observability-15-industry-leading-companies-discuss-its-evolution/","owner":"Guilherme Rodrigues"},{"title":"Optimizing payments with machine learning","description":"","link":"https://dropbox.tech/machine-learning/optimizing-payments-with-machine-learning","owner":"Drivy"},{"title":"Refactoring Production Code","description":null,"link":"https://eng.wealthfront.com/2021/05/17/refactoring-production-code/","owner":"Wayfair"},{"title":"Remastering Guilds After Five Years","description":"Five years ago trivago started to build guilds – small communities dedicated to certain topics or technologies – as a need arose to organize the collaboration of more than a hundred developers on a wide range of topics. You can read more about how we started in the previous blog posts Part I and Part II.A lot has changed about trivago as an organisation as well as about the technologies we use for product development since our engineers started organising the first tech guilds years ago.","link":"https://tech.trivago.com/2021/05/17/remastering-guilds-after-five-years/","owner":"TripAdvisor"},{"title":"Tuning MySQL my.cnf? Avoid this common pitfall!","description":null,"link":"https://haydenjames.io/my-cnf-tuning-avoid-this-common-pitfall/","owner":"Guilherme Rodrigues"},{"title":"Use ResultQuery.collect() to Implement Powerful Mappings","description":"In our opinion, any Iterable<T> should offer a <R> collect(Collector<T, ?, R>) method to allow for transforming the the content to something else using standard JDK collectors, jOOλ collectors from org.jooq.lambda.Agg or your own. When using jOOQ, you don’t have to wait for the JDK to finally add these useful utilities to the Iterable API. … ","link":"https://blog.jooq.org/2021/05/17/use-resultquery-collect-to-implement-powerful-mappings/","owner":"IPFS"},{"title":"Virtual Hack Day April 2021","description":"<p><strong>In April, colleagues from across product and engineering, as well as other parts of the organisation, came together for another exciting remote hack day. </strong></p><p>For our second virtual hack day of 2021, we went back to our classic format: a free-for-all with a side theme of ‘try something new’. This was left to personal interpretation; whether it was trying a new programming language, attempting a new way of working or taking a different approach to a concept.</p><p>We produced and presented 27 amazing hacks over the two-day event. These included: a new internal tool for creating Recipe Atoms, which contain all the information about a recipe in a way that is easy for computers to understand; helping new readers orient themselves more easily in fast-moving live events; a Chrome extension that adds an individual’s gender pronouns into Google Chat; and helping our users to better find accessibility resources. </p> <a href=\"https://www.theguardian.com/info/2021/may/17/vi","link":"https://www.theguardian.com/info/2021/may/17/virtual-hack-day-april-2021","owner":"Groupon"},{"title":"What Parental Leave is Like at Cockroach Labs","description":"Welcoming a child while working at a tech startup can seem like an overwhelming life change.\nIn a world where everyone is already strapped for time, you’re going to take three months away from your role!? It sounds scary, but at Cockroach Labs, we’re working on ways to make this stressful time easier, and I’m excited to share more about our programs for Roachers who are starting or growing their families.","link":"https://www.cockroachlabs.com/blog/parental-leave/","owner":"Cloudflare"},{"title":"What’s new in CDP Private Cloud 1.2?","description":null,"link":"https://blog.cloudera.com/whats-new-in-cdp-private-cloud-1-2/","owner":"CloudBees"}]