[{"title":"Brazil's Nubank Uses CockroachDB for Resiliency & Scale","description":"Nubank migrated its credit card authorization service from in-memory storage to CockroachDB to achieve scalable, always-on infrastructure and more efficient operations Nubank, a leading Brazilian financial technology company that was just valued at $25 billion dollars, needed a scalable SQL database for several critical services. The bank initially stored data on-prem using an in-memory data store, but as the business rapidly grew (from 12 million customers in 2019 to 34 million customers in 2021), it needed a transactional solution for some of their applications.","link":"https://www.cockroachlabs.com/blog/nubank/","owner":"Cloudflare"},{"title":"Industry X.0 – Made Real,  Practical Insights Today enabling Profits Tomorrow","description":null,"link":"https://blog.cloudera.com/industry-x-0-made-real-practical-insights-today-enabling-profits-tomorrow/","owner":"CloudBees"},{"title":"Nanobox - End of life","description":"As you may know, we released DigitalOcean App Platform a few months ago. App Platform makes it much simpler and faster to build, deploy, and scale apps. You can deploy code simply by pointing to a GitHub or GitLab repo and App Platform will do all the heavy lifting of managing the infrastructure, app runtimes, and dependencies.","link":"https://www.digitalocean.com/blog/nanobox---end-of-life","owner":"Deliveroo"},{"title":"Service Level Objectives for On-call Peace of Mind","description":"Using Service Level Objectives (SLOs) can increase your ability to focus while providing better service and responses to your customers.","link":"https://engineering.gusto.com/slos-for-peace-of-mind/","owner":"Guardian"},{"title":"The Future of Healthcare Is Virtual","description":"As work flexibility rises, so must healthcare flexibility. Matt McCambridge, Co-founder and CEO of Eden Health, reveals the future of telemedicine and what today's teams need to stay healthy and happy.","link":"https://www.toptal.com/insights/innovation/future-of-telemedicine","owner":"Tinder"}]