[{"title":"[Unix] Using GeoIP from commandline","description":"[Unix] Using GeoIP from commandline","link":"https://yurichev.com/news/20210414_geoip/","owner":"Dennis Felsing"},{"title":"[WEBINAR] 5 Growing Fraud Threats to Omnichannel Retail","description":null,"link":"https://blog.sift.com/2021/webinar-5-growing-fraud-threats-to-omnichannel-retail/?utm_source=rss&utm_medium=rss&utm_campaign=webinar-5-growing-fraud-threats-to-omnichannel-retail","owner":"Shyp"},{"title":"AQUA (Advanced Query Accelerator) – A Speed Boost for Your Amazon Redshift Queries","description":"Amazon Redshift already provides up to 3x better price-performance at any scale than any other cloud data warehouse. We do this by designing our own hardware and by using Machine Learning (ML). For example, we launched the SSD-based RA3 nodes for Amazon Redshift at the end of 2019 (Amazon Redshift Update – Next-Generation Compute Instances […]","link":"https://aws.amazon.com/blogs/aws/new-aqua-advanced-query-accelerator-for-amazon-redshift/","owner":"Avenue Code"},{"title":"Automated Testing:  The Cornerstone of CI/CD","description":null,"link":"https://semaphoreci.com/blog/automated-testing-cicd","owner":"Semaphore CI Community"},{"title":"Cloudera Data Engineering – Integration steps to leverage Spark on Kubernetes","description":null,"link":"https://blog.cloudera.com/cloudera-data-engineering-integration-steps-to-leverage-spark-on-kubernetes/","owner":"CloudBees"},{"title":"Coffee with Cloudera – Gavin Welch, Sr. Partner Manager, IHVs","description":null,"link":"https://blog.cloudera.com/coffee-with-cloudera-gavin-welch-sr-partner-manager-ihvs/","owner":"CloudBees"},{"title":"How Open Talent Can Drive Healthcare’s Digital Transformation","description":"The keys to future growth, innovation, and safety will require access to the exact skills needed at the exact right time.","link":"https://www.toptal.com/insights/healthcare/open-talent-digital-transformation","owner":"Tinder"},{"title":"Kotlin 1.5.0-RC Released: Changes to the Standard and Test Libraries","description":"Kotlin 1.5.0-RC is available with all the features planned for 1.5.0 – check out the entire scope of the upcoming release! New language features, stdlib updates, an improved testing library, and many more changes are receiving a final polish. The only additional changes before the release will be fixes. Try the modern Kotlin APIs on […]","link":"https://blog.jetbrains.com/kotlin/2021/04/kotlin-1-5-0-rc-released/","owner":"Klipse"},{"title":"Migrating Your Project to Maven","description":"As you may know, we are moving to Maven for our build tool. As part of this transition, we are moving towards a single Maven project structure, and away from separate structures for each IDE. This will be easier to maintain, and will also make it easier to collaborate on projects with other developers who use a different IDE (or no IDE at all).","link":"https://www.codenameone.com/blog/migrating-your-project-to-maven.html","owner":"Codementor"},{"title":"Retraction: My Go Executable Files Are Still Large (What's New in 2021)","description":"In 2019, we published an exploration of the size and makeup of the executable files produced by the Go compiler. CockroachDB engineers, the Go team, and the greater Go community were intrigued by the analysis, and the results of it pushed our projects further.\nTwo years passed, and both Go and CockroachDB had evolved significantly in that time. We wanted to explore: What might have changed? What could we learn?","link":"https://www.cockroachlabs.com/blog/go-file-size-update/","owner":"Cloudflare"},{"title":"SEM bid modifiers: Optimizing Google, Bing Ads bids with predictive geo-targeting","description":"Google and Microsoft both allow for flexible geographic targeting up to a point, which means we can use AI to bundle groups of individuals, find the commonalities, and make a recommendation about how much a marketer should be willing to spend to engage with them.","link":"https://faraday.ai/blog/predictive-bid-modifiers-google-bing-ads/","owner":"Facebook AI Research"},{"title":"Using Index of an array as KEY Can Lead to Bad Consequences","description":"Every application makes use of Lists/arrays in one or the other way. When working with lists in React, one need to be more cautious, because of the key prop which is used with elements within array.\nkey prop is an identity to an element in the DOM. So, it is expected to be unique and static in order to differentiate between the elements. If you fail to pass key prop, you will end up seeing this in your console .","link":"https://crypt.codemancers.com/posts/2021-04-14-using-index-of-an-array-as-key-can-lead-to-bad-consequences/","owner":"Codelitt"},{"title":"What Is a Technical Project Manager?","description":"Surging demand for Technical Project Managers has raised some important questions for PMs in software development. What are the responsibilities and expectations associated with this role? And just how technical is “technical”?","link":"https://www.toptal.com/project-managers/technical/what-is-a-technical-project-manager","owner":"Tinder"}]