[{"title":"\n    Introducing Hashshake\n  ","description":"\n    ","link":"https://hashrocket.com/blog/posts/introducing-hashshake","owner":"Hashnode"},{"title":"#ClouderaLife Spotlight: Karen Ji, Senior Manager, Customer Operations","description":null,"link":"https://blog.cloudera.com/clouderalife-spotlight-karen-ji-senior-manager-customer-operations/","owner":"CloudBees"},{"title":"A Kubernetes Service Mesh Comparison","description":"As microservices architecture continues to evolve, interservice communication has become a significant challenge to manage. Service meshes are becoming the standard solution, but how do popular and up-and-coming service meshes compare?","link":"https://www.toptal.com/kubernetes/service-mesh-comparison","owner":"Tinder"},{"title":"Build an Infinite Runner Game with Unity and the Realm Unity SDK","description":"\n                    <p>Did you know that MongoDB has a Realm SDK for the Unity game development\nframework that makes working with game data effortless? It&rsquo;s currently an alpha release, but you can already start\nusing it to build persistence into your cross platform gaming projects.</p>\n<p>A popular game template for the past few years has been in infinite\nrunner style games. Games such as <a href=\"https://play.google.com/store/apps/details?id=com.imangi.templerun\">Temple Run</a>\nand <a href=\"https://play.google.com/store/apps/details?id=com.kiloo.subwaysurf\">Subway Surfers</a> have\nhad many competitors, each with their own spin on the subject. If you&rsquo;re\nunfamiliar with the infinite runner concept, the idea is that you have a\nplayer that can move horizontally to fixed positions. As the game\nprogresses, obstacles and rewards enter the scene. The player must dodge\nor obtain depending on the object and this happens until the player\ncollides with an obstacle. As time progresses","link":"https://www.thepolyglotdeveloper.com/2021/03/build-infinite-runner-game-unity-realm-unity-sdk/","owner":"Nelson Elhage"},{"title":"Building a Healthy On-Call Culture","description":"Paging Doctor Software In the past, on-call duty was often associated with doctors, but in recent years, it’s become common for software…","link":"https://developers.soundcloud.com/blog/building-a-healthy-on-call-culture","owner":"Soshace"},{"title":"Calculating Pagination Metadata Without Extra Roundtrips in SQL","description":"When paginating results in SQL, we use standard SQL OFFSET .. FETCH or a vendor specific version of it, such as LIMIT .. OFFSET. For example: As always, we’re using the Sakila database for this example. This is rather straightforward. It will give us page 2 out of N pages, with a page size of … ","link":"https://blog.jooq.org/2021/03/11/calculating-pagination-metadata-without-extra-roundtrips-in-sql/","owner":"IPFS"},{"title":"ES6 Arrow Functions: Fat and Concise Syntax in JavaScript","description":"\n            ","link":"https://www.sitepoint.com/es6-arrow-functions-new-fat-concise-syntax-javascript/?utm_source=rss","owner":"Sift Science"},{"title":"How Creating an Agile Code Base Helped eBay Pivot for Apple Silicon","description":null,"link":"https://tech.ebayinc.com/engineering/how-creating-an-agile-code-base-helped-ebay-pivot-for-apple-silicon/","owner":"Dropbox"},{"title":"Launching the Zyte Developers Community","description":"Zyte is launching a bi-weekly community newsletter specifically made for web scraping developers. No-fluff. Only coding stuff. Sign up here. What is it? Zyte Developer Community is starting off as a newsletter but we’re planning to grow into something much bigger so developers have a place to learn, discuss web scraping challenges and find answers […]","link":"https://www.zyte.com/blog/launching-the-zyte-developers-community/","owner":"Schibsted Tech Polska"},{"title":"PHP Authorization with JWT (JSON Web Tokens)","description":"\n            ","link":"https://www.sitepoint.com/php-authorization-jwt-json-web-tokens/?utm_source=rss","owner":"Sift Science"},{"title":"Raspberry Pi Performance: Add ZRAM and these Kernel Parameters","description":null,"link":"https://haydenjames.io/raspberry-pi-performance-add-zram-kernel-parameters/","owner":"Guilherme Rodrigues"},{"title":"When (& Why) You Should Use Change Data Capture","description":"Change Data Capture (CDC) can simplify and improve both your application and data architectures. The trick is to figure out the most effective use cases where employing CDC will have the desired impact. In this blog, I&rsquo;m going to unpack two useful CDC use cases: The first is streaming data to your data warehouse and the second is event-driven architectures. By no means are these the only two use cases for change data capture, but they are excellent examples for demonstrating the ways that CDC can simplify application and data architecture.","link":"https://www.cockroachlabs.com/blog/why-use-change-data-capture/","owner":"Cloudflare"},{"title":"Why Companies Shouldn’t Reintroduce All Travel Post-COVID-19","description":"With health and safety concerns for workers, and liability and logistical concerns for companies, it’s just not worth returning to the operational status quo.","link":"https://www.toptal.com/insights/rise-of-remote/future-of-business-travel","owner":"Tinder"}]