[{"title":"Art Crawl 2021 Roundup","description":"Whoa! What a week it has been! Art Crawl wrapped up on Friday, a veritable artistic cornucopia that saw 5,000 submissions, each beautiful and unique in their own way. We...","link":"https://blog.imgur.com/2021/02/17/art-crawl-2021-roundup/","owner":"Imaginea"},{"title":"Components - Improved Credential Handling & Faster Deployments","description":"Serverless Framework Components now features more secure credential handling and 80% faster deployments","link":"https://serverless.com/blog/serverless-component-credential-handling-fast-deployments/","owner":"Sensible"},{"title":"How I Built a Wheel of Fortune JavaScript Game for My Zoom Group","description":"\n            ","link":"https://www.sitepoint.com/javascript-game-zoom-group/?utm_source=rss","owner":"Sift Science"},{"title":"How Roche Diagnostics Improved Employee Retention During the Pandemic","description":"Team members at Roche Diagnostics Indianapolis aren’t just working through a pandemic—they’re fighting it. We spoke with Bridget Boyle, the company’s Head of People and Culture, to learn how they increased employee retention despite 2020's challenges.","link":"https://www.toptal.com/insights/healthcare/how-roche-diagnostics-improved-retention-during-pandemic","owner":"Tinder"},{"title":"How we provide maps for Geocaching","description":"\n          <img src=\"https://www.maptiler.com/media/2021-02-18-how-we-provide-maps-for-geocaching-1.jpg\"\n          alt=\"Thumb\">\n          <p>Geocaching is a world-wide game where people search for hidden <em>treasures</em>. MapTiler provides the official website data for the background map that shows where all these boxes are hidden.</p>\n\n<h2 id=\"what-is-geocaching-and-how-to-play\">What is geocaching and how to play</h2>\n<p>People prepare this game for other people. Some hide the treasure, and others hunt for it using a map and GPS, to find the places and their cleverly hidden containers. Sometimes there are also hints leading you on a kind of scavenger hunt, leading you to do more than just visit the area, find the cache in the terrain, and sign the logbook. Sometimes, the hidden containers aren’t even located in the same place as the marker!</p>\n\n<amp-img alt=\"test-perf in action\" src=\"/media/2021-02-18-how-we-provide-maps-for-geocaching-2.jpg\" width=\"1600\" height=\"1067\" layout=\"resp","link":"https://www.maptiler.com/news/2021/02/how-we-provide-maps-for-geocaching/","owner":"Mandrill"},{"title":"How We Reimagined A/B Testing at Squarespace","description":"Developing great products isn’t just a matter of engineering; it’s also \r\nabout developing an understanding of your users and their needs. A/B \r\nTesting is one of the most powerful tools in this regard, and over the past \r\nyear, we’ve been turning A/B testing into a simple, repeatable process that \r\nscales with our product aspirations.","link":"https://engineering.squarespace.com/blog/2021/how-we-reimagined-ab-testing-at-squarespace","owner":"Square"},{"title":"It’s Time to move on to Automation Testing","description":null,"link":"http://blog.mallow-tech.com/2021/02/its-time-to-move-on-to-automation-testing/","owner":"Made Tech"},{"title":"Learning on the Cloud: Expanding DigitalOcean’s partnership with the GitHub Student Developer Pack","description":"DigitalOcean has offered students the opportunity to build in the cloud through the GitHub Student Developer Pack since 2014. We are pleased to announce that we have increased our offering to **$100 worth of credits to use on the DigitalOcean platform for one calendar year**. This will support students in building, sharing, and collaborating on software projects as they spin up Droplets, learn about scaling infrastructure, or host their apps on DigitalOcean App Platform.","link":"https://www.digitalocean.com/blog/learning-on-the-cloud-expanding-digitaloceans-partnership","owner":"Deliveroo"},{"title":"Power-of-2-Choices in Practice","description":"","link":"https://engineering.mixpanel.com/power-of-2-choices-in-practice-b6097020dfad?source=rss----b5de3443ad1f---4","owner":"Mixmax"},{"title":"Render Modules Update","description":"About roles and organization in the render modules.","link":"https://code.blender.org/2021/02/render-modules-update/","owner":"BlackRock"},{"title":"Shadow Jobs","description":null,"link":"https://slack.engineering/shadow-jobs/?utm_source=rss&utm_medium=rss&utm_campaign=shadow-jobs","owner":"Skyscanner"},{"title":"SQL Compatibility in CockroachDB: Spatial Data, Enums, Materialized Views","description":"CockroachDB empowers developers to build fast, scalable applications, and one of the ways it does this is by providing rich, Postgres-compatible SQL. And while CockroachDB follows the Postgres wire protocol, the database also has a custom SQL implementation designed for a distributed database.\nOver the years, we’ve expanded our distributed SQL implementation to include a cost-based optimizer (CBO) and vectorized execution engine - all built to tackle the complexity of distributed data for developers.","link":"https://www.cockroachlabs.com/blog/sql-updates-in-cockroachdb-spatial-data-enums-materialized-views/","owner":"Cloudflare"},{"title":"Trends for the Insurance Industry to Track in 2021","description":null,"link":"https://blog.cloudera.com/express-cloudera-pov-on-2021-data-trends-in-insurance/","owner":"CloudBees"},{"title":"Zap, Tweet, and Repeat! How to Use Zapier with MongoDB","description":"\n                    <p>I&rsquo;m a huge fan of automation when the scenario allows for it. Maybe you\nneed to keep track of guest information when they RSVP to your event, or\nmaybe you need to monitor and react to feeds of data. These are two of\nmany possible scenarios where you probably wouldn&rsquo;t want to do things\nmanually.</p>\n<p>There are quite a few tools that are designed to automate your life.\nSome of the popular tools include <a href=\"https://ifttt.com/\">IFTTT</a>,\n<a href=\"https://www.zapier.com\">Zapier</a>, and\n<a href=\"https://automate.io/\">Automate</a>. The idea behind these services is\nthat given a trigger, you can do a series of events.</p>\n<p>In this tutorial, we&rsquo;re going to see how to collect Twitter data with\nZapier, store it in MongoDB using a Realm webhook function, and then run\naggregations on it using the MongoDB query language (MQL).</p>\n                    \n                        <p>The post <a rel='nofollow' href='https://www.thepolyglotdeveloper.com/","link":"https://www.thepolyglotdeveloper.com/2021/02/zap-tweet-repeat-how-to-use-zapier-mongodb/","owner":"Nelson Elhage"}]