[{"title":"A Deep Dive Into NgRx Advantages and Features","description":"NgRx is a popular Angular state management library, but to unlock its full potential developers may require a few new skills.\r\n\r\nIn this article, Toptal Full-stack Developer Luka Onikadze explains why he became an NgRx admirer after starting off as a skeptic.","link":"https://www.toptal.com/angular/why-use-ngrx","owner":"Toptal"},{"title":"Announcing Explorer: A better way to understand your cloud database","description":"We're excited to share “Explorer”, a new feature in our cloud-native database service designed to be your easy-to-use “operations center.\" Learn how it works, why we built it, and how to get started.","link":"https://blog.timescale.com/blog/announcing-explorer-a-better-way-to-understand-your-cloud-database/","owner":"Timescale"},{"title":"godocs.io six months later","description":"<p>We&rsquo;re six months on from <a href=\"https://drewdevault.com/2020/12/18/godocs.io.html\">forking godoc.org</a> following its upstream\ndeprecation, and we&rsquo;ve made a lot of great improvements since. For those\nunaware, the original godoc.org was replaced with pkg.go.dev, and a redirect was\nset up. The new website isn&rsquo;t right for many projects — one of the most\nglaring issues is the narrow list of software licenses pkg.go.dev will display\ndocumentation for. To continue serving the needs of projects which preferred the\nold website, we forked the project and set up <a href=\"https://godocs.io\">godocs.io</a>.</p>\n<p>Since then, we&rsquo;ve made a lot of improvements, both for the hosted version and\nfor the <a href=\"https://sr.ht/~sircmpwn/godocs.io/\">open source project</a>. Special thanks is due to Adnan Maolood, who\nhas taken charge of a lot of these improvements, and also to a few other\ncontributors who have helped in their own small ways. Since forking, we&rsquo;ve:</p>\n<u","link":"https://drewdevault.com/2021/05/07/godocs.io-six-months-later.html","owner":"Drew DeVault"},{"title":"How to Combat the Fraud Economy in Fintech","description":null,"link":"https://blog.sift.com/2021/how-to-combat-the-fraud-economy-in-fintech/?utm_source=rss&utm_medium=rss&utm_campaign=how-to-combat-the-fraud-economy-in-fintech","owner":"Sift Science"},{"title":"How We Manage New York Times Readers’ Data Privacy","description":"","link":"https://open.nytimes.com/how-we-manage-new-york-times-readers-data-privacy-d39627d79a64?source=rss----51e1d1745b32---4","owner":"New York Times"},{"title":"HumAIn Podcast: How to Power Enterprises with Intelligent Applications with Jordan Tigani of SingleStore","description":"SingleStore is a modern relational database for cloud and on-premises that delivers immediate insights for modern applications and analytical systems. Book a demo or trial today!","link":"https://www.singlestore.com/blog/how-to-power-enterprises-with-intelligent-applications-with-jordan-tigani-of-singlestore","owner":"MemSQL"},{"title":"kotlinx.serialization 1.2 Released: High-Speed JSON Handling, Value Class Support, Overhauled Docs, and more","description":"kotlinx.serialization 1.2 is out! The latest version of our multiplatform serialization library brings a number of improvements – here are the highlights: JSON serialization is faster than ever before. Version 1.2 is up to twice as fast as previous versions when parsing JSON into type-safe Kotlin objects and turning Kotlin objects into their text representations. […]","link":"https://blog.jetbrains.com/kotlin/2021/05/kotlinx-serialization-1-2-released/","owner":"Kotlin"},{"title":"Making Tech Better podcast: Transforming organisations with Paula Paul","description":null,"link":"https://www.madetech.com/blog/making-tech-better-paula-paul/","owner":"Made Tech"},{"title":"TECHTALK #3 Event Recap","description":null,"link":"https://engineering.linecorp.com/en/blog/techtalk-3-event-recap/","owner":"LINE"},{"title":"Who is verifying their cryptographic protocols?","description":null,"link":"https://galois.com/blog/2021/05/who-is-verifying-their-cryptographic-protocols/","owner":"Galois"}]