[{"title":"Container Sprawl Is the New VM Sprawl","description":"\n                    ","link":"https://d2iq.com/blog/container-sprawl-is-the-new-vm-sprawl","owner":"MemSQL"},{"title":"Converting a 13 year old .NET WPF app called BabySmash to a self-contained .NET 5 app with the .NET Upgrade Assistant","description":null,"link":"http://feeds.hanselman.com/~/649573998/0/scotthanselman~Converting-a-year-old-NET-WPF-app-called-BabySmash-to-a-selfcontained-NET-app-with-the-NET-Upgrade-Assistant","owner":"Schakko"},{"title":"Coq will be renamed","description":"<p >From the <A href=\"https://sympa.inria.fr/sympa/arc/coq-club/2021-04/msg00125.html\">Coq-club</A>:</p>\n<blockquote ><p >\nThe Coq development team acknowledges the recent discussions (started on the Coq-Club mailing list) around Coq's logo and name.</p>\n<p >We wish to thank everyone that participated in these discussions. Testimonies from people who experienced harassment or awkward situations, reports about students (notably women) who ended up not learning / using Coq because of its name, were all very important so that the community could fully recognize the impact of the current name and its slang meaning in English, especially with respect to gender-diversity in the Coq community.</p>\n<p >For these reasons, the Coq development team is open to a renaming.\n</p></blockquote>\n<p >Suggestions for alternative names go <A href=\"https://github.com/coq/coq/wiki/Alternative-names\">here</A>.</p>","link":"http://lambda-the-ultimate.org/node/5629","owner":"Kyle Kingsbury"},{"title":"Creating Zendesk Tickets using events from Amazon EventBridge","description":"","link":"https://developerblog.zendesk.com/creating-zendesk-tickets-using-events-from-amazon-eventbridge-5e1ab407a2f0?source=rss----ed5bf5519696---4","owner":"Zendesk"},{"title":"Criteo/CAp21 Privacy-preserving AI Challenge","description":"","link":"https://medium.com/criteo-engineering/criteo-cap21-privacy-preserving-ai-challenge-9cf9cd880e54?source=rss----fc3ea5a64a12---4","owner":"Coolblue"},{"title":"Engineering Career Series: Building a happy, diverse, and inclusive engineering team","description":"I considered writing this as a clickbaity listicle: “7 secrets of engineering team management - you won’t believe number three!” Unfortunately that’s impossible, because it’s a much harder topic, and anyway, number three is: “many years of ongoing investment in building the right team culture, making a lot of mistakes, and learning from them.” Less catchy, but much more what this series is going to try and cover… I’ve been at Yelp for eight years now, and I’ve been leading engineering teams for almost 25 years in both the UK and the US, at a wide variety of companies, at...","link":"https://engineeringblog.yelp.com/2021/04/engineering-career-series-building-a-happy-diverse-and-inclusive-engineering-team.html","owner":"Yammer"},{"title":"Free Courses: Distributed SQL Tutorials & Labs for Beginners","description":"It’s been over a year since we released Cockroach University. In that time, we’ve launched two new developer courses, hired a full team of training professionals, and planned out a comprehensive roadmap for the future. Over 6,000 developers, architects, engineers, and other tech professionals have enrolled in one or more Cockroach University classes. We’ve received a lot of positive feedback so far but one comment we heard over and over again is that our students would appreciate shorter courses that focus on different skill sets.","link":"https://www.cockroachlabs.com/blog/cockroachuniversity-intro-first-steps/","owner":"Cloudflare"},{"title":"How Do You Use Stack Overflow? The Kotlin Community Survey","description":"Stack Overflow is an essential resource when it comes to learning something new about programming. It is easily searchable, used by millions of people, and extremely popular in the software engineering community. During the Kotlin Census 2020, 55% of respondents mentioned Stack Overflow as a helpful learning resource. However, sometimes we hear that finding Kotlin-related […]","link":"https://blog.jetbrains.com/kotlin/2021/04/how-do-you-use-stack-overflow-the-kotlin-community-survey/","owner":"Klipse"},{"title":"How LUSH Optimized Global Inventory Management with CockroachDB","description":"Every day Lush processes hundreds of thousands of transactions in over 950 stores located across 49 different countries. Consistency is important. And inventory management can create extraordinary opportunities when the right tools are used to deliver real-time data insights.\nIn this blog, we’ll cover what Lush’s inventory management architecture looked like before CockroachDB and what they’re able to accomplish with CockroachDB. Lush Architecture Prior to their Migration to CockroachDB If you haven’t already indulged in the fragrant self-care of a Lush bath bomb then you may not know that Lush Fresh Handmade Cosmetics is a global inventor, manufacturer and retailer of fresh handmade cosmetics - known for the quality of their ingredients and the environmental thoughtfulness of their packaging (or lack thereof).","link":"https://www.cockroachlabs.com/blog/global-inventory-management/","owner":"Cloudflare"},{"title":"How to Learn Complex Things Quickly: A Guide","description":"<div class=\"hs-featured-image-wrapper\"> \r\n <a href=\"https://product.hubspot.com/blog/how-to-learn-complex-things-quickly\" title=\"\" class=\"hs-featured-image-link\"> <img src=\"https://product.hubspot.com/hubfs/LearningComplexThings_Baldauf-1.png\" alt=\"How to Learn Complex Things Quickly: A Guide\" class=\"hs-featured-image\" style=\"width:auto !important; max-width:50%; float:left; margin:0 15px 15px 0;\"> </a> \r\n</div>    \r\n<p>In my 20+ years as a software engineer, I’ve constantly been asked or expected to learn complex things. In his book <a href=\"https://www.calnewport.com/books/deep-work/\" style=\"font-style: italic;\">Deep Work</a>, when talking about the knowledge economy, author Cal Newport writes, “If you can’t learn, you can’t thrive.” New languages and platforms are launched, projects get new requirements, libraries and frameworks release new versions ⁠— in software, the only constant is change. A friend who was recently starting a new role asked “Got any tips to help me learn this ne","link":"https://product.hubspot.com/blog/how-to-learn-complex-things-quickly","owner":"Housing.com"},{"title":"How Verizon Created an Award-Winning Virtual Internship Program","description":"Last year, Verizon transformed its internship program to be fully remote. Here’s how they created a rewarding experience for students and managers.","link":"https://www.toptal.com/insights/rise-of-remote/verizon-virtual-internship-program","owner":"Tinder"},{"title":"Searching on Your Location with Atlas Search and Geospatial Operators","description":"\n                    <p>When thinking about full-text search, text and other string data is\nprobably the first thing to come to mind. In fact, if you&rsquo;ve been\nkeeping up with my tutorials, you might remember <a href=\"https://www.thepolyglotdeveloper.com/2020/08/building-autocomplete-form-element-atlas-search-javascript/\">Building an Autocomplete Form Element with Atlas Search and JavaScript</a>\nor <a href=\"https://www.thepolyglotdeveloper.com/2020/11/visually-showing-atlas-search-highlights-javascript-html/\">Visually Showing Atlas Search Highlights with JavaScript and HTML</a>,\nboth of which were on text search examples in MongoDB Atlas Search.</p>\n<p>Being able to use natural language search on text data is probably one\nof the most popular use-cases, but there are scenarios where you might need to narrow the results even further.</p>\n<p>Let&rsquo;s say you&rsquo;re building a restaurant review application like Yelp or a bed\nand breakfast booking system like Airbnb. Sure, you&rsqu","link":"https://www.thepolyglotdeveloper.com/2021/04/searching-on-your-location-atlas-search-geospatial-operators/","owner":"Nelson Elhage"},{"title":"Talking Simplicity and Purpose in Software on New Relic’s Podcast","description":null,"link":"https://semaphoreci.com/blog/talking-simplicity-purpose-new-relic-podcast","owner":"Semaphore CI Community"},{"title":"Trojans, information stealer feature complex risks","description":null,"link":"https://umbrella.cisco.com/blog/cybersecurity-threat-spotlight-trojans-information-stealer-feature-complex-risks","owner":"OLX"},{"title":"Zyte Developers Community newsletter issue #2","description":"Hi there, If you are not signed up already for the Zyte Developers Community newsletter, you can sign up here. In this issue: Web scraping to make police data easily accessible Free & powerful tool for Xpath / CSS selectors Job aggregator site built with web scraping Turn podcasts into an RSS feed with web […]","link":"https://www.zyte.com/blog/zyte-developers-community-newsletter-issue-2/","owner":"Schibsted Tech Polska"}]