[{"title":"\nProgramming and Writing\n","description":"One year ago I paused my programming life and started writing a novel, with the illusion that my new activity was deeply different than the previous one. A river of words later, written but more often rewritten, I’m pretty sure of the contrary: programming big systems and writing novels have many common traits and similar processes.\n","link":"\nhttp://antirez.com/news/135\n","owner":"Andrey Akinshin"},{"title":"3 things you need to know about accelerating discovery in digital delivery","description":null,"link":"https://www.madetech.com/blog/3-things-you-need-to-know-about-accelerating-discovery/","owner":"Lyft"},{"title":"5 Factors to Consider When Choosing a Stream Processing Engine","description":null,"link":"https://blog.cloudera.com/5-factors-to-consider-when-choosing-a-stream-processing-engine/","owner":"CloudBees"},{"title":"A Day in the Life","description":"<p>Welcome to the latest post in our ‘Day in the Life’ blog series, in which product and engineering’s digital coordinator, Rasha Ardati, interviews a colleague from the department to reflect on their career and experiences at the Guardian.</p><p>Back in 1990-something, Yusuf’s dad said ‘son, computers are the future!’ and he bought him his first computer, minus a mouse because they couldn’t afford it. He also got him his first programming book, a custom that continued over the course of the years. Soon, Yusuf realised he could use these skills to start writing scripts that could do things for him and that’s how his interest in coding started. Fast forward to some A levels at school, a computer science degree at the University of Leicester and Yusuf finally had a long successful career of software development ahead of him. Thanks Dad!</p><p><strong>So, what drew you to the Guardian?</strong></p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguar","link":"https://www.theguardian.com/info/2021/may/14/a-day-in-the-life","owner":"Groupon"},{"title":"Achieving observability in async workflows","description":"","link":"https://netflixtechblog.com/achieving-observability-in-async-workflows-cd89b923c784?source=rss----2615bd06b42e---4","owner":"Myntra Data Science"},{"title":"Automating Cloudflare Tunnel with Terraform","description":"An overview on how to use Terraform to automatically deploy Named Tunnels into your infrastructure with Cloudflare. \n","link":"https://blog.cloudflare.com/automating-cloudflare-tunnel-with-terraform/","owner":"Cloudera"},{"title":"Building Better IAM with a Scale-Out, OLTP Database","description":"The identity and access management platforms that I either used or researched in the past always left much to be desired. Most times their audit trails aren’t strong enough. Pricing per user or per session is too expensive. They don’t deploy easily in multiple regions. And they aren’t exactly easy to operate or scale across clouds. There was clearly a gap in the market for a modern IAM platform. I needed such a platform in order to properly do my previous job as a Head of eGovernment and IAM (in Switzerland).","link":"https://www.cockroachlabs.com/blog/scale-out-oltp-database/","owner":"Cloudflare"},{"title":"Celebrating 10 Years of Kotlin – Share Your Stories!","description":"On July 19, 2011, at the JVM Language Summit, JetBrains announced Kotlin – a new statically typed programming language for the JVM. So, it has been here for almost 10 years. Ever since its conception in 2011, it’s been changing the way we work at JetBrains and beyond. None of the strides we’ve taken would […]","link":"https://blog.jetbrains.com/kotlin/2021/05/10-years-of-kotlin-stories/","owner":"Klipse"},{"title":"DynamicDocs API: An Alternative Approach to HTML to PDF Generation","description":null,"link":"https://rapidapi.com/blog/dynamicdocs-api-html-to-pdf-api-latex/","owner":"Raizlabs"},{"title":"Error'd: l'Audace","description":"<p>\r\n</p>\r\n\r\n<p></p><p>\r\n<strong>Paul M.</strong> identifies an online vendor who isn&#39;t at all \r\n afraid of the bold ask. But he demurs. &#34;Uh, I think I&#39;ll stick with \r\nthe sale price thanks.&#34;\r\n</p><blockquote><p><a href=\"#bargain\"><img itemprop=\"image\" border=\"0\" alt=\"bargain\" src=\"https://thedailywtf.com/images/21/q1/e464/03-bargain.png\"/></a></p><p> </p></blockquote>\r\n\r\n<p></p><p>  \r\nClever <strong>Jim R.</strong> appears to have constructed a Jira \r\nworkflow that includes a transition named &#34;Cancel&#34;.  Thus, when\r\nhe chooses to &#34;Cancel&#34; an issue, he&#39;s presented with the option \r\nto continue to perform the Cancel operation or to cancel the Cancel. \r\n&#34;Will I cancel the Cancel or will I cancel the issue?&#34; he wonders.  \r\nReaders, what do you suppose?\r\nDid Jim set this up on purpose just for the WTF?\r\n\r\n</p><blockquote><p><a href=\"#cancel\"><img itemprop=\"image\" border=\"0\" alt=\"cancel\" src=\"https://thedailywtf.com/images/21/q1/e464/02-cancel.png\"","link":"https://thedailywtf.com/articles/l-audace","owner":"The Coded Self"},{"title":"Exploring the Visual Studio Code REST Book extension for native Notebooks","description":null,"link":"http://feeds.hanselman.com/~/652525576/0/scotthanselman~Exploring-the-Visual-Studio-Code-REST-Book-extension-for-native-Notebooks","owner":"Schakko"},{"title":"Guide to set up Gitlab CI for Rails tests","description":"In this article, I&rsquo;ll walk you through the steps for setting up a rails application on Gitlab CI. We&rsquo;ll create a new application and configure it to execute tests on Gitlab CI.\nCreate a new ruby on rails application $ rails new sample_rails_ci_setup After creating the application you need to push it to Gitlab. Use the instructions on Gitlab to create new project and push the code.\nVerify whether the test command is running successfully in the CLI by giving the command rails test","link":"https://crypt.codemancers.com/posts/2021-05-14-guide-to-setup-gitlab-ci-for-rails-test/","owner":"Codelitt"},{"title":"How Asynchronous Development Can Boost Productivity","description":"Therefore, this method allows continuous delivery and releases because contributions don't pause for any one unit, team, or person. One thing these asynchronous collaboration tools have in common is integrating distributed version control with issue tracking methods that teams can use. An asynchronous collaborating platform gives you room to properly document every step that every team member took, regardless of whether you will use those steps in the future.","link":"https://www.cloudbees.com/blog/asynchronous-development","owner":"CleverTap"},{"title":"How Pinterest Fights Spam Using Machine Learning","description":"","link":"https://medium.com/pinterest-engineering/how-pinterest-fights-spam-using-machine-learning-d0ee2589f00a?source=rss-ef81ef829bcb------2","owner":"PicCollage"},{"title":"How to access specific file occurrence in tar archive","description":"Access specific file occurrence in tar archive. Tar archive file can be updated multiple times, so it can contain multiple occurrences of the same files. $ tar --list --file archive.tar.gz project/readme.txt project/readme.txt project/readme.txt project/readme.txt project/src/ [...] You can access each occurrence using occurrence parameter (1 is the first occurrence). $ tar --extract --to-stdout --occurrence=1 --file […]","link":"https://sleeplessbeastie.eu/2021/05/14/how-to-access-specific-file-occurrence-in-tar-archive/","owner":"Mike Fogus"},{"title":"How We Made Your AI-Generated Lover With A GAN","description":null,"link":"https://tech.buzzfeed.com/how-we-made-your-ai-generated-lover-with-a-gan-bdcd347b0038?source=rss----140b2c7c3466---4","owner":"Brandwatch"},{"title":"Introducing Orbit, An Open Source Package for Time Series Inference and Forecasting","description":null,"link":"https://eng.uber.com/orbit/","owner":"Twitch"},{"title":"JFugue Beginners Guide Part I: Notes, Durations, Patterns","description":"JFugue is a Java library used to create immersive music. In this guide, we'll take a look at how to use notes, durations and patterns for basic music generation.","link":"https://stackabuse.com/jfugue-beginners-guide-part-i-notes-durations-patterns","owner":"Srinivas Tamada"},{"title":"JFugue Beginners Guide Part II: Chords and Chord Progressions","description":"JFugue is a Java library that creates music! This is the second article of a JFugue tutorial series, and we cover chords and chord progressions.","link":"https://stackabuse.com/jfugue-beginners-guide-part-ii-chords-and-chord-progressions","owner":"Srinivas Tamada"},{"title":"Multi-step Forms for Laravel","description":"\n                                    ","link":"https://laravel-news.com/arcanist","owner":"Kotlin"},{"title":"Of Protocols and Pythons","description":null,"link":"https://galois.com/blog/2021/05/of-protocols-and-pythons/","owner":"Future Processing"},{"title":"Pinebook Pro review","description":"<p>I received the original Pinebook for free from the good folks at Pine64 a few\nyears ago, when I visited Berlin to work with the KDE developers. Honestly, I\nwas underwhelmed. The performance was abysmal and ARM is a nightmare to work\nwith. For these reasons, I was skeptical when I bought the Pinebook Pro. I have\nalso <a href=\"https://drewdevault.com/2020/02/18/Fucking-laptops.html\">spoken of my disdain for modern laptops in general before</a>: the state\nof laptops in $CURRENTYEAR is abysmal. As such, I have been using a ThinkPad\nX200, an 11 year old laptop, as my sole laptop for several years now.</p>\n<p>I am pleased to share that the Pinebook Pro is a pleasure to use, and is likely\nto finally replace the old ThinkPad for most of my needs.</p>\n<p>Let me get the bad parts out of the way upfront: ARM is still a nightmare to\nwork with. I really hate this architecture. Alpine Linux&rsquo;s upstream aarch64\ndoesn&rsquo;t work with this laptop, so I have to use <a href=\"http://postmarketos","link":"https://drewdevault.com/2021/05/14/Pinebook-Pro-review.html","owner":"Dragan Gaic"},{"title":"RuntimeError: view size is not compatible with input tensor’s size and stride (at least one dimension spans across two contiguous subspaces)","description":null,"link":"http://redino.net/blog/2021/05/runtimeerror-view-size-is-not-compatible-with-input-tensors-size-and-stride-at-least-one-dimension-spans-across-two-contiguous-subspaces/?utm_source=rss&utm_medium=rss&utm_campaign=runtimeerror-view-size-is-not-compatible-with-input-tensors-size-and-stride-at-least-one-dimension-spans-across-two-contiguous-subspaces","owner":"Redbubble"},{"title":"What the Cybersecurity Executive Order Means for the Enterprise","description":"However, since the supply chain is so interconnected, these orders will eventually (and probably quicker than imagined) apply directly to most any company worldwide that releases software. As you might have read, the Executive Order “makes a significant contribution toward modernizing cybersecurity defenses by protecting federal networks, improving information-sharing between the U.S. government and the private sector on cyber issues, and strengthening the United States’ ability to respond to incidents when they occur.”. While we were discussing this internally yesterday, someone here at CloudBees raised the question of “How will companies have to change their processes in order to comply with these Executive Orders?” A quick reply came in the form of ”If anyone has to change how they’re delivering software in order to comply, they probably weren’t doing it right in the first place.”.","link":"https://www.cloudbees.com/blog/what-cybersecurity-executive-order-means","owner":"CleverTap"}]