[{"title":"Advice on looking for a new software engineering job","description":"<p>I've been working professionally as a software engineer since 2006, which means I've been doing this long enough that people now ask me for advice. I've only changed jobs 3 times in my career, so I'm not sure I'm an expert. However, I decided I should write down my advice, to clarify my thinking and to efficiently share it with others. This turned out much longer than I expected, so I guess I have lots of opinions!</p>\n\n\n<h2>Know what you want</h2>\n<p>My job search often starts with a nagging feeling that something isn't quite right. My first task is to figure out more precisely what I want. You might already know, but making time to think about it helps me understand what I'm looking for. You need some criteria to decide which opportunities to pursue, and which are not for you. You need to be honest with yourself. It is totally fine if your list of desired job attributes includes things like &quot;any job&quot;, &quot;more money&quot;, &quot;working fewer hours,&quot; or &quot;a pr","link":"https://www.evanjones.ca/software-job-search-advice.html","owner":"Evan Hahn"},{"title":"Better moving quantile estimations using the partitioning heaps","description":"<p>In one of the previous posts, I <a href=\"https://aakinshin.net/posts/partitioning-heaps-quantile-estimator/\">have discussed</a> the Hardle-Steiger method.\nThis algorithm allows estimating <a href=\"https://en.wikipedia.org/wiki/Moving_average#Moving_median\">the moving median</a>\nusing <span class=\"math inline\">\\(O(L)\\)</span> memory and <span class=\"math inline\">\\(O(log(L))\\)</span> element processing complexity (where <span class=\"math inline\">\\(L\\)</span> is the window size).\nAlso, I have shown how to adapt this approach to estimate <em>any</em> moving quantile.</p>\n<p>In this post, I&rsquo;m going to present further improvements.\nThe Hardle-Steiger method always returns the <a href=\"https://en.wikipedia.org/wiki/Order_statistic\">order statistics</a>\nwhich is the <span class=\"math inline\">\\(k\\textrm{th}\\)</span> smallest element from the sample.\nIt means that the estimated quantile value always equals one of the last <span class=\"math inline\">\\(L\\)</span> observed numbers.\nHowever,","link":"https://aakinshin.net/posts/partitioning-heaps-quantile-estimator2/","owner":"Andrew Ray"},{"title":"Calling All Merchants! Trust, Simplicity and Social Connectivity Prevail as Venmo Customers’ Most Valued Payment Tool Features","description":null,"link":"http://blog.venmo.com/hf2t3h4x98p5e13z82pl8j66ngcmry/2021/1/18/calling-all-merchants-trust-simplicity-and-social-connectivity-prevail-as-venmo-customers-most-valued-payment-tool-features","owner":"Vena Solutions"},{"title":"Decline the 15 Minute Post-Vaccination Waiting Period","description":"In very rare cases, the Pfizer and Moderna vaccines will cause the person being vaccinated to have an allergic reaction. When I say very rare, I mean it; the chances are a few in a million, or about the same of picking a specific resident of Newark, New Jersey at random out of the phone […]","link":"https://kevin.burke.dev/kevin/covid-decline-allergic-reaction-wait/","owner":"K. Harrison"},{"title":"GDPR Compliance is Not Easy, But CockroachDB Can Help","description":"Since January 28, 2020, the EU has issued $192 million (€158.5 million) in fines for GDPR (General Data Protection Regulation) violations (DLA Piper, Engadget). Although companies have had years to become fully GDPR compliant, compliance is not easy. After the GDPR took effect in 2018, we had a conversation with Cockroach Labs co-founder and CEO Spencer Kimball on the topic, who detailed the nuances of the law and what companies should do to comply within the context of their databases.","link":"https://www.cockroachlabs.com/blog/gdpr-q-and-a/","owner":"Cloudflare"},{"title":"How technology is powering election coverage","description":"<p>In the second of three articles, we look at the role of software engineers in analysing online political advertising during the 2019 UK General Election</p><p><em>This is part two of a series of three blogposts about the first year of the new Investigations &amp; Reporting team, a small group of software developers embedded in the Guardian newsroom. Read about our work on <a href=\"https://www.theguardian.com/info/2021/jan/12/how-technology-is-powering-environmental-reporting\">environmental reporting here</a> and <a href=\"https://www.theguardian.com/info/2021/feb/04/how-technology-is-powering-covid-19-investigations\">Covid-19 investigations here</a>.</em></p><p>The 2019 UK general election campaign was a big test of our ability to work with journalists to an editorial deadline. We used all the knowledge and skills we had gained while <a href=\"https://www.theguardian.com/info/2021/jan/12/how-technology-is-powering-environmental-reporting\">working on the Polluters Project</a>.</p><p><s","link":"https://www.theguardian.com/info/2021/jan/19/how-technology-is-powering-election-coverage","owner":"Groupon"},{"title":"How to Design Your Video Player with UX in Mind","description":"\n            ","link":"https://www.sitepoint.com/laravel-livewire-getting-started/?utm_source=rss","owner":"Sift Science"},{"title":"Introducing GitLab integration for DigitalOcean App Platform","description":"DigitalOcean App Platform is a modern PaaS (Platform as a Service) solution that makes it super simple to build, deploy, manage, and scale apps. It’s fully managed, meaning App Platform does all the heavy lifting of provisioning and managing infrastructure, operating systems, databases, application runtimes, and other dependencies so you can focus on what truly matters:  building awesome apps.","link":"https://www.digitalocean.com/blog/introducing-gitlab-integration-for-digitalocean-app-platform","owner":"Deliveroo"},{"title":"Uber’s Real-time Data Intelligence Platform At Scale: Improving Gairos Scalability/Reliability","description":null,"link":"https://eng.uber.com/gairos-scalability/","owner":"Twitch"}]