[{"title":"[Unix] The most primitive local search engine for your books library","description":"[Unix] The most primitive local search engine for your books library","link":"https://yurichev.com/news/20210403_search_engine/","owner":"Dennis Yurichev"},{"title":"A web testing deep dive: The MDN web testing report","description":null,"link":"https://hacks.mozilla.org/2021/04/a-web-testing-deep-dive-the-mdn-web-testing-report/","owner":"Mozilla Hacks"},{"title":"eBay Motors & State Management","description":null,"link":"https://tech.ebayinc.com/engineering/ebay-motors-state-management/","owner":"Ebay"},{"title":"How to Benchmark and Tune Google Cloud","description":"Engineers on cloud performance teams can spend their entire workday tuning and optimizing cloud configurations. We caught up with Steve Dietz, a Google software engineer focused on Google Cloud performance, to get advice on how to performance tune, provision, and benchmark Google Cloud Platform (GCP). The conversation led to some revealing insights into how to configure GCP to be most optimal for your workloads. We&rsquo;ve gathered some of those insights below.","link":"https://www.cockroachlabs.com/blog/benchmark-google-cloud/","owner":"CockroachDB"},{"title":"How We Enable Airbnb Team Members to Code Like a Mobile Engineer","description":"","link":"https://medium.com/airbnb-engineering/how-we-enable-airbnb-team-members-to-code-like-a-mobile-engineer-d7181a20399f?source=rss----53c7c27702d5---4","owner":"Airbnb"},{"title":"Move Slow and Make Things","description":"<figure style=\"margin-bottom: 1rem;\">\n  <img with=\"100%\" alt=\"craft-data-science\" src=\"/assets/posts/2021-04-01-move-slow-make-things/bryan-hipster-data-science.jpg\" />\n  <figcaption style=\"margin-top: 0.5rem; text-align: right;\">photo by Bryan Bischof</figcaption>\n</figure>\n\n<p>Personalization is core to Stitch Fix. We strive to find the right clothing for each and every client: the right style, the right fit, and at the right price. However, we’ve noticed one area where we’ve fallen short in taking a personalized approach: how we build our algorithms.</p>\n\n<p>We have relied too much on the impersonal and abstract “power tools” of data science to do this work. Python, Spark, R, and Presto have served us well for many years. They have allowed us to explore ideas <em>quickly</em>, implement and iterate solutions <em>quickly</em>, and let our peers understand our work <em>quickly</em>. But what happens when you remove the need to do things <em>quickly</em>? By dropping this constraint, w","link":"https://multithreaded.stitchfix.com/blog/2021/04/01/move-slow-make-things/","owner":"Stitch Fix"},{"title":"People, Product, and Technology: A Beginner’s Guide to Engineering Management","description":"What makes a successful engineering manager? Success usually depends on how managers lead their people, product, and technology.\r\n\r\nIn this article, we examine what it takes to get started and progress in the engineering manager role.","link":"https://www.toptal.com/engineering-team-manager/engineering-manager-role-explained","owner":"Toptal"},{"title":"Scanning Harbor registry images for vulnerabilities with Snyk","description":"Snyk Container offers support for scanning container images stored in the popular open source container registry, Harbor. Learn how to use it to keep your containers safe.","link":"https://snyk.io/blog/scanning-harbor-registry-images-for-vulnerabilities-snyk/","owner":"Snyk"},{"title":"Scanning Red Hat Quay registry images for vulnerabilities with Snyk","description":"We’re excited to share that you can now scan container images stored in Red Hat’s Quay container registry and their hosted Quay.io service with Snyk Container. Snyk Container helps you find and fix vulnerabilities in your container images and integrates with Quay as a container registry to enable you to import your projects and monitor […]","link":"https://snyk.io/blog/quay-vulnerability-scanning-with-snyk/","owner":"Snyk"},{"title":"The 4 Key Elements of Digital Trust","description":null,"link":"https://medium.com/feedzaitech/the-4-key-elements-of-digital-trust-b024c796ef3c?source=rss----e11168e7fe6b---4","owner":"Feedzai"},{"title":"The Fault In Our Models","description":"<figure style=\"margin-bottom: 1rem;\">\n  <video autoplay=\"\" loop=\"\" muted=\"\" poster=\"/assets/posts/2021-04-01-fault-in-our-models/teaser-preview.png\" style=\"max-width: 100%;\">\n    <source src=\"/assets/posts/2021-04-01-fault-in-our-models/teaser.mp4\" type=\"video/mp4\" />\n    <p>\n      Your browser doesn't support HTML5 video. Here is a\n      <a href=\"/assets/posts/2021-04-01-fault-in-our-models/teaser.mp4\">link to the video</a> instead.\n    </p>\n  </video>\n\n  <figcaption style=\"margin-top: 0.5rem; text-align: center;\">Movement of the Sun, Earth and Mercury</figcaption>\n</figure>\n\n<p>One of the longest-tenured Algorithms tools at Stitch Fix is the Demand Model, owned and operated by a team named The FED (Forecasting and Estimation of Demand). As one can imagine, an accurate demand forecast supports running an efficient business and is invaluable to a number of applications from how to staff warehouses, to guiding merchandise purchases.</p>\n\n<p>The demand model has served Stitch Fix well ov","link":"https://multithreaded.stitchfix.com/blog/2021/04/01/fault-in-our-models/","owner":"Stitch Fix"},{"title":"Top 7 security best practices for APIs","description":null,"link":"https://blog.sqreen.com/security-best-practices-apis/","owner":"Sqreen"}]