[{"title":"How a Jenkins Job Broke our Jenkins UI","description":null,"link":"https://slack.engineering/how-a-jenkins-job-broke-our-jenkins-ui/?utm_source=rss&utm_medium=rss&utm_campaign=how-a-jenkins-job-broke-our-jenkins-ui","owner":"Skyscanner"},{"title":"Introducing the Investment Climatology Project","description":"Follow the money, goes the phrase, but first comes the idea. Before and below the financial engineering of investment lies...","link":"https://blog.rinesi.com/2021/06/introducing-the-investment-climatology-project/","owner":"Marc Plano-Lesay"},{"title":"Let’s make a message encoder in Ruby","description":null,"link":"https://medium.com/zendesk-engineering/lets-make-a-message-encoder-in-ruby-1bbca8065f62?source=rss----a88376ea904a---4","owner":"ZeeMee"},{"title":"Load Testing Your API Using Locust","description":null,"link":"https://nordicapis.com/load-testing-your-api-using-locust/","owner":"Nextdoor"},{"title":"Red Hat Software Collections 3.7 and Red Hat Developer Toolset 10.1 now generally available","description":"<p>The latest versions of <a href=\"https://developers.redhat.com/products/softwarecollections/overview\">Red Hat Software Collections</a> and <a href=\" /products/developertoolset/overview\">Red Hat Developer Toolset</a> are now generally available. Red Hat Software Collections 3.7 delivers the latest stable versions of many popular open source runtime languages, web servers, and databases natively to the <a href=\"https://developers.redhat.com/products/rhel/overview\">world’s leading enterprise Linux platform</a>. These components are supported for up to five years for a more consistent, efficient, and reliable developer experience.</p>\n\n<h2>What's new in Red Hat Software Collections 3.7</h2>\n\n<p>New and updated collections in the latest release of Red Hat Software Collections include:</p>\n\n<ul><li><strong>PostgreSQL 13</strong>: This version provides a number of new features and enhancements over version 12. Notable changes include performance improvements resulting from de-duplication of","link":"https://developers.redhat.com/articles/2021/06/03/red-hat-software-collections-37-and-red-hat-developer-toolset-101-now-generally","owner":"Redino"},{"title":"What's a good team process?","description":"<p>You may have heard about the <a href=\"https://intersol.ca/news/organizational-culture-and-the-5-monkeys-experiment/\">five monkeys experiment</a>, a cautionary tale sometimes used to illustrate how we can get locked up in an organisational harness without sufficient hindsight, power or leeway to change the way things are.</p>\n\n<p>This comparison may sound unflattering, but I have seen similar situations in previous lives, where a process I don’t understand is enforced, and I simply end up complying and assimilating it as normal. No-one is really responsible for that process, it may not even be relevant anymore, but it’s still there and is so much part of the habits that nobody thinks of questioning it, or the ones who do get dismissed with a “that’s how it is”.</p>\n\n<p>Of course not all processes are like this. All organisations have frictions, and introducing processes or rituals is a sensible answer to some of them. When well thought out, good processes can avoid outage, enforce co","link":"https://getaround.tech/team-processes/","owner":"Doximity"}]