[{"title":"Accessing the Relay Store Without a Mutation","description":"<p>I recently encountered a problem where client-side data (returned from a Relay query) became out of sync after a\nuser interaction. How can we make sure our data is consistent while maintaining a single source of truth? This post\nexplores why a developer might want to update client-side data locally, the basics of Relay and its store, and how\nto delete records in the store when you're not using a mutation.</p>\n\n<a name=\"Relay.x.Artsy.x.Me\"></a>\n<h2>Relay x Artsy x Me</h2>\n\n<p><a href=\"https://relay.dev/\">Relay</a> is a GraphQL client library maintained by Facebook engineers and enables rapid client-side data\nfetching in React applications. <a href=\"https://artsy.github.io/blog/2019/04/10/omakase-relay/\">Artsy's adoption of Relay</a> coincided with our move\ntoward using React Native for our mobile work around 2016. I joined Artsy as an engineer in November of 2020 (after\n<a href=\"https://medium.com/swlh/how-losing-my-job-helped-me-find-my-way-back-8c8f86552acc\">transitioning to engine","link":"https://artsy.github.io/blog/2021/04/15/accessing-the-relay-store/","owner":"Arkency"},{"title":"Chef Community Recognition Program and Live Celebration","description":null,"link":"https://blog.chef.io/chef-community-recognition-program-and-live-celebration","owner":"Chartbeat"},{"title":"Fueling the Start-up Economy: Crowdfunding on a Transaction-Oriented System","description":"This is the story of how Australian-based Birchal created a crowdfunding platform on CockroachDB  Early stage capital is one of the many financial services sectors experiencing digital disruption. Up and coming startup founders are increasingly turning to online equity crowdfunding platforms instead of pursuing traditional early-stage capital raising methods.\nIn recent years, equity crowdfunding was established as a reliable and popular mechanism for startups and SMEs to raise capital. However, building an affordable, easy-to-use online platform for companies (and investors) to use is not an easy feat.","link":"https://www.cockroachlabs.com/blog/birchal-funding-platform/","owner":"Cloudflare"},{"title":"Hostinger Users Can Now Benefit From Patchstack WordPress Security","description":null,"link":"https://www.hostinger.com/blog/hostinger-users-can-now-benefit-from-patchstack-wordpress-security","owner":"Hootsuite"},{"title":"JVM Profiling in Kubernetes with Java Flight Recorder","description":"","link":"https://tech.olx.com/jvm-profiling-in-kubernetes-with-java-flight-recorder-b39a6181a99c?source=rss----761b019b483f---4","owner":"Okta"},{"title":"Kubernetes As Explained Through the 1997 Blockbuster Titanic","description":"Titanic is a 1997 Oscar-winning film starring Leonard DiCaprio and Kate Winslet (who will from now on be referred to as K8 Winslet) in a love story aboard the ill-fated Titanic ship. As we know, the Titanic was an &ldquo;unsinkable ship&rdquo; - the largest ship in the world at that time - yet it sank mere days into its maiden voyage, costing the lives of 1500 people on board when it hit an iceberg and sunk to the bottom of the North Atlantic on April 15, 1912.","link":"https://www.cockroachlabs.com/blog/titanic-explains-kubernetes/","owner":"Cloudflare"},{"title":"Made Tech Team Interview: Gráinne Blake, Senior Delivery Manager","description":null,"link":"https://www.madetech.com/blog/made-tech-team-interview-grainne-blake-senior-delivery-manager/","owner":"Lyft"},{"title":"Modern Apps Live: Learn Serverless, Containers and More in May","description":"Modern Apps Live is a series of events about&nbsp;modern application development that will be live-streaming on&nbsp;Twitch in May.&nbsp;Session topics include serverless, containers, and mobile and front-end development. If you’re not familiar, modern applications are those that: Can scale quickly to millions of users. Have global availability. Manage a lot of data (we’re talking exabytes of […]","link":"https://aws.amazon.com/blogs/aws/modern-apps-live-learn-serverless-containers-and-more-during-may/","owner":"Avenue Code"},{"title":"No Data Loss and No Service Interruption – HDF to CFM Rolling Migration","description":null,"link":"https://blog.cloudera.com/no-data-loss-and-no-service-interruption-hdf-to-cfm-rolling-migration/","owner":"CloudBees"},{"title":"Starting a TypeScript Project in 2021","description":"<p>This is a guide for starting a TypeScript project in 2021 with modern tooling.</p>\n<ul>\n<li><a href=\"https://www.typescriptlang.org/\">TypeScript 4</a></li>\n<li>Optionally <a href=\"https://esbuild.github.io/\">esbuild</a> to bundle for browsers (and Node.js)</li>\n<li>Linting with <a href=\"https://github.com/typescript-eslint/typescript-eslint\">typescript-eslint</a> (<a href=\"https://palantir.github.io/tslint/\">tslint</a> is deprecated)</li>\n<li>Testing with <a href=\"https://jestjs.io/docs/getting-started\">Jest</a> (and <a href=\"https://www.npmjs.com/package/ts-jest\">ts-jest</a>)</li>\n<li>Publishing a package to npm</li>\n<li>Continuous integration (<a href=\"https://docs.github.com/en/actions\">GitHub Actions</a> / <a href=\"https://docs.gitlab.com/ee/ci/\">GitLab CI</a>)</li>\n<li>Automatic API documentation with <a href=\"https://typedoc.org/guides/doccomments/\">TypeDoc</a></li>\n</ul>","link":"https://www.metachris.com/2021/04/starting-a-typescript-project-in-2021/","owner":"Chien Tran"},{"title":"Taking your business to new (Pareto) frontiers","description":"<figure style=\"margin-bottom: 1rem;\">\n  <img src=\"/assets/posts/2021-04-15-multi-objective-bandit/header-image-borders.png\" style=\"width: 100%\" />\n</figure>\n\n<p><em>“I want it all, I want it all, I want it all, and I want it now”</em> – Freddie Mercury (Queen).</p>\n\n<p>In their mid-80’s rock song I Want It All, it seems like Queen did not want to acknowledge the reality that life is all about tradeoffs. There is no escaping this reality in business settings. Most businesses face some form of tradeoff, which arises when there are competing objectives. A classic example is growth (customer base or revenue) versus profitability. But tradeoffs are pervasive in many other business aspects as well <a name=\"[1]\"></a><a href=\"#7\">[1]</a> . For example, a car manufacturer wants to minimize production costs while maximizing comfort. A restaurant owner wants to maximize the number of patrons they can seat, while minimizing meal wait times. Even if a company is aware that some trade-offs are being","link":"https://multithreaded.stitchfix.com/blog/2021/04/15/multi-objective-bandit/","owner":"Stackshare"},{"title":"Testing React Tracking with Jest and Enzyme","description":"<p>Recently, I needed to test a button that would make an analytics tracking call using\n<a href=\"https://github.com/NYTimes/react-tracking\">react-tracking</a> and then navigate to a new page in a callback. This\npresented some challenges - I wasn't sure how to create a mocked version of react-tracking that would allow a\ncallback to be passed.</p>\n\n<p>With some help from fellow Artsy engineers <a href=\"https://github.com/damassi\">Christopher Pappas</a> and\n<a href=\"https://twitter.com/pvinis\">Pavlos Vinieratos</a>, I got the tracking and testing to work. Here's how we did it.</p>\n\n<!-- more -->\n\n\n<a name=\"A.little.context\"></a>\n<h1>A little context</h1>\n\n<p>This work took place in Volt, our partner CMS (it's sadly a private repository, but I'll do my best to paste in\nrelevant code snippets so you're not totally in the dark). Volt has been around for a long time and has had several\ndifferent client-side tracking implementations over the years. In this case, I wanted to take the opportunit","link":"https://artsy.github.io/blog/2021/04/15/testing-react-tracking-with-jest-and-enzyme/","owner":"Arkency"},{"title":"VSCode SFTP plugin connecting with private key error:OPENSSL_internal:DECODE_ERROR","description":null,"link":"http://redino.net/blog/2021/04/vscode-sftp-plugin-connecting-with-private-key-erroropenssl_internaldecode_error/?utm_source=rss&utm_medium=rss&utm_campaign=vscode-sftp-plugin-connecting-with-private-key-erroropenssl_internaldecode_error","owner":"Redbubble"},{"title":"We Don’t Get Bitter, We Get Better","description":"","link":"https://open.nytimes.com/we-dont-get-bitter-we-get-better-b5d2783d5cd3?source=rss----51e1d1745b32---4","owner":"Netflix"},{"title":"What’s new in CDP Private Cloud Base 7.1.6?","description":null,"link":"https://blog.cloudera.com/whats-new-in-cdp-private-cloud-base-7-1-6/","owner":"CloudBees"}]