[{"title":"A Day in the Life","description":"<p>Welcome to the latest post in our ‘Day in the Life’ blog series, in which product and engineering’s digital coordinator, Rasha Ardati, interviews a colleague from the department to reflect on their career and experiences at the Guardian</p><p>Sophie Lambrakis is a senior iOS developer on the mobile apps team who first discovered programming during her A-levels. Until that point she thought computing was just about using Microsoft Office, and found it a bit dull. She took computing A-level because she thought it would be easy (spoiler alert: it wasn’t). Fortunately, Sophie discovered programming and, most importantly, that she really enjoyed it. She then went on to complete a computing degree at Imperial College London.</p><p><strong>What was next after the degree?</strong></p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguardian.com/info/2021/apr/16/a-day-in-the-life\">Continue reading...</a>","link":"https://www.theguardian.com/info/2021/apr/16/a-day-in-the-life","owner":"Groupon"},{"title":"Linters Implemented by Ruby Libraries","description":"When you hear the word “linter,” you probably think about particular widely used tools. But there’s a different kind of linters.\r\n\r\nIn this article, Toptal Back-end Architect Robert Pankowecki introduces you to linters implemented by Ruby libraries and details their capabilities.","link":"https://www.toptal.com/ruby/ruby-lint-libraries","owner":"Tinder"},{"title":"Marketing to millennial homeowners: A guide for home services providers","description":"From getting a quote for a solar installation to matching a desired paint color, millennials value seamless communication that meets them where they already are in the digital realm. ","link":"https://faraday.ai/blog/marketing-millennial-homeowners/","owner":"Facebook AI Research"},{"title":"More Good Programming Quotes, Part 5","description":"Here are more good programming quotes I have found since my last post. Programming “It has been said that the great scientific disciplines are examples of giants standing on the shoulders of other giants. It has also been said that … ","link":"https://henrikwarne.com/2021/04/16/more-good-programming-quotes-part-5/","owner":"Henrik Lau Eriksson"},{"title":"New! CKS Certification Prep Course","description":"\n                    ","link":"https://d2iq.com/blog/new-cks-certification-prep-course","owner":"MemSQL"},{"title":"Wait","description":"<p>Throughout much of this pandemic, while traumatic, it was comforting that we were all in this together. Now, as many of my American and UK friends get their first vaccinations, they are starting to return to a normal life. They are travelling, they are visiting family, and they are making plans for the summer. </p>\r\n\r\n<p>In Canada, however, vaccines have been slow going and cases are on the rise. Cases per 100,000 has exceeded that of the US for the first time since the beginning of the pandemic. And it is unlikely I’ll be able to receive a vaccine before July. Even receiving one before the end of summer could be questionable, which is disappointing to consider. And now a new stay-at-home order just as the warmer weather has arrived. </p>\r\n\r\n<p>I am demoralized and demotivated and all I can do is…</p>\r\n\r\n<p>wait. </p><hr><small><a href=\"mailto:snookca@snk.ms\">Reply via email</a></small>","link":"http://snook.ca/archives/personal/wait","owner":"Jonathan Dekhtiar"}]