[{"title":"An Introduction to the JavaScript Temporal API","description":"\n            ","link":"https://www.sitepoint.com/flarum-add-web3-address-to-user-profile/?utm_source=rss","owner":"Sift Science"},{"title":"Billing Extraction: A Tale of GraphQL Internal API Optimization","description":"Extracting functional components from a monolithic app into a service can be a daunting task but choosing the right tools and techniques for the job can expedite the process.\r\n\r\nIn this article, Toptal Back-end Engineer Maciek Rzasa recounts how his team extracted billing functionality from the Toptal platform and how they overcame a series of performance issues.","link":"https://www.toptal.com/graphql/graphql-internal-api-optimization","owner":"Tinder"},{"title":"Extending Flarum: Adding a Web3 Address to a User’s Profile","description":"\n            ","link":"https://www.sitepoint.com/how-to-improve-user-experience-with-accurate-user-feedback/?utm_source=rss","owner":"Sift Science"},{"title":"New Year’s Resolutions: Shed those excess pounds (from my Google inbox)!","description":"TL;DR → Smart links to quickly clear out your Gmail inboxes Do you know your Do you know your current GMail storage usage?   How much is dead weight? To ring in the new year, I decided to finally buckle down and clear out my GMail inbox. I spent a total of 10 minutes and, just […]","link":"https://blog.octo.com/en/new-years-resolutions-shed-those-excess-pounds-from-my-google-inbox/","owner":"Nvidia"},{"title":"See Your Evernote Like Never Before With Home","description":null,"link":"https://evernote.com/blog/see-evernote-like-never-before-with-home/","owner":"Eventbrite"},{"title":"Some of (remote) git internals, part II","description":"Some of (remote) git internals, part II","link":"https://yurichev.com/news/20210117_remote_git/","owner":"Dennis Felsing"},{"title":"The modern Droplet: How to choose the “right” VM for business and personal use","description":"DigitalOcean Droplets are on-demand, Linux virtual machines suitable for production business applications and personal passion projects. We’ve recently introduced Storage-Optimized Droplets with NVMe SSD, and have also made other adjustments to our Droplet portfolio.\n\nWith these developments in mind, and with 2021 having arrived at last, we thought it would be a good time to provide up-to-date guidance regarding how to match your Droplet plan to your use case. You might also watch my talk from deploy, in which I speak to this and related topics:","link":"https://www.digitalocean.com/blog/how-to-choose-the-right-droplet-vm","owner":"Deliveroo"}]