[{"title":"Engineering dependability and fault tolerance in a distributed system","description":"<div align=\"center\"><img src=\"https://live.staticflickr.com/65535/50959792262_7f954fe2ce_z.jpg\" alt=\"\" width=\"500\" /></div>\r\n<p>&nbsp;</p>\r\n<p><em>This is a guest post by <a href=\"https://www.linkedin.com/in/paddybyers/\">Paddy Byers</a>, Co-founder and CTO at <a href=\"https://www.ably.io/\">Ably</a>, a realtime data delivery platform. You can view the original article on <a href=\"https://www.ably.io/blog/engineering-dependability-and-fault-tolerance-in-a-distributed-system\">Ably's blog</a>.</em></p>\r\n<p>Users need to know that they can depend on the service that is provided to them. In practice, because from time to time individual elements will inevitably fail, this means you have to be able to continue in spite of those failures.</p>\r\n<p>In this article, we discuss the concepts of dependability and fault tolerance in detail and explain how the Ably platform is designed with fault tolerant approaches to uphold its dependability guarantees.</p>\r\n<p>As a basis for that discussion, first ","link":"http://feedproxy.google.com/~r/HighScalability/~3/-z2zmtVlA5g/engineering-dependability-and-fault-tolerance-in-a-distribut.html","owner":"Henrik Warne"},{"title":"Fast and Reliable Schema-Agnostic Log Analytics Platform","description":null,"link":"https://eng.uber.com/logging/","owner":"Twitch"},{"title":"Intern Report – Cross-lingual text-to-speech synthesis via domain adaptation and mutual information minimization","description":null,"link":"https://engineering.linecorp.com/en/blog/intern-report-cross-lingual-text-to-speech-synthesis-via-domain-adaptation-and-mutual-information-minimization/","owner":"LendingHome"},{"title":"Reminder: Weekly Python Exercise B1 (advanced topics 1) starts on Tuesday!","description":null,"link":"https://lerner.co.il/2021/02/19/reminder-weekly-python-exercise-b1-advanced-topics-1-starts-on-tuesday/","owner":"Lea Verou"},{"title":"Safer Credential Handling In Serverless Components","description":"We have removed local AWS profile access from the Serverless Components service completely","link":"https://serverless.com/blog/safer-component-credentials/","owner":"Sensible"},{"title":"UNIwise Delivers a Frictionless Experience for Remote Learners with Kubernetes & CockroachDB","description":"Since the COVID-19 pandemic began, there has been a massive traffic spike in everything digital--from online shopping to remote learning. Under the hood, companies responsible for these technologies have had to quickly adapt to handle the growth in users. Having an elastically scalable and cloud-native stack--all the way down to the database--has helped ease this transition.\nOne such company that experienced a pandemic-driven surge in popularity was UNIwise, an education tech company based in Denmark that sells an online test platform called WISEflow.","link":"https://www.cockroachlabs.com/blog/cockroachdb-helps-universities-power-remote-learning-in-pandemic/","owner":"Cloudflare"}]