[{"title":"#ClouderaLife Spotlight: Kevin Smith, Staff Customer Operations Engineer","description":null,"link":"https://blog.cloudera.com/clouderalife-spotlight-kevin-smith-staff-customer-operations-engineer/","owner":"CloudBees"},{"title":"A Journey To build a Business-Driven Data Science Capability","description":"Introduction We live in a world in which data is becoming a key business asset, playing an increasingly central role in the success of a growing number of companies. Data and the ability to transform data into business will become critical in all sectors in the coming years. A good mastery of data and its […]","link":"https://blog.octo.com/en/a-journey-to-build-a-business-driven-data-science-capability/","owner":"Nvidia"},{"title":"Afterpay","description":"Boost sales in minutes with Afterpay on Stripe—Offering buy now, pay later options like Afterpay can give your buyers more flexibility at checkout.","link":"https://stripe.com/payments/afterpay-clearpay","owner":"Stride"},{"title":"Contact Tracing COVID-19 With An Open Source App Built on CockroachDB","description":"The thought of developing a solution for “epidemic management” was not what Quarano engineers had in mind this time last year. In fact, Quarano’s story started just a few months ago at a government-sponsored hackathon in Germany. At the hackathon, over 40,000+ participants were asked to build applications and services to help manage and decrease the spread of COVID-19. As we now know, contact tracing is an important tactic of managing a crisis.","link":"https://www.cockroachlabs.com/blog/contact-tracing-covid-19/","owner":"Cloudflare"},{"title":"Dependency Inversion as a Driver to Scale Mobile Development","description":"SoundCloud’s iOS codebase faced a radical change a couple of years ago. The team had decided to modularize the codebase into frameworks…","link":"https://developers.soundcloud.com/blog/dependency-inversion-as-a-driver-to-scale-mobile-development","owner":"Soshace"},{"title":"Five Trends for the Financial Services Industry to Track in 2021","description":null,"link":"https://blog.cloudera.com/five-trends-for-the-financial-services-industry-to-track-in-2021/","owner":"CloudBees"},{"title":"How eBay’s Buy APIs Hit $5 Billion in Gross Merchandise Bought","description":null,"link":"https://tech.ebayinc.com/engineering/how-ebays-buy-apis-hit-5-billion-in-gross-merchandise-bought/","owner":"Dropbox"},{"title":"Keeping Legacy Software Alive: A Case Study","description":"<img typeof=\"foaf:Image\" src=\"https://technology.riotgames.com/sites/default/files/articles/119/legacysoftwarealiveheader.jpg\" width=\"1999\" height=\"798\" alt=\"\" />\n<p>Hi all, Brian \"Penrif\" Bossé here with a fresh batch of gory, nerdy details surrounding an outage for <em>League</em>. Today we'll be going through why the EU West shard was out to lunch for just over five hours on January 22, 2021. We don't always write these things up - they take time to do and the reasons for outages aren't always that interesting - but this one was particularly painful as it was quite long and on the heels of some other, unrelated outages so figured it'd be worth a dive.</p>\n","link":"https://technology.riotgames.com/news/keeping-legacy-software-alive-case-study","owner":"Rightscale"},{"title":"Level Up: Mastering statistics with Python – part 2","description":null,"link":"https://stackoverflow.blog/2021/02/23/level-up-mastering-statistics-with-python-part-2/","owner":"Squarespace"},{"title":"Reactive Programming - The Price You Have To Pay For A Responsive Backend","description":"In the trivago backend, we use the reactive programming pattern for fetching prices from advertisers and updating our caches. This helps us to increase the responsiveness (i.e., scalability and resilience) of our backend. Thus, our backend system can alleviate high response times from internal components and our advertisers while staying responsive, even if downstream components fail entirely. Here is how we use the Java library Reactor Core to ensure those guarantees:","link":"https://tech.trivago.com/2021/02/24/reactive-programming-the-price-you-have-to-pay-for-a-responsive-backend/","owner":"TripAdvisor"},{"title":"Reverse Engineering for Beginners published in Korean language","description":"Reverse Engineering for Beginners published in Korean language","link":"https://yurichev.com/news/20210401_Korean_RE4B/","owner":"Dennis Felsing"},{"title":"Uploading Files To Amazon S3 With Flask Form – Part1 – Uploading Small Files","description":null,"link":"https://soshace.com/uploading-files-to-amazon-s3-with-flask-form-part1-uploading-small-files/","owner":"Songkick"},{"title":"Why Internal Corporate Software Is So Frustrating (with Infographic)","description":"At the enterprise level, user mistakes can imperil thousands of employees, customers, and shareholders. With so much at stake, usability isn’t a luxury; it’s mandatory.","link":"https://www.toptal.com/designers/ux/corporate-software","owner":"Tinder"}]