[{"title":"Announcing new, consolidated site for all technical resources: docs.digitalocean.com","description":"A few weeks ago, we introduced a new website for DigitalOcean technical documentation that’s a comprehensive resource including tutorials, product details, sample code, references, etc. It was a significant effort that involved consolidation of key content that our customers leverage to build their projects and businesses on DigitalOcean.","link":"https://www.digitalocean.com/blog/announcing-new-consolidated-site-for-all-technical-resources----docs.digitalocean.com","owner":"Deliveroo"},{"title":"Building a Deliveroo Food Ordering UI with Ionic","description":null,"link":"https://devdactic.com/food-ordering-app-ionic/?utm_source=rss&utm_medium=rss&utm_campaign=food-ordering-app-ionic","owner":"Scott Johnson"},{"title":"Cloud security for manufacturing – gaining control and visibility","description":null,"link":"https://umbrella.cisco.com/blog/cloud-security-for-manufacturing-gaining-control-and-visibility","owner":"OLX"},{"title":"Faraday partners with Listrak to personalize customer engagement","description":"Faraday is able to offer our mutual clients a fully integrated experience with Listrak, letting users take predictive marketing to the next level by enhancing Listrak’s Predictive Personalization solution with detailed, AI-driven personas and behavioral predictions.","link":"https://faraday.ai/blog/listrak-predictive-marketing-partnership/","owner":"Facebook AI Research"},{"title":"How does Airbnb track and measure growth marketing?","description":"","link":"https://medium.com/airbnb-engineering/how-does-airbnb-track-and-measure-growth-marketing-15ee4ce55c5d?source=rss----53c7c27702d5---4","owner":"Advanced Web Machinery"},{"title":"How to Model JSON Data in a Go App With CockroachDB","description":"*Guest post alert! Jack is a core maintainer of pgx, a PostgreSQL driver and toolkit for Go. He helped build the testing integration for CockroachDB and pgx. Jack blogs at https://www.jackchristensen.com/*\n-&ndash;\nMany applications benefit from representing some data in a relational structure and some data in a more flexible document structure like JSON. Taking advantage of the JSON functionality available in a relational database can reduce the need for a dedicated object database, minimize infrastructure and application complexity, and improve performance.","link":"https://www.cockroachlabs.com/blog/json-go-cockroachdb/","owner":"Cloudflare"},{"title":"Introducing CloudFront Functions – Run Your Code at the Edge with Low Latency at Any Scale","description":"With Amazon CloudFront, you can securely deliver data, videos, applications, and APIs to your customers globally with low latency and high transfer speeds. To offer a customized experience and the lowest possible latency, many modern applications execute some form of logic at the edge. The use cases for applying logic at the edge can be […]","link":"https://aws.amazon.com/blogs/aws/introducing-cloudfront-functions-run-your-code-at-the-edge-with-low-latency-at-any-scale/","owner":"Avenue Code"},{"title":"New Amazon FinSpace Simplifies Data Management and Analytics for Financial Services","description":"Managing data is the core of the Financial Services Industry (FSI). I worked for private banking and fund management companies and helped analysts to collect, aggregate, and analyze hundreds of petabytes of data from internal data sources, such as portfolio management, order management, and accounting systems, but also from external data sources, such as real-time […]","link":"https://aws.amazon.com/blogs/aws/amazon-finspace-simplifies-data-management-and-analytics-for-financial-services/","owner":"Avenue Code"},{"title":"New Sellers: Getting Started on eBay is Now Even Easier","description":null,"link":"https://tech.ebayinc.com/product/new-sellers-getting-started-on-ebay-is-now-even-easier/","owner":"Dropbox"},{"title":"Quantile exponential smoothing","description":"<p>One of the popular problems in time series analysis is estimating the moving &ldquo;average&rdquo; value.\nLet&rsquo;s define the &ldquo;average&rdquo; as a central tendency metric like the mean or the median.\nWhen we talk about the moving value, we assume that we are interested in\nthe average value &ldquo;at the end&rdquo; of the time series\ninstead of the average of all available observations.</p>\n<p>One of the most straightforward approaches to estimate the moving average is the <em>simple moving mean</em>.\nUnfortunately, this approach is not robust: outliers can instantly spoil the evaluated mean value.\nAs an alternative, we can consider <em>simple moving median</em>.\nI already discussed a few of such methods:\n<a href=\"https://aakinshin.net/posts/mp2-quantile-estimator/\">the MP² quantile estimator</a> and\n<a href=\"https://aakinshin.net/posts/partitioning-heaps-quantile-estimator2/\">a moving quantile estimator based on partitioning heaps</a>\n(a modification of the Hardle-Steiger m","link":"https://aakinshin.net/posts/quantile-exponential-smoothing/","owner":"Andrew Ray"},{"title":"Service Level Testing for Microservices in Swiggy","description":"","link":"https://bytes.swiggy.com/service-level-testing-for-microservices-in-swiggy-62b6b3f865f4?source=rss----9556560f659---4","owner":"SurveyMonkey"},{"title":"Streaming Market Data with Flink SQL Part I: Streaming VWAP","description":null,"link":"https://blog.cloudera.com/streaming-market-data-with-flink-sql-part-i-streaming-vwap/","owner":"CloudBees"},{"title":"Technology Preview: Jetpack Compose for Web","description":"First came the desktop, now comes the world wide web: Jetpack Compose advances to the browser! Today, we are releasing the first technology preview of Jetpack Compose for Web. While we keep actively developing Compose for Desktop toward its 1.0 release, this is the next chapter in our multiplatform story for Jetpack Compose, bringing Google’s […]","link":"https://blog.jetbrains.com/kotlin/2021/05/technology-preview-jetpack-compose-for-web/","owner":"Klipse"},{"title":"The 20 Most Viewed YouTube Videos","description":null,"link":"https://www.brandwatch.com/blog/most-viewed-youtube-videos/","owner":"Boxever"},{"title":"The 20 Most-Liked Videos on YouTube","description":null,"link":"https://www.brandwatch.com/blog/most-liked-videos-on-youtube/","owner":"Boxever"},{"title":"The Top 20 Most Followed Instagram Accounts","description":null,"link":"https://www.brandwatch.com/blog/top-most-instagram-followers/","owner":"Boxever"},{"title":"Three reasons why Darth Vader is a bad team leader","description":"<div class=\"hs-featured-image-wrapper\"> \r\n <a href=\"https://www.stridenyc.com/blog/three-reasons-why-darth-vader-is-a-bad-team-leader\" title=\"\" class=\"hs-featured-image-link\"> <img src=\"https://www.stridenyc.com/hubfs/vaderdiningalone.png\" alt=\"darth vader eats alone, photo credit wookieepedia\" class=\"hs-featured-image\" style=\"width:auto !important; max-width:50%; float:left; margin:0 15px 15px 0;\"> </a> \r\n</div>    \r\n<p>Darth Vader was a lot of things to a lot of people: Dark Lord of the Sith, distant father, caring husband (for a little bit, at least), the only member of the Jedi Council not granted the rank of master, Emperor Palpatine’s right-hand man. But one aspect of him is oftentimes overlooked: how bad a team leader he was. Let’s go over three reasons why he was bad, and how you can avoid his mistakes—besides the whole turning-to-the-Dark-Side debacle.</p>","link":"https://www.stridenyc.com/blog/three-reasons-why-darth-vader-is-a-bad-team-leader","owner":"Strava"}]