[{"title":"Cockroach Labs Raises $160M on $2B Valuation, Reflecting Explosive Growth and Product Innovation","description":"We are proud to announce a new round of funding at a milestone valuation, which recognizes our company’s rapid growth, happy customers, and our emerging role as a leading cloud-native SQL database.\nThe events of 2020 delivered more change in the past few months for businesses than many of us have experienced in the last 10 years. The impact of stay-at-home orders forced organizations to rapidly adapt to changing consumer behaviors, remote workforces, and explosive growth of digital services.","link":"https://www.cockroachlabs.com/blog/explosive-growth-2021/","owner":"Cloudflare"},{"title":"How technology is powering environmental reporting","description":"<p>In the first of three articles, we look at how Guardian software engineers teamed up with the newsroom to investigate climate lobbying online</p><p><em>This is part one of a series of three blogposts about the first year of the new Investigations &amp; Reporting team, a small group of software developers embedded in the Guardian newsroom. Read about our work on <a href=\"https://www.theguardian.com/info/2021/jan/19/how-technology-is-powering-election-coverage\">election coverage here</a> and <a href=\"https://www.theguardian.com/info/2021/feb/04/how-technology-is-powering-covid-19-investigations\">Covid-19 investigations here</a>.</em></p><p>In the summer of 2019, the Guardian assembled a team of engineers to work alongside reporters to build tools to help them discover new stories. We were tasked with finding opportunities to collaborate closely with our editorial colleagues.</p><p><strong>Where can I find open positions?</strong></p><p></p> <a href=\"https://www.theguardian.com/info/20","link":"https://www.theguardian.com/info/2021/jan/12/how-technology-is-powering-environmental-reporting","owner":"Groupon"},{"title":"How to Improve User Experience with Accurate User Feedback","description":"\n            ","link":"https://www.sitepoint.com/records-tuples-javascript-immutable-data-types/?utm_source=rss","owner":"Sift Science"},{"title":"Introducing Bring Your Own Container Image workflow for DigitalOcean App Platform","description":"A few months ago, we launched DigitalOcean App Platform, our modern, reimagined PaaS (Platform as a Service) offering. App Platform makes it very easy to build, deploy, and scale apps and static sites. It’s a fully managed solution, meaning we handle provisioning and managing infrastructure, operating systems, databases, application runtimes, and other dependencies, so that you can focus on your code. ","link":"https://www.digitalocean.com/blog/introducing-bring-your-own-container-image-workflow-for-digitalocean-app-platform","owner":"Deliveroo"},{"title":"MP² quantile estimator: estimating the moving median without storing values","description":"<p>In one of the previous posts, I <a href=\"https://aakinshin.net/posts/p2-quantile-estimator/\">described</a> the P² quantile estimator.\nIt allows estimating quantiles on a stream of numbers without storing them.\nSuch sequential (streaming/online) quantile estimators are useful in software telemetry because\nthey help to evaluate the median and other distribution quantiles without a noticeable memory footprint.</p>\n<p>After the publication, I got a lot of questions about <em>moving</em> sequential quantile estimators.\nSuch estimators return quantile values not for the whole stream of numbers,\nbut only for the recent values.\nSo, I <a href=\"https://aakinshin.net/posts/partitioning-heaps-quantile-estimator/\">wrote</a> another post about\na quantile estimator based on a partitioning heaps (inspired by the Hardle-Steiger method).\nThis algorithm gives you the exact value of any order statistics for the last <span class=\"math inline\">\\(L\\)</span> numbers\n(<span class=\"math inline\">\\(L\\)</span> ","link":"https://aakinshin.net/posts/mp2-quantile-estimator/","owner":"Andrew Ray"},{"title":"The Journey Towards Metric Standardization","description":null,"link":"https://eng.uber.com/umetric/","owner":"Twitch"}]