[{"title":"A Critique of React’s useEffect Hook","description":"I’ve been dabbling with React.js again and trying to understand what isn’t clicking for me with this popular frontend framework. Consider this some messy out loud thinking about React’s useEffect hook. What is useEffect? The useEffect function is a React Hook. React Hooks only work with functional components. That is to say, React Hooks will NOT work with class based components. A React functional component is a javascript function that renders a component. Functional components are not javascript constructor functions even though they’re often named with TitleCase. React Hooks are also functions, but will only “work” when called while React […]","link":"https://alanstorm.com/a-critique-of-reacts-useeffect-hook/","owner":"Adrian Colyer"},{"title":"Best Linux Distros in 2021 for Beginner, Experienced and Expert users.","description":null,"link":"https://haydenjames.io/best-linux-distro/","owner":"Guilherme Rodrigues"},{"title":"Building a learning culture at Stride","description":"<div class=\"hs-featured-image-wrapper\"> \r\n <a href=\"https://www.stridenyc.com/blog/building-a-learning-culture-at-stride\" title=\"\" class=\"hs-featured-image-link\"> <img src=\"https://lh6.googleusercontent.com/vo2WNM3uFtHjPaHxEkKYTtSO6kyVX4qthHA61GGwjHkXl-P_BnAY2A6E0hygYe7B9hBnaUysfYNKIGeH0gkA-HoLJvNI1rlLfStIakDIWlyLZWuAEuoq0ReZmN6rQgH8zucR7naq\" alt=\"Derek Zoolander Center for Striders Who Can’t Learn Good\" class=\"hs-featured-image\" style=\"width:auto !important; max-width:50%; float:left; margin:0 15px 15px 0;\"> </a> \r\n</div>    \r\n<p>Having a “learning culture” is one of those phrases that gets thrown around a lot when folks talk about hip tech companies. It is very trendy to promise your employees continuous learning and opportunities not only to grow their expertise, but also to share it. This makes loads of sense, but how does one actually go about facilitating a “learning culture”?</p>","link":"https://www.stridenyc.com/blog/building-a-learning-culture-at-stride","owner":"Strava"},{"title":"Deep Learning with Nvidia GPUs in Cloudera Machine Learning","description":null,"link":"https://blog.cloudera.com/deep-learning-with-nvidia-gpus-in-cloudera-machine-learning/","owner":"CloudBees"},{"title":"Designing Marketing Emails via predefined Modules in Salesforce Email Studio","description":"When techies hear about email marketing and designing HTML emails, they typically roll their eyes and think of a very boring field of work. In this article, we hopefully can explain to you why this is wrong from our perspective. Our team built a solution that our marketers use to easily design HTML emails with predefined modules within our email marketing platform Salesforce Email Studio, which is part of the Salesforce Marketing Cloud (SFMC).","link":"https://tech.trivago.com/2021/04/19/designing-marketing-emails-via-predefined-modules-in-salesforce-email-studio/","owner":"TripAdvisor"},{"title":"How We Improved Agent Chat Efficiency with Machine Learning","description":"<p>In previous articles (see <a href=\"https://engineering.grab.com/how-we-built-our-in-house-chat-platform-for-the-web\">Grab’s in-house chat platform</a>, <a href=\"https://engineering.grab.com/customer-support-workforce-routing\">workforce routing</a>), we shared how chat has grown to become one of the primary channels for support in the last few years.</p>\n\n<p>With continuous chat growth and a new in-house tool, helping our agents be more efficient and productive was key to ensure a faster support time for our users and scale chat even further.</p>\n\n<p>Starting from the analysis on the usage of another third-party tool as well as some shadowing sessions, we realised that building a templated-based feature wouldn’t help. We needed to offer personalisation capabilities, as our consumer support specialists care about their writing style and tone, and using templates often feels robotic.</p>\n\n<p>We decided to build a machine learning model, called <strong>SmartChat</strong>, which offers c","link":"https://engineering.grab.com/how-we-improved-agent-chat-efficiency-with-ml","owner":"GO-JEK"},{"title":"Issuing now available in Europe","description":"Stripe Issuing lets European businesses programmatically create, manage, and distribute payment cards.","link":"https://stripe.com/issuing","owner":"Stride"},{"title":"last command in Linux with Examples – View history of user logins","description":null,"link":"https://haydenjames.io/last-command-in-linux-with-examples-view-history-of-user-logins/","owner":"Guilherme Rodrigues"},{"title":"Never too late for Firefox 88","description":null,"link":"https://hacks.mozilla.org/2021/04/never-too-late-for-firefox-88/","owner":"Mozilla Automation Team"},{"title":"Publishing Codename One Libraries on Maven Central","description":"One of the cool things about Maven is Maven Central - the repository that contains every version of every Java library (that has been published on Maven central at least). Once your library is published, it can be used by other projects by copying and pasting an XML snippet into their pom.xml file. In this article, I describe how to publish your Codename One libraries to Maven central so that app developers can use them in their projects.","link":"https://www.codenameone.com/blog/publishing-codename-one-libraries-on-maven-central.html","owner":"Codementor"},{"title":"Recruiting Software Developers – Coding Tests","description":"For the past few months, I have been interviewing with several companies. In all cases, one or more coding tests were included. I have also been on the interviewing side, evaluating a coding test. Here are my thoughts on the … ","link":"https://henrikwarne.com/2021/04/19/recruiting-software-developers-coding-tests/","owner":"Henrik Lau Eriksson"},{"title":"The Best VPNs for Developers","description":"\n            ","link":"https://www.sitepoint.com/a-side-by-side-comparison-of-aws-google-cloud-and-azure/?utm_source=rss","owner":"Sift Science"},{"title":"Winner at the 11th Annual Aegis Graham Bell award for Innovation","description":"","link":"https://bytes.swiggy.com/winner-at-the-11th-annual-aegis-graham-bell-award-for-innovation-5c31f4b4ba78?source=rss----9556560f659---4","owner":"SurveyMonkey"}]