[{"title":"#ClouderaLife Spotlight: Christine Sherry, Director, Critical Incident Manager","description":null,"link":"https://blog.cloudera.com/clouderalife-spotlight-christine-sherry-director-critical-incident-manager/","owner":"CloudBees"},{"title":"How did Helpshift solve slow deployment issues in AWS Beijing(China) region","description":"","link":"https://medium.com/helpshift-engineering/how-did-helpshift-solve-slow-deployment-issues-in-aws-beijing-china-region-a59624e9a832?source=rss----3229f31ca4f4---4","owner":"Heap"},{"title":"How to deal with an Inverse Conway Maneuver? – A talk by Romain Vailleux at Duck Conf 2021","description":"Companies are complex systems made up of humans and technological systems in perpetual interaction. “Theses socio-technical” systems are Romain’s favorite subject. Melvin Conway observed that the communication structures of organizations directly influence the design of technical systems produced by those organizations. In short: the organization chart of the company and the interpersonal relationships across people […]","link":"https://blog.octo.com/en/how-to-deal-with-an-inverse-conway-maneuver-a-talk-by-romain-vailleux-at-duck-conf-2021/","owner":"Nvidia"},{"title":"MDN localization in March — Tier 1 locales unfrozen, and future plans","description":null,"link":"https://hacks.mozilla.org/2021/03/mdn-localization-in-march-tier-1-locales-unfrozen-and-future-plans/","owner":"Mozilla Automation Team"},{"title":"The Dog Ate My Protocol Spec; A Demo","description":null,"link":"https://galois.com/blog/2021/03/the-dog-ate-my-protocol-spec-a-demo/","owner":"Future Processing"},{"title":"Why the FBI can’t get your browsing history from Apple iCloud (and other scary stories)","description":"It’s not every day that I wake up thinking about how people back up their web browsers. Mostly this is because I don’t feel the need to back up any aspect of my browsing. Some people lovingly maintain huge libraries of bookmarks and use fancy online services to organize them. I pay for one of … ","link":"https://blog.cryptographyengineering.com/2021/03/25/whats-in-your-browser-backup/","owner":"Matt Warren"},{"title":"Will Data Privacy drive an Enterprise Data Strategy?","description":null,"link":"https://blog.cloudera.com/will-data-privacy-drive-an-enterprise-data-strategy/","owner":"CloudBees"}]