[{"title":"A Beginner’s Guide to Roam Research","description":"\n            ","link":"https://www.sitepoint.com/roam-research-beginners-guide/?utm_source=rss","owner":"Sift Science"},{"title":"A Purposeful ProtoBuf Repository","description":"<p>In 2018, the Platform team at WePay integrated and released the first version of WePay’s internal <a href=\"https://grpc.io/\">gRPC ecosystem</a> and toolchain to the WePay developers for a smooth <a href=\"https://wecode.wepay.com/posts/migrating-apis-from-rest-to-grpc-at-wepay\">migration from RESTful APIs to gRPC</a>.</p>\n\n<p>Shifting, adopting, and migrating large portions of a platform or infrastructure, such as adopting gRPC, has required establishing new standards and defining new processes that establish boundaries and guidelines. At <a href=\"https://wecode.wepay.com/\">WePay engineering</a>, we are advocates of open source software, and we contribute back to the community as much as our internal use cases enable us to, but there are also components that need to be architected internally and specifically for the technology stack at hand.</p>\n\n<p>In the case of gRPC, we had to implement processes along with a <em>repository</em> for how <a href=\"https://developers.google.com/proto","link":"https://wecode.wepay.com/posts/purposeful-protos","owner":"Wemake.services"},{"title":"BeagleV, Asahi Linux, JingPad A1, and more | biweekly #5","description":null,"link":"https://haydenjames.io/beaglev-asahi-linux-jingpad-a1-and-more-biweekly-5/","owner":"Guilherme Rodrigues"},{"title":"CDP Endpoint Gateway provides Secure Access to CDP Public Cloud Services running in private networks","description":null,"link":"https://blog.cloudera.com/cdp-endpoint-gateway-provides-secure-access-to-cdp-public-cloud-services-running-in-private-networks/","owner":"CloudBees"},{"title":"Contract Testing with Pact.io","description":null,"link":"https://tech.xing.com/contract-testing-with-pact-io-1c3bcecb5cb7?source=rss----35cb8c78d3cf---4","owner":"WyeWorks"},{"title":"Crystal 1.0 - What to expect","description":"<p>The release of the first major release of Crystal arrives after many years of hard work. With thousands of contributions from people worldwide, it was finally possible to find consensus for what truly mattered for 1.0 and what could wait for future releases. Getting here wasn’t an easy journey, filled with enriching, controversial, delightful, and endless conversations that, in the end, made it possible to build a language more useful for more users.</p>\n\n<p>But what does it mean to have a 1.0 version? After all, the process of receiving valuable contributions and evolving the language will not stop after this milestone. Let’s dig deeper to understand the true meaning of this release for the community, especially those already using Crystal in production environments.</p>\n\n<h2 id=\"language-stability\">Language Stability</h2>\n\n<p>Language stability is probably one of the most prominent and expected reasons to have Crystal 1.0 finally. We received numerous comments from people willing ","link":"https://crystal-lang.org/2021/03/22/crystal-1.0-what-to-expect.html","owner":"Bootstrap.com"},{"title":"Crystal Core Team Announcements","description":"<p>A lot has been going on in the Crystal Core Team, and the community has voiced its need for more (and more frequent) communication. This post is an attempt to catch up with that. I’m taking the license of using “we” for both Crystal and Manas.Tech in this short update.</p>\n\n<p>The team has been moving forward and focusing on <a href=\"/2021/03/22/crystal-1.0-what-to-expect.html\">releasing 1.0</a>, which is intended to be a more stabilized version of 0.36 with few new additions. We know that we could always add, fix or improve one more little thing before releasing. Still, we believe this is long overdue and that the lack of a v1.0 is an obstacle to adoption.</p>\n\n<p>We wanted to share the news that Johannes Müller (@straightshoota) has joined Manas as a full-time employee. Johannes is a years-long member and contributor of the Core Team, and we are thrilled to have him join us to continue to work on the language’s evolution.</p>\n\n<p>Coincidentally, Brian (@bcardiff) and Juan (@waj) w","link":"https://crystal-lang.org/2021/03/22/crystal-core-team-announcements.html","owner":"Bootstrap.com"},{"title":"How Grab Leveraged Performance Marketing Automation to Improve Conversion Rates by 30%","description":"<p>Grab, Southeast Asia’s leading superapp, is a hyperlocal three-sided marketplace that operates across hundreds of cities in Southeast Asia. Grab started out as a taxi hailing company back in 2012 and in less than a decade, the business has evolved tremendously and now offers a diverse range of services for consumers’ everyday needs.</p>\n\n<p>To fuel our business growth in newer service offerings such as GrabFood, GrabMart and GrabExpress, user acquisition efforts play a pivotal role in ensuring we create a sustainable Grab ecosystem that balances the marketplace dynamics between our consumers, driver-partners and merchant-partners.</p>\n\n<p>Part of our user growth strategy is centred around our efforts in running direct-response app campaigns to increase trials on our superapp offerings. Executing these campaigns brings about a set of unique challenges against the diverse cultural backdrop present in Southeast Asia, challenging the team to stay hyperlocal in our strategies while drivi","link":"https://engineering.grab.com/learn-how-grab-leveraged-performance-marketing-automation","owner":"GO-JEK"},{"title":"How MDN’s site-search works","description":null,"link":"https://hacks.mozilla.org/2021/03/how-mdns-site-search-works/","owner":"Mozilla Automation Team"},{"title":"How to keep a productive team after 1 year of fully remote work","description":"","link":"https://medium.com/feedzaitech/how-to-keep-a-productive-team-after-1-year-of-fully-remote-work-59c96d194650?source=rss----e11168e7fe6b---4","owner":"Faraday"},{"title":"Joining forces on better browser compatibility in 2021","description":null,"link":"https://blogs.windows.com/msedgedev/2021/03/22/better-compatibility-compat2021/","owner":"Laravel"},{"title":"Quality engineering for a shared codebase.","description":"","link":"https://medium.com/bbc-design-engineering/quality-engineering-for-a-shared-codebase-f0ee6eb24d63?source=rss----ccd524e1760a---4","owner":"Bazaarvoice"},{"title":"QUIC Testing, a Quick Replication","description":null,"link":"https://galois.com/blog/2021/03/quic-testing-a-quick-replication/","owner":"Future Processing"},{"title":"Writing a Buildpack for the Rails Asset Pipeline","description":"<p><img src='https://res.cloudinary.com/dhttas9u5/image/upload/c_fill,fl_progressive,h_800,q_auto,w_1600/ofgsmtez48vlrk7pmwei.jpg' /></p>\n<p><em>BTW, we're ⚡ hiring Infra, SRE, Web, Mobile, and Data engineers at <a href='https://work.doximity.com/positions'>Doximity (see roles)</a> -- find out more about our <a href='https://technology.doximity.com/technology-stack'>technical stack</a>.</em></p>\n\n<hr>\n\n<p>At Doximity, we benefit from open-source software every day. We consider contributing back to that software a worthwhile endeavor. As we were <a href='https://technology.doximity.com/articles/buildpacks-vs-dockerfiles'>transitioning</a> to building application container images with Paketo Buildpacks, we discovered that the Ruby buildpack we wanted to use was not yet capable of precompiling assets at build-time, so we found the open <a href='https://github.com/paketo-buildpacks/ruby/issues/470'>Github issue</a> and decided to help by creating the <a href='https://github.com/paketo-buil","link":"https://technology.doximity.com/articles/writing-a-buildpack-for-the-rails-asset-pipeline","owner":"DoorDash"}]