[{"title":"Announcing Crystal 1.0 Conference","description":"<p>A decade ago, when Crystal was a quirky idea that a few people talked about in their spare time at Manas, it was impossible to think we would go through so many things on our way to releasing a stable and production ready 1.0 version.\nIt was also unimaginable that such a generous community would form around Crystal, with people from all over the world that have been following every development, providing their views and advice, and contributing to the project both financially and with their work.</p>\n\n<p>Going forward, we want to continue the evolution of the language on delighting its users. But we still want to <strong>take a moment to celebrate the 1.0 milestone</strong>, and we decided a conference was the best way to do that.</p>\n\n<p>The online conference takes place on <strong>July 8, 2021</strong>.</p>\n\n<h3 id=\"why-a-crystal-10-launch-conference\">Why a Crystal 1.0 Launch Conference?</h3>\n\n<ul>\n  <li>Many people have been a part of the Crystal universe for years, and many othe","link":"https://crystal-lang.org/2021/04/22/crystal-conference-1.0-launch.html","owner":"Bootstrap.com"},{"title":"Apache Ozone and Dense Data Nodes","description":null,"link":"https://blog.cloudera.com/apache-ozone-and-dense-data-nodes/","owner":"CloudBees"},{"title":"base64scanner","description":"base64scanner","link":"https://yurichev.com/news/20210422_base64scanner/","owner":"Dennis Felsing"},{"title":"Can you really develop with Linux GUI Apps on Windows 10 with WSLg? How about PyCharm?","description":null,"link":"http://feeds.hanselman.com/~/650087020/0/scotthanselman~Can-you-really-develop-with-Linux-GUI-Apps-on-Windows-with-WSLg-How-about-PyCharm","owner":"Schakko"},{"title":"Chef Infra Best Practices: #3 Testing Chef Infra Cookbooks Fast with Docker","description":null,"link":"https://blog.chef.io/chef-infra-best-practices-3-testing-chef-infra-cookbooks-fast-with-docker","owner":"Chartbeat"},{"title":"Do you remember your first introduction to Kotlin? New users survey","description":"The “Kotlin New Users Survey” will help us understand the ways people are introduced to Kotlin, and what is important to them during the first steps of their journey. We want the experience in the early stages to be a good one for the adopters. Getting feedback from the community is useful for us to […]","link":"https://blog.jetbrains.com/kotlin/2021/04/do-you-remember-your-first-introduction-to-kotlin-new-users-survey/","owner":"Klipse"},{"title":"Engineering Career Series: Hiring a diverse team by reducing bias","description":"Compared to where we started, Yelp’s technical organization has made a lot of headway over the years when it comes to diverse hiring. While our approach to this work continues to evolve, we’ve made significant progress in improving the diversity of our organizations by, among other things, reducing gender and ethnicity bias in our interview process. We’re here to share some of what we’ve learned to help others in their own efforts. If you’ve come looking for the secret formula to emulate our success, I can’t help you there, unfortunately. Anyone offering otherwise is probably selling you something. And, to...","link":"https://engineeringblog.yelp.com/2021/04/engineering-career-series-hiring-a-diverse-team-by-reducing-bias.html","owner":"Yammer"},{"title":"It’s time to learn Python","description":null,"link":"https://lerner.co.il/2021/04/22/its-time-to-learn-python/","owner":"Lea Verou"},{"title":"JavaScript Objects: 15 Fundamentals You Should Know","description":null,"link":"https://medium.com/dailyjs/15-fundamentals-you-should-know-on-javascript-objects-90f57cc9d78d?source=rss----f5105b08f43a---4","owner":"Codrops"},{"title":"Key marketing tactics for 2021: Breaking down Nielsen’s Annual Marketing Report","description":"It’s no secret that a healthy marketing mix entails reaching audiences across multiple platforms. With people staying home because of the pandemic, marketers should be reaching consumers on the digital channels consumers are already spending more time on. ","link":"https://faraday.ai/blog/2021-marketing-tactics-neilsen-report/","owner":"Facebook AI Research"},{"title":"Over 150 Million Photos, Some Perl Scripts and a Creaky User Interface","description":"","link":"https://open.nytimes.com/over-150-million-photos-some-perl-scripts-and-a-creaky-user-interface-c00f7b6d5fd9?source=rss----51e1d1745b32---4","owner":"Netflix"},{"title":"Picasso: How to Test a Component Library","description":"Testing can be a daunting task even for experienced teams with an abundance of resources. How do Toptal developers write tests and what do they use?\r\n\r\nIn this article, Toptal React Developer Boris Yordanov introduces you to Picasso, a component library designed by our developers for in-house use.","link":"https://www.toptal.com/react/picasso-component-testing-library","owner":"Tinder"},{"title":"Pyodide Spin Out and 0.17 Release","description":null,"link":"https://hacks.mozilla.org/2021/04/pyodide-spin-out-and-0-17-release/","owner":"Mozilla Automation Team"},{"title":"SwiftUI with UICollectionView","description":"","link":"https://medium.com/expedia-group-tech/swiftui-with-uicollectionview-aba7cbaf6d16?source=rss----38998a53046f---4","owner":"Evil Martians"},{"title":"The Intersection of Climate and Capital Markets","description":null,"link":"https://blog.cloudera.com/the-intersection-of-climate-and-capital-markets/","owner":"CloudBees"},{"title":"Use IN List Padding to Your JDBC Application to Avoid Cursor Cache Contention Problems","description":"A problem few developers are aware of is the possibility of running into “cursor cache contention” or “execution plan cache contention” problems when using IN lists in SQL. The problem that is described in lengths in previous articles, can be summarised as this. All of these are distinct SQL queries and need to be parsed … ","link":"https://blog.jooq.org/2021/04/22/use-in-list-padding-to-your-jdbc-application-to-avoid-cursor-cache-contention-problems/","owner":"IPFS"},{"title":"Using eBPF in Flatcar Container Linux","description":"Extended Berkeley Packet Filter (eBPF) is a core Linux technology with multiple applications in different computer domains like security, networking and tracing. For the containers and Kubernetes specific case, it’s used with networking projects like Cilium or Calico, debugging solutions like BCC, kubectl-trace and Inspektor Gadget, and security-related projects like tracee and Falco.\neBPF is a very fast evolving technology: each new kernel release includes new features, and different Linux distributions rush to enable them for their users.","link":"/blog/2021/04/using-ebpf-in-flatcar-container-linux/","owner":"King"},{"title":"You don’t have to be serious to be serious","description":"","link":"https://medium.com/bbc-design-engineering/you-dont-have-to-be-serious-to-be-serious-20ce5fb5f7f6?source=rss----ccd524e1760a---4","owner":"Bazaarvoice"}]