[{"title":"Announcing .NET 6 Preview 5","description":null,"link":"https://devblogs.microsoft.com/dotnet/announcing-net-6-preview-5/","owner":".NET"},{"title":"Announcing .NET MAUI Preview 5","description":null,"link":"https://devblogs.microsoft.com/dotnet/announcing-net-maui-preview-5/","owner":".NET"},{"title":"Announcing Entity Framework Core 6.0 Preview 5: Compiled Models","description":null,"link":"https://devblogs.microsoft.com/dotnet/announcing-entity-framework-core-6-0-preview-5-compiled-models/","owner":".NET"},{"title":"App Usability: Just Because It’s “Polish” Doesn’t Mean It’s Not Important","description":null,"link":"https://feeds.feedblitz.com/~/655023490/0/atomicspin~App-Usability-Just-Because-Its-Polish-Doesnt-Mean-Its-Not-Important/","owner":"Atomic Object"},{"title":"Authorino: Making open source, cloud-native API security simple and flexible","description":"<p><a href=\"https://github.com/kuadrant/authorino\">Authorino</a> solves a persistent problem that arises when upgrading applications for secure internet use: the need to add authentication or authorization to APIs that were built without these <a href=\"https://developers.redhat.com/topics/security\">security</a> concepts in mind. Authorino provides an easy, cloud-native way to expose these APIs. You don’t have to modify or rebuild your API. A thin reverse-proxy layer with an external authorization filter, completely configurable via the <a href=\"https://developers.redhat.com/topics/kubernetes\">Kubernetes</a> API, allows you to add the right authentication and authorization model to suit your needs.</p>\n\n<p>This article introduces Authorino with an overview of its uses and benefits, a look at its underlying mechanics, and a brief demonstration based on an example use case.</p>\n\n<h2>A use case for Authorino</h2>\n\n<p>Let's imagine a frequent scenario for using Authorino. As an <a href=\"htt","link":"https://developers.redhat.com/articles/2021/06/18/authorino-making-open-source-cloud-native-api-security-simple-and-flexible","owner":"Red Hat"},{"title":"Build Native Java Apps with Micronaut, Quarkus, and Spring Boot","description":"<div class=\"paragraph\">\n<p>Java has been able to invoke native programs on an operating system for decades. Invoking native programs is often done using JNI (Java Native Interface) and JNA (Java Native Access). In the last few years, Java has also gained the ability to run JVM apps as native apps. That is, they&#8217;re binary executables that have no dependency on the Java runtime.</p>\n</div>\n<div class=\"paragraph\">\n<p>This is <em>huge!</em> Mostly because it gives Java apps the ability to start up in milliseconds (as opposed to seconds). If you&#8217;re scaling up to handle millions of requests and using a serverless environment to save costs, this is a game-changer. Developers have enjoyed using Node.js, Python, and Go on serverless environments for years. The ability to use Java (or Kotlin) opens this world up to a massive swath of the developer community.</p>\n</div>\n<div class=\"paragraph\">\n<p>This post will show you how to run a secure, OAuth 2.0-protected, Java REST API that allo","link":"https://developer.okta.com/blog/2021/06/18/native-java-framework-comparison","owner":"Okta"},{"title":"Consistency and Completeness: Rethinking Distributed Stream Processing in Apache Kafka","description":"Stream processing has become an important part of the big data landscape, a new programming paradigm bringing asynchronous, long-lived computations to unbounded data in motion. But many people still think [&hellip;]","link":"https://www.confluent.io/blog/rethinking-distributed-stream-processing-in-kafka/","owner":"Confluent"},{"title":"Continuous Integration with Quality Gates at LiveRamp","description":null,"link":"https://liveramp.com/engineering/continuous-integration-with-quality-gates-at-liveramp/","owner":"LiveRamp"},{"title":"Diversity in Data Science with Ela Osterberger, DS Director","description":"<p><strong><em>Ela, thanks for taking the time out. It would be great if you could start by introducing yourself and your role here.</em></strong></p>\n\n<p>I am one of two Data Science directors - both of us are women which is rare to find in this discipline! I have been working at Deliveroo since it was a small-ish start-up, 4 years ago.\nI am no longer doing IC work, so my role is to help the team succeed and ensure the impressive work of the individuals in the group shines.</p>\n\n<p><strong><em>Thanks, let’s get stuck in. Diversity. It is a very topical issue and can mean different things in different spheres. What does it mean for you here at Deliveroo?</em></strong></p>\n\n<p>It means taking a critical look at our teams and acknowledging how representative or otherwise we are of our customers. Given that we want to build a product for everyone, we need to ensure we are an inclusive and diverse workplace that reflects this ambition. Diversity at Deliveroo also means celebrating our indi","link":"https://deliveroo.engineering/2021/06/18/diversity-in-data-science.html","owner":"Deliveroo"},{"title":"Drawing Graphics with the CSS Paint API","description":null,"link":"https://tympanus.net/codrops/2021/06/18/drawing-graphics-with-the-css-paint-api/","owner":"Codrops"},{"title":"Error'd: Some Sunny Day","description":"<p>\r\n</p>\r\n\r\n<p></p><p>\r\nGreenville resident <strong>Terry K.</strong> discovers the weather is on the fritz today.  \r\n&#34;The chanceOfTemplateFailure seems high today,&#34; says he.\r\n\r\n</p><blockquote><p><a href=\"#weather\"><img itemprop=\"image\" border=\"0\" alt=\"weather\" src=\"https://thedailywtf.com/images/21/q1/e469/03-weather.png\"/></a></p><p> </p></blockquote>\r\n\r\n\r\n<p></p><p>\r\nRenault driver <strong>Drew W.</strong> predicts &#34;We have always been \r\nunder a severe thunderstorm warning, and we always will be.&#34;  Thursday \r\nagain?\r\n\r\n</p><blockquote><p><a href=\"#tstorm\"><img itemprop=\"image\" border=\"0\" alt=\"tstorm\" src=\"https://thedailywtf.com/images/21/q1/e469/02-tstorm.jpeg\"/></a></p><p> </p></blockquote>\r\n\r\n<p></p><p>\r\nFellow motorist <strong>Robert F.</strong> blows up: &#34;I was searching \r\nfor winter tires, but by the time I got through the 22 pages of \r\ngibberish I don&#39;t need them anymore.&#34;\r\n\r\n</p><blockquote><p><a href=\"#winter\"><img itemprop=\"image\" border=\"0\" a","link":"https://thedailywtf.com/articles/some-sunny-day","owner":"The Daily WTF"},{"title":"Expert Designers Leading Healthcare Product Innovation","description":"Modern medical products unburden healthcare providers, improve the patient experience, and save lives. What can we learn from the designers leading this surge in healthcare product innovation?","link":"https://www.toptal.com/designers/healthcare/healthcare-product-innovation","owner":"Toptal"},{"title":"How We Protect Pinners’ Passwords","description":"","link":"https://medium.com/pinterest-engineering/how-we-protect-pinners-passwords-e769135734d?source=rss-ef81ef829bcb------2","owner":"Pinterest"},{"title":"Making Tech Better podcast: Learning and experimenting with Jon Skeet","description":null,"link":"https://www.madetech.com/blog/making-tech-better-podcast-learning-and-experimenting-with-jon-skeet/","owner":"Made Tech"},{"title":"Matplotlib: Turn Off Axis (Spines, Tick Labels, Axis Labels and Grid)","description":"In this guide, we'll take a look at how to turn off the axis, as well as its constituent elements individually in Matplotlib.","link":"https://stackabuse.com/matplotlib-turn-off-axis-spines-ticklabels-axislabels-grid","owner":"Stack Abuse"},{"title":"Perform a kaniko build on a Red Hat OpenShift cluster and push the image to a registry","description":"<p>Typically, building <a href=\"https://developers.redhat.com/topics/containers\">containers</a> and images from a standard <a href=\"https://docs.docker.com/engine/reference/builder/\">Dockerfile</a> requires root access and permissions. This can create a challenge when working with public or shared clusters. For example, cluster admins don't often allow permissions to run this type of workload, as it might compromise the security of the entire cluster.</p>\n\n<p>In these situations, many developers use a build tool such as <a href=\"https://github.com/GoogleContainerTools/kaniko\">kaniko</a> to simplify the effort. Kaniko can build your images without requiring root access. This capability makes kaniko a feasible alternative for building containers and images in any kind of environment; for example, standard <a href=\"https://developers.redhat.com/topics/kubernetes\">Kubernetes</a> clusters, Google Kubernetes Engine, and public or shared clusters. Kaniko can also automatically push your image","link":"https://developers.redhat.com/articles/2021/06/18/perform-kaniko-build-red-hat-openshift-cluster-and-push-image-registry","owner":"Red Hat"},{"title":"Spanish Grammar: When To Use Ser And Estar","description":null,"link":"https://www.babbel.com/en/magazine/spanish-grammar-ser-and-estar","owner":"Babbel"},{"title":"Texting with GPT-3","description":"<p>I set up my GPT-3 so account so I can text with it over SMS.  It’s pretty fun.</p>\n\n<p><img src=\"/images/texting-with-gpt-3.jpg\" style=\"width: 300px;\" alt=\"Texting with GPT-3\" /></p>\n\n<p>To build this, I combined Airtable, Twilio and Zapier.  Here’s how it works:</p>\n\n<ol>\n  <li>I text my query to a Twilio phone number. E.g. “What is a good thing to reflect on as I fall asleep?”</li>\n  <li>Twilio receives the text and sends a webhook with the query to Zapier.</li>\n  <li>Zapier receives the webhook and sends a create record API request with the query to Airtable.</li>\n  <li>Airtable creates a record with my query.</li>\n  <li>An automation runs on Airtable when the new record is created that sends the query to the GPT-3 API.</li>\n  <li>The automation gets the response from the GPT-3 API and sends it via a webhook to Zapier.</li>\n  <li>Zapier recieves the webhook and sends the response to Twilio.</li>\n  <li>Twilio texts the response back to me.</li>\n</ol>\n\n<p>Why involve Airtable at al","link":"https://maryrosecook.com/blog/post/texting-with-gpt-3","owner":"Mary Rose Cook"},{"title":"The ARM processor (Thumb-2), part 15: Miscellaneous instructions","description":null,"link":"https://devblogs.microsoft.com/oldnewthing/20210618-00/?p=105324","owner":"Raymond Chen"},{"title":"Understanding the Cybersecurity Landscape in 2021","description":"More than a year after the onset of COVID-19, organizations must shift from temporary stopgap measures to more robust cybersecurity strategies and technologies. Here’s how to keep your company safe.","link":"https://www.toptal.com/finance/financial-forecasting/cybersecurity-landscape","owner":"Toptal"}]