[{"title":"Boosting user conversion with UX performance wins","description":"Everyone loves graphs going up and to the right, unless they reflect your page load timings. This blog post is about curtailing higher page load times. Yelp for Business Owners allows business owners to manage their listing, respond to reviews, edit their business information, upload business photos, and more. Business owners can also purchase Yelp Ads and profile products to target local audiences and enhance their business’s presence on Yelp. In this blog post, you’ll learn about the ways we improved the UX performance of our ads purchase flow by dramatically reducing the load times. You’ll be able to apply...","link":"https://engineeringblog.yelp.com/2021/01/boosting-user-conversion-with-ux-performance-wins.html","owner":"Yelp"},{"title":"Boxever announces strategic technology partnership with Quantum Metric","description":null,"link":"https://www.boxever.com/quantum-metrics-partner-announcement/","owner":"Boxever"},{"title":"Building a Node.js/TypeScript REST API, Part 2: Models, Middleware, and Services","description":"The Express.js REST API journey continues! Move from models to full DAOs and DTOs, validate requests with middleware, separate services from controllers, and prepare for a real database.","link":"https://www.toptal.com/express-js/nodejs-typescript-rest-api-pt-2","owner":"Toptal"},{"title":"Cannes: How ML saves us $1.7M a year on document previews","description":"","link":"https://dropbox.tech/machine-learning/cannes--how-ml-saves-us--1-7m-a-year-on-document-previews","owner":"Dropbox"},{"title":"Capturing Hacker News Mentions with Node.js and MongoDB","description":"\n                    <p>If you&rsquo;re in the technology space, you&rsquo;ve probably stumbled upon <a href=\"https://news.ycombinator.com/\">Hacker News</a> at some point or another. Maybe\nyou&rsquo;re interested in knowing what&rsquo;s popular this week for technology or\nmaybe you have something to share. It&rsquo;s a platform for information.</p>\n<p>The problem is that you&rsquo;re going to find too much information on Hacker\nNews without a particularly easy way to filter through it to find the\ntopics that you&rsquo;re interested in. Let&rsquo;s say, for example, you want to know\ninformation about Bitcoin as soon as it is shared. How would you do that\non the Hacker News website?</p>\n<p>In this tutorial, we&rsquo;re going to learn how to parse through Hacker News\ndata as it is created, filtering for only the topics that we&rsquo;re\ninterested in. We&rsquo;re going to do a sentiment analysis on the potential\nmatches to rank them, and then we&rsquo;re going to store this information in\n","link":"https://www.thepolyglotdeveloper.com/2021/01/capturing-hacker-news-mentions-nodejs-mongodb/","owner":"Nic Raboy"},{"title":"Cloudera Completes SOC 2 Type II Certification for CDP Public Cloud","description":null,"link":"https://blog.cloudera.com/cloudera-completes-soc-2-type-ii-certification-for-cdp-public-cloud/","owner":"Cloudera"},{"title":"Connect and Contribute Days: Social Impact at Cockroach Labs","description":"Companies like Cockroach Labs are first and foremost groups of people; people with passions and drives that go beyond what they do for work. This is, by and large, what drives organizations to consider how to best enable their staff to make an impact on their communities through volunteerism, donations, and action. As a company, we have emphasized doing good in our corporate giving initiatives: we match referral bonuses with an equivalent donation to a 501(c)(3) charity of our staff’s choice, run marketing campaigns geared towards amassing donations to groups such as Women Who Code and Black Girls Code, and establish an employee-led committee each year to decide where to donate a significant corporate gift.","link":"https://www.cockroachlabs.com/blog/connect-and-contribute/","owner":"CockroachDB"},{"title":"Empowering Fast Graph Visualizations for Fraud Detection (or Why We Built Our Own Graph Database)","description":"","link":"https://medium.com/feedzaitech/empowering-fast-graph-visualizations-for-fraud-detection-or-why-we-built-our-own-graph-database-4dee85f0688f?source=rss----e11168e7fe6b---4","owner":"Feedzai"},{"title":"LAMBDA: The ultimate Excel worksheet function","description":"<p ><a href=\"https://www.microsoft.com/en-us/research/blog/lambda-the-ultimatae-excel-worksheet-function/\">Post by Andy Gordon and Simon Peyton Jones on LAMBDA</a> giving Excel users the ability to define functions.</p>\n<blockquote ><p >\nEver since it was released in the 1980s, Microsoft Excel has changed how people organize, analyze, and visualize their data, providing a basis for decision-making for the millions of people who use it each day. It’s also the world’s most widely used programming language. Excel formulas are written by an order of magnitude more users than all the C, C++, C#, Java, and Python programmers in the world combined. Despite its success, considered as a programming language Excel has fundamental weaknesses. Over the years, two particular shortcomings have stood out: (1) the Excel formula language really only supported scalar values—numbers, strings, and Booleans—and (2) it didn’t let users define new functions.</p>\n<p >Until now.\n</p></blockquote>","link":"http://lambda-the-ultimate.org/node/5621","owner":"Lambda the Ultimate"},{"title":"Virtual Hack Day November 2020 – Diversity and Inclusion Theme","description":"<p>In November, colleagues from across product and engineering came together for our first ever remote hack day to encourage teams to think of ways in which we could develop technical solutions and make our news products more accessible and inclusive.</p><p>Late last year we held our second and final hack day of 2020. It was with a sense of excitement that colleagues across the Product and Engineering department were able to take time out of their every day responsibilities to let loose their creative brain power and innovate together.</p><p>In the first ever remote hack day, our focus was on diversity and accessibility, teams were encouraged to consider important issues around disability, race, gender or age in their designs.</p><p><em>The Guardian ran its first hack day for software developers and colleagues across the organisation in 2008 and ever since they’ve been a constant source of amazing, innovative ideas. We have the best, most brilliant team of engineers and it’s great to b","link":"https://www.theguardian.com/info/2021/jan/26/virtual-hack-day-november-2020-diversity-and-inclusion-theme","owner":"Guardian"}]