[{"title":"A glimpse into Data Science at Deliveroo","description":"<p><strong><em>Mahana, let’s start with a bit about you. You initially trained to do Judo at the London Olympics as a professional athlete, then got a PhD in Maths, then worked as a Software Engineer at Ocado, then became a Head of Data Science at The Guardian, and now you’re our Data Science Director. What a background! What brought you to Deliveroo?</em></strong></p>\n\n<p>It’s definitely not the most conventional of career journeys! In terms of what drew me here, it was, and is, mostly down to growth. Deliveroo has been one of the fastest growing companies in Europe in recent years, yet there’s still so much potential ahead. This year alone we want to more than double the size of our data science organisation!</p>\n\n<p>It also happened that my old boss Vince (from Ocado) reached out to me when he joined as VP Growth to see if I was interested in joining. We’re doing so much cool stuff here that goes beyond the realm of just food delivery into the future of food generally; it was an eas","link":"https://deliveroo.engineering/2021/03/19/a-glimpse-into-data-science.html","owner":"DeferPanic"},{"title":"Flyte Joins LF AI & Data","description":"","link":"https://eng.lyft.com/flyte-joins-lf-ai-data-48c9b4b60eec?source=rss----25cd379abb8---4","owner":"Localytics"},{"title":"Grofers Virtual Hackday 2020","description":"","link":"https://lambda.grofers.com/grofers-virtual-hackday-2020-99515ceaad5c?source=rss----42df4a1e8725---4","owner":"Grammarly"},{"title":"How Roblox Became One of Gaming’s Hottest Companies","description":"Roblox Corp. is an online gaming company with no history of blockbuster titles and whose biggest market is preteens. Yet, after its IPO in mid-March, the company’s value surpassed industry stalwart Electronic Arts Inc. So what’s the secret to its success?","link":"https://www.toptal.com/finance/market-research-analysts/roblox","owner":"Tinder"},{"title":"Insurance & credit scoring with alternative data","description":"Consumer scoring leveraging alternative datasets opens up markets for lenders & underwriters and provides access to credit/insurance to millions.","link":"https://www.zyte.com/blog/insurance-credit-scoring-enhanced-with-alternative-data/","owner":"Schibsted Tech Polska"},{"title":"PHP 8.0: Introducing the New PHP Version","description":null,"link":"https://www.hostinger.com/blog/introducing-php-8-0","owner":"Hootsuite"},{"title":"Public Tech Talk: “Refutation-based Adversarial Robustness Verification of Deep Neural Networks”","description":null,"link":"https://galois.com/blog/2021/03/public-tech-talk-refutation-based-adversarial-robustness-verification-of-deep-neural-networks/","owner":"Future Processing"},{"title":"Sponsored Post: Kinsta, Bridgecrew, IP2Location, StackHawk, InterviewCamp.io, Educative, Stream, Fauna, Triplebyte","description":"<p><img src=\"http://farm3.static.flickr.com/2363/5781449767_54902da8a5_o.jpg\" alt=\"\" align=\"RIGHT\" /></p>\r\n<h2>Who's Hiring?&nbsp;</h2>\r\n<ul>\r\n<li><strong>DevOps Engineer</strong>: At <strong>Kinsta</strong>, we set out to create the best managed hosting platform in the world. If you are an experienced DevOps Engineer who is constantly looking for ways to innovate and improve, we might just be the place for you! As Kinsta&rsquo;s DevOps Engineer, you will be instrumental in making sure that our infrastructure is always on the bleeding edge of technology, remaining stable and high-performing at all times. If you love working with Linux, have a background in PHP, and have worked with cutting-edge technologies, such as Ansible and LXC, check us out and<a href=\"https://kinsta.com/careers/devops-engineer/\"> apply here</a>. </li>\r\n<br />\r\n<li><strong> SysOps Enginee</strong>r: As <strong>Kinsta</strong>&rsquo;s SysOps Engineer, you&rsquo;ll play a key role in caring for the health of our ser","link":"http://feedproxy.google.com/~r/HighScalability/~3/1P9gbX-u8MA/sponsored-post-kinsta-bridgecrew-ip2location-stackhawk-inter.html","owner":"Henrik Warne"},{"title":"Women’s Voices — A Brand Story","description":"","link":"https://deezer.io/womens-voices-the-story-7e2876ebe3ea?source=rss----2ab7e077175a---4","owner":"DataFox"}]