[{"title":"(Call For Contribution) Make Universal Compaction More Incremental","description":"<h3 id=\"motivation\">Motivation</h3>\n\n<p>Universal Compaction is an important compaction style, but few changes were made after we made the structure multi-leveled. Yet the major restriction of always compacting full sorted run is not relaxed. Compared to Leveled Compaction, where we usually only compile several SST files together, in universal compaction, we frequently compact GBs of data. Two issues with this gap: 1. it makes it harder to unify universal and leveled compaction; 2. periodically data is fully compacted, and in the mean time space is doubled. To ease the problem, we can break the restriction and do similar as leveled compaction, and bring it closer to unified compaction.</p>\n\n<p>We call for help for making following improvements.</p>\n\n<h3 id=\"how-universal-compaction-works\">How Universal Compaction Works</h3>\n\n<p>In universal, whole levels are compacted together to satisfy two conditions (See <a href=\"https://github.com/facebook/rocksdb/wiki/Universal-Compaction\">wiki pa","link":"http://rocksdb.org/blog/2021/04/12/universal-improvements.html","owner":"Red"},{"title":"50 Top Server Monitoring, APM and Observability Tools","description":null,"link":"https://haydenjames.io/50-top-server-monitoring-application-performance-monitoring-apm-solutions/","owner":"Guilherme Rodrigues"},{"title":"Arch Linux installer, Project POCKIT and more | biweekly #6","description":null,"link":"https://haydenjames.io/arch-linux-installer-project-pockit-and-more-biweekly-6/","owner":"Guilherme Rodrigues"},{"title":"Build a Rails App with ActiveRecord and CockroachDB","description":"*Guest post alert! Marla and Ali worked with the Cockroach Labs team to get the ActiveRecord CockroachDB Adapter ready for Rails 5.2 and beyond! Their work with Cockroach Labs is done, but the adapter lives on. This blog post was originally shared on their blog at Test Double.*\n-&ndash;\nWhen I work in Rails apps, I don’t find myself worrying too much about the database. Since Rails natively supports popular databases like MySQL and PostgreSQL, I usually only need to make a few config changes to get an application’s database up and running.","link":"https://www.cockroachlabs.com/blog/app-rails-activerecord-cockroachdb/","owner":"Cloudflare"},{"title":"Email Servers: MTAs, MDAs, and MUAs","description":"An older article from Ars Technia on running your own email server/service. I have a distinct memory of looking into how all this worked back in the late 90s or early 00s (the memory’s distinct, the timeline isn’t) and being stymied by the complexity as some old Times New Roman text and a grey background started talking about MTAs, MDAs, and MUAs as if I already knew what they were. This Ars article is a more gentle introduction to the topic, and their simple acknowledgment that all this is complex and banana-cakes goes a long way. Once of my unscratched […]","link":"https://alanstorm.com/email-servers-mtas-mdas-and-muas/","owner":"Adrian Colyer"},{"title":"Flipr: Making Changes Quickly and Safely at Scale","description":null,"link":"https://eng.uber.com/flipr/","owner":"Twitch"},{"title":"Heroku Security: Securing your Heroku application","description":null,"link":"https://blog.sqreen.com/how-to-secure-your-heroku-application/","owner":"Spotify"},{"title":"Kali Linux non-root and no pen-test tools install w/ screenshots","description":null,"link":"https://haydenjames.io/kali-linux-non-root-install-screenshots/","owner":"Guilherme Rodrigues"},{"title":"Syntax Error: TypeError: this.getOptions is not a function","description":null,"link":"http://redino.net/blog/2021/04/syntax-error-typeerror-this-getoptions-is-not-a-function/?utm_source=rss&utm_medium=rss&utm_campaign=syntax-error-typeerror-this-getoptions-is-not-a-function","owner":"Redbubble"},{"title":"The Key to Unlocking IT Modernization’s Power? Enterprise level Transformation","description":null,"link":"https://blog.cloudera.com/the-key-to-unlocking-it-modernizations-power-enterprise-level-transformation/","owner":"CloudBees"}]