[{"title":"Aurora Builds Payment Acquiring Solution with CockroachDB on Kubernetes","description":"Imagine you show up at your favorite cafe and its credit card terminal is down. What happens? Most likely, you don’t have any cash on you. Instead, you go to the next cafe and order from them instead. We never want this to happen to one of our customers, so that’s why we chose to build our infrastructure on CockroachDB. At Aurora Payments, we make sure that small and medium sized businesses (SMBs) get paid quickly and with low fees.","link":"https://www.cockroachlabs.com/blog/payment-solution-architecture/","owner":"Cloudflare"},{"title":"Client Tracing: Understanding Mobile and Desktop Application Performance at Scale","description":null,"link":"https://slack.engineering/client-tracing-understanding-mobile-and-desktop-application-performance-at-scale/?utm_source=rss&utm_medium=rss&utm_campaign=client-tracing-understanding-mobile-and-desktop-application-performance-at-scale","owner":"Skyscanner"},{"title":"Congratulations to our 2021 Partner Award Winners","description":null,"link":"https://blog.cloudera.com/congratulations-to-our-2021-partner-award-winners/","owner":"CloudBees"},{"title":"Design an Effective Build Stage for Continuous Integration","description":null,"link":"https://semaphoreci.com/blog/build-stage","owner":"Semaphore CI Community"},{"title":"DigitalOcean becomes a public company","description":"Today is a proud day for all of us here at DigitalOcean. It’s also a tremendously exciting day for our customers and community. We are now officially listed on the New York Stock Exchange as a publicly traded company (NYSE: DOCN). While the IPO is an incredible milestone, I promise this is only the beginning of our journey together. ","link":"https://www.digitalocean.com/blog/digitalocean-becomes-a-public-company","owner":"Deliveroo"},{"title":"eBay Introduces Its New Seamless Unified Listing Experience","description":null,"link":"https://tech.ebayinc.com/product/ebay-introduces-its-new-seamless-unified-listing-experience/","owner":"Dropbox"},{"title":"Filter more pay less with the latest Cloudera Data Warehouse runtime!","description":null,"link":"https://blog.cloudera.com/filter-more-pay-less-with-the-latest-cloudera-data-warehouse-runtime/","owner":"CloudBees"},{"title":"How the iOS 14 update will impact your Facebook ads","description":"There’s no doubt that these changes will have noticeable consequences for Facebook advertisers across the board. Those who take the time to prepare now will be able to avoid a breakdown in conversion reporting and mitigate fluctuations in campaign performance.","link":"https://faraday.ai/blog/facebook-ads-ios-14-impacts/","owner":"Facebook AI Research"},{"title":"How to Accelerate Analytics for SaaS Developers","description":"SingleStore is a modern relational database for cloud and on-premises that delivers immediate insights for modern applications and analytical systems. Book a demo or trial today!","link":"https://www.singlestore.com/blog/how-to-accelerate-analytics-for-saas-developers","owner":"Medium"},{"title":"How to Use JSON Data Fields in MySQL Databases","description":"\n            ","link":"https://www.sitepoint.com/use-json-data-fields-mysql-databases/?utm_source=rss","owner":"Sift Science"},{"title":"How We Built A Context-Specific Bidding System for Etsy Ads","description":"Etsy Ads is an on-site advertising product that gives Etsy sellers the opportunity to promote their handcrafted goods to buyers across our website and mobile apps. Sellers who participate in the Etsy Ads program are acting as bidders in an automated, real-time auction that allows their listings to be highlighted alongside organic search results, when […]","link":"https://codeascraft.com/2021/03/23/how-we-built-a-context-specific-bidding-system-for-etsy-ads/","owner":"Erlang Solutions"},{"title":"How we ran our last hack day","description":"<p>I joined Getaround, which was still named Drivy back then, two years ago. My previous and most extended professional experience had an internal organization that did not allow me to code full time, so many of my technical projects were actually side projects working alone.</p>\n","link":"https://getaround.tech/hackday-4-full-remote/","owner":"Doximity"},{"title":"Improving OpenVPN performance and throughput","description":null,"link":"https://haydenjames.io/improving-openvpn-performance-and-throughput/","owner":"Guilherme Rodrigues"},{"title":"Introducing Epoxy for iOS","description":"","link":"https://medium.com/airbnb-engineering/introducing-epoxy-for-ios-6bf062be1670?source=rss----53c7c27702d5---4","owner":"Advanced Web Machinery"},{"title":"Prioritizing Health Pros' Pain Points in Connected Medical Device Design","description":"In life-or-death situations, Internet of Medical Things-enabled devices are helpful only if healthcare professionals are willing to use them.","link":"https://www.toptal.com/insights/innovation/connected-medical-device-design","owner":"Tinder"},{"title":"Squeaky Portraits: Having Fun with the CSS path() Function","description":"\n            ","link":"https://www.sitepoint.com/css-path-function-squeaky-portraits/?utm_source=rss","owner":"Sift Science"},{"title":"Stored XSS, explained: How to prevent stored XSS in your app","description":null,"link":"https://blog.sqreen.com/stored-xss-explained/","owner":"Spotify"},{"title":"Why do outages still happen in 2021?","description":"Disasters happen. (Most) outages shouldn’t.\nWhen multi-billion dollar companies like Zoom, Slack, and Fanduel experience outages, the reaction from users tends to be anger and surprise. Anger, because people need to get their work done and set their fantasy football lineups. Surprise, because it’s 2021. Isn’t high availability the norm?\nNot all outages are created equal. Though they have a similar impact on end users, they happen for all kinds of reasons.","link":"https://www.cockroachlabs.com/blog/why-do-database-outages-happen/","owner":"Cloudflare"},{"title":"Women’s Voices — A Data Story","description":"","link":"https://deezer.io/womens-voices-a-data-story-1707432b6157?source=rss----2ab7e077175a---4","owner":"DataFox"}]