[{"title":"[Team & Project] Introducing the Team Developing Web Front-end for LINE User Services","description":null,"link":"https://engineering.linecorp.com/en/blog/team-and-project-introducing-the-team-developing-web-frontend-for-line-user-services/","owner":"LendingHome"},{"title":"10 Client-side Storage Options and When to Use Them","description":"\n            ","link":"https://www.sitepoint.com/client-side-storage-options-comparison/?utm_source=rss","owner":"Sift Science"},{"title":"20 years of Hibernate","description":null,"link":"https://vladmihalcea.com/20-years-of-hibernate/","owner":"Vanilla Java"},{"title":"4 Things I Like About Microservices","description":"Microservices have gone through a complete hype cycle. From being hailed as the one true way to build systems, to a backlash where they are often considered too difficult and complex. In a way though, they are like most technology … ","link":"https://henrikwarne.com/2021/05/24/4-things-i-like-about-microservices/","owner":"Henrik Lau Eriksson"},{"title":"An Introductory Guide to Brython","description":"In this introduction to Brython, we'll take a look at what it is, how to install it, and how to initialize a Brython project, as well as how to perform basic tasks, with examples.","link":"https://stackabuse.com/an-introductory-guide-to-brython","owner":"Srinivas Tamada"},{"title":"Auth0 Welcomes Natalie Hausia-Haugen to the Team","description":"Auth0’s SVP of People sits down with the team’s First Head of Diversity, Equity, and Inclusion for a Q&A.","link":"https://auth0.com/blog/auth0-welcomes-natalie-hausia-haugen-to-the-team/","owner":"Atomic Object"},{"title":"AWS Lambda Extensions Are Now Generally Available – Get Started with Your Favorite Operations Tools Today","description":"In October 2020, we announced the preview of AWS Lambda extensions, which you can use to easily integrate Lambda functions with your favorite tools for monitoring, observability, security, and governance. Today, I’m happy to announce the general availability of AWS Lambda Extensions which comes with new performance improvements and an expanded set of partners. As […]","link":"https://aws.amazon.com/blogs/aws/getting-started-with-using-your-favorite-operational-tools-on-aws-lambda-extensions-are-now-generally-available/","owner":"Avenue Code"},{"title":"Building a Hyper Self-Service, Distributed Tracing and Feedback System for Rule & Machine Learning (ML) Predictions","description":"<h2 id=\"introduction\">Introduction</h2>\n\n<p>In Grab, the Trust, Identity, Safety, and Security (TISS) is a team of software engineers and AI developers working on fraud detection, login identity check, safety issues, etc. There are many TISS services, like grab-fraud, grab-safety, and grab-id. They make billions of business decisions daily using the <a href=\"https://engineering.grab.com/griffin\">Griffin rule engine</a>, which determines if a passenger can book a trip, get a food promotion, or if a driver gets a delivery booking.</p>\n\n<p>There is a natural demand to log down all these important business decisions, store them and query them interactively or in batches. Data analysts and scientists need to use the data to train their machine learning models. RiskOps and customer service teams can query the historical data and help consumers.</p>\n\n<p>That’s where Archivist comes in; it is a new tracing, statistics and feedback system for rule and machine learning-based predictions. It is r","link":"https://engineering.grab.com/building-hyper-self-service-distributed-tracing-feedback-system","owner":"GO-JEK"},{"title":"Core Data In Memory Store","description":"<p>Speed up your tests and SwiftUI previews by creating your Core Data stack with an in-memory store.</p>\n<p>The Core Data stack uses an on-disk SQLite store by default. That causes some extra work when running tests as you need to reset the store to a known state before each test. It&rsquo;s also slow which is a pain if you&rsquo;re working with SwiftUI previews.</p>\n<h3 id=\"in-memory-store\">In Memory Store</h3>\n<p>The old way of creating an in-memory store was to change the store type in the persistent store descriptor before loading the store. The default is <code>NSSQLiteStoreType</code> but we can switch to <code>NSInMemoryStoreType</code>:</p>\n<div class=\"highlight\"><pre class=\"chroma\"><code class=\"language-swift\" data-lang=\"swift\"><span class=\"n\">storeDescription</span><span class=\"p\">.</span><span class=\"n\">type</span> <span class=\"p\">=</span> <span class=\"n\">NSInMemoryStoreType</span>\n</code></pre></div><p><strong>There&rsquo;s nothing I can find in the documentation but Apple","link":"https://useyourloaf.com/blog/core-data-in-memory-store/","owner":"Juri Strumpflohner"},{"title":"DigitalOcean’s virtual conference is back! Join us at deploy, Power Your Business ","description":"DigitalOcean is gearing up for another edition of its signature conference, deploy, with the goal of celebrating, educating, and connecting awesome builders from all over the world. Last year we succeeded in bringing together over 5k developers from all over the world to discuss important topics like building cloud-native apps and open source tools. On June 29th, we continue building on that success by bringing you another event that has you and your business in mind. This year’s conference is focused on helping small businesses and startups scale on the cloud. We’re excited to introduce deploy, Power Your Business.","link":"https://www.digitalocean.com/blog/deploy-power-your-business","owner":"Deliveroo"},{"title":"First-Hand Experience: Deep Learning Lets Amputee Control Prosthetic Hand, Video Games","description":null,"link":"https://blogs.nvidia.com/blog/2021/05/24/deep-learning-amputee-prosthetic-hand-video-games/","owner":"NPR Apps"},{"title":"Highly-Loaded PHP Applications with LiteSpeed Web Server","description":null,"link":"https://www.rosehosting.com/blog/highly-loaded-php-applications-with-litespeed-web-server/","owner":"RisingStack"},{"title":"How Is Swiss Italian Different From The Italian Spoken In Italy?","description":null,"link":"https://www.babbel.com/en/magazine/swiss-italian","owner":"Azavea"},{"title":"How to dynamically route HTTPS traffic to LXD instances","description":"Dynamically route HTTPS traffic to LXD instances on a development server. LXD uses bridged networking by default, so get lxdbr0 IP address as it is used by the dnsmasq service to serve DHCP and DNS requests. $ lxc network get lxdbr0 ipv4.address 10.97.179.1/24 Install nginx HTTP and reverse proxy server as it will be used […]","link":"https://sleeplessbeastie.eu/2021/05/24/how-to-dynamically-route-https-traffic-to-lxd-instances/","owner":"Mike Fogus"},{"title":"How to Get Started with Canvas Animations in JavaScript","description":null,"link":"https://medium.com/dailyjs/how-to-get-started-with-canvas-animations-in-javascript-cb2ccf37515c?source=rss----f5105b08f43a---4","owner":"Codrops"},{"title":"Increasing Insights and Productivity Using Feature Flags Across CI/CD","description":"Having a flag management tool that can determine which type of flag is which, and provide recommendations for flag removal or monitoring helps eliminate the bloated code headaches created from feature flags. It doesn’t matter how trivial or complicated a feature is, flags must become a standard part of software creation for all developers to get maximum impact of their benefits. Feature flags can become a liability without shared governance, and for that reason, enterprise flag management platforms are focused on creating pipeline-wide shared visibility of flag status across all teams.","link":"https://www.cloudbees.com/blog/using-feature-flags-across-cicd","owner":"CleverTap"},{"title":"Insights on Creating Trust and Safety on the Internet Featuring Gartner Research","description":null,"link":"https://blog.sift.com/2021/insights-on-creating-trust-and-safety-on-the-internet-featuring-gartner-research/?utm_source=rss&utm_medium=rss&utm_campaign=insights-on-creating-trust-and-safety-on-the-internet-featuring-gartner-research","owner":"Shyp"},{"title":"Is the current tab active?","description":"Today I ran into an interesting problem. Interesting because it’s one of those very straightforward, deceptively simple questions, that after a fair amount of digging, does not appear to have a definite answer (though I would love to be wrong!). The problem was to determine if the current tab is active. Yes, as simple as […]","link":"http://feedproxy.google.com/~r/leaverou/~3/YPAezrj9qVA/","owner":"Lazarus Lazaridis"},{"title":"On static methods in the Windows Runtime and C++/WinRT","description":null,"link":"https://devblogs.microsoft.com/oldnewthing/20210524-00/?p=105240","owner":"Ray Wenderlich"},{"title":"Pushing Past Pilot Paralysis to Launch and Scale IIOT Use Cases","description":null,"link":"https://blog.cloudera.com/pushing-past-pilot-paralysis-to-launch-and-scale-iiot-use-cases/","owner":"CloudBees"},{"title":"Role Management at Slack","description":null,"link":"https://slack.engineering/role-management-at-slack/?utm_source=rss&utm_medium=rss&utm_campaign=role-management-at-slack","owner":"Skyscanner"},{"title":"SurveyMonkey Market Research Solutions Pulse: Private Labels vs. Name Brands","description":"","link":"https://www.surveymonkey.com/curiosity/surveymonkey-market-research-solutions-pulse-private-labels-vs-name-brands/?ut_source=rss","owner":"Stripe"},{"title":"The Four Upgrade and Migration Paths to CDP from Legacy Distributions","description":null,"link":"https://blog.cloudera.com/the-four-upgrade-and-migration-paths-to-cdp-from-legacy-distributions/","owner":"CloudBees"},{"title":"Unpacking eBay’s New SQL Authoring Tool for Data Creation and Management","description":null,"link":"https://tech.ebayinc.com/engineering/unpacking-ebays-new-sql-authoring-tool-for-data-creation-and-management/","owner":"Dropbox"},{"title":"Using io_uring to make a high-performance... finger server","description":"<p>I&rsquo;m working on adding a wrapper for the <a href=\"https://unixism.net/loti/what_is_io_uring.html\">Linux io_uring interface</a> to my\n<a href=\"https://drewdevault.com/2021/03/19/A-new-systems-language.html\">secret programming language project</a>. To help learn more about io_uring and\nto test out the interface I was designing, I needed a small project whose design\nwas well-suited for the value-add of io_uring. The <a href=\"https://en.wikipedia.org/wiki/Finger_protocol\">Finger protocol</a> is\nperfect for this! After being designed in the 70&rsquo;s and then completely forgotten\nabout for 50 years, it&rsquo;s the perfect small and simple network protocol to test\ndrive this new interface with.</p>\n<p>In short, finger will reach out to a remote server and ask for information about\na user. It was used back in the day to find contact details like the user&rsquo;s\nphone number, office address, email address, sometimes their favorite piece of\nASCII art, and, later, a summary of the thin","link":"https://drewdevault.com/2021/05/24/io_uring-finger-server.html","owner":"Dragan Gaic"},{"title":"What Are Biometrics? The Pros/Cons of Biometric Security","description":"Biometrics can reduce security risks, but they're not impenetrable. Here's what you need to know.","link":"https://auth0.com/blog/what-are-biometrics-the-proscons-of-biometric-security/","owner":"Atomic Object"},{"title":"What is Application Performance Monitoring (APM) and Why Do You Need It?","description":"\n                                    ","link":"https://laravel-news.com/what-is-application-performance-monitoring","owner":"Kotlin"},{"title":"What Is Explainable AI?","description":null,"link":"https://blogs.nvidia.com/blog/2021/05/24/what-is-explainable-ai/","owner":"NPR Apps"},{"title":"What’s new in KMM since going Alpha","description":"Kotlin Multiplatform Mobile (KMM), an SDK for cross-platform mobile development, went Alpha in August 2020. Over the past 9 months, the KMM ecosystem has been rapidly evolving: Each new Kotlin version comes with features and improvements that enhance the multiplatform development experience. KMM development tools, such as the KMM Plugin for Android Studio, are constantly […]","link":"https://blog.jetbrains.com/kotlin/2021/05/whats-new-in-kmm-since-going-alpha/","owner":"Klipse"},{"title":"Who Tests the Tester?","description":"<p style=\"float:right; padding-left:10px; padding-bottom:10px;\"><a title=\"User Gflores on en.wikipedia, Public domain, via Wikimedia Commons\" href=\"https://commons.wikimedia.org/wiki/File:Computer_keyboard.png\"><img itemprop=\"image\" width=\"300\" alt=\"Computer keyboard\" src=\"https://upload.wikimedia.org/wikipedia/commons/4/4e/Computer_keyboard.png\"/></a></p>\r\n\r\n<p>The year was 2001: the year before many countries in the EU switched from using their national currency to the new euro. As part of the switch, many financial software packages had to be upgraded. Today&#39;s submitter, <b>Salim</b>, was hired as an IT support staffer in a medium-sized healthcare organization in the Netherlands. While Salim had a number of colleagues, they had to support a greater number of small satellite offices, and so on occasion any of them would be left to hold the main office alone. It just so happened that Salim&#39;s first solo day was the day they were testing the software upgrade, with the CFO himsel","link":"https://thedailywtf.com/articles/who-tests-the-tester","owner":"The Coded Self"}]